-- phpMyAdmin SQL Dump
-- version 5.2.3deb1
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Erstellungszeit: 29. Okt 2026 um 02:20
-- Server-Version: 11.8.6-MariaDB-5ubuntu0.1 from Ubuntu
-- PHP-Version: 8.5.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Datenbank: `isms_dump`
--

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `Abteilungen`
--

CREATE TABLE `Abteilungen` (
  `id` int(11) NOT NULL,
  `name` varchar(150) NOT NULL,
  `leitung_id` int(11) DEFAULT NULL,
  `parent_id` int(11) DEFAULT NULL,
  `beschreibung` text DEFAULT NULL,
  `sortierung` int(11) NOT NULL DEFAULT 0,
  `farbe` varchar(7) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `activities`
--

CREATE TABLE `activities` (
  `id` int(10) UNSIGNED NOT NULL,
  `datumuhrzeit` datetime NOT NULL DEFAULT current_timestamp(),
  `user` int(10) UNSIGNED DEFAULT NULL,
  `nummer` varchar(255) NOT NULL,
  `bereich` varchar(255) DEFAULT NULL,
  `was` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `activities`
--

INSERT INTO `activities` (`id`, `datumuhrzeit`, `user`, `nummer`, `bereich`, `was`) VALUES
(26, '2026-01-09 10:46:16', 1, 'RSK-45', 'Risiken', 'geändert'),
(27, '2026-01-09 10:47:34', 1, 'RSK-2', 'Risiken', 'geändert'),
(28, '2026-01-09 10:52:09', 1, 'RSK-3', 'Risiken', 'geändert'),
(29, '2026-01-09 10:52:21', 1, 'RSK-3', 'Risiken', 'geändert'),
(30, '2026-01-09 10:53:40', 1, '2', 'Risiken', 'Review 1 Jahr'),
(31, '2026-01-09 10:53:50', 1, '4', 'Risiken', 'Review 1 Monat'),
(32, '2026-01-09 10:53:56', 1, '4', 'Risiken', 'Review 1 Jahr'),
(33, '2026-01-09 10:55:22', 1, 'RSK-4', 'Risiken', 'geändert'),
(34, '2026-01-09 11:22:23', 1, 'RSK-5', 'Risiken', 'geändert'),
(35, '2026-01-09 11:23:19', 1, 'RSK-6', 'Risiken', 'geändert'),
(36, '2026-01-09 11:24:12', 1, '5', 'Risiken', 'Review 1 Jahr'),
(37, '2026-01-09 11:24:28', 1, '6', 'Risiken', 'Review 1 Jahr'),
(38, '2026-01-09 11:24:39', 1, '7', 'Risiken', 'Review 1 Jahr'),
(39, '2026-01-09 11:25:47', 1, 'RSK-7', 'Risiken', 'geändert'),
(40, '2026-01-09 11:25:51', 1, '8', 'Risiken', 'Review 1 Jahr'),
(41, '2026-01-09 11:26:46', 1, 'RSK-29', 'Risiken', 'geändert'),
(42, '2026-01-09 11:27:39', 1, 'RSK-8', 'Risiken', 'geändert'),
(43, '2026-01-09 11:27:43', 1, '9', 'Risiken', 'Review 1 Jahr'),
(44, '2026-01-09 11:29:06', 1, 'RSK-9', 'Risiken', 'geändert'),
(45, '2026-01-09 11:29:09', 1, '10', 'Risiken', 'Review 1 Jahr'),
(46, '2026-01-09 11:31:07', 1, 'RSK-10', 'Risiken', 'geändert'),
(47, '2026-01-09 11:31:09', 1, '11', 'Risiken', 'Review 1 Jahr'),
(48, '2026-01-09 11:32:19', 1, 'RSK-14', 'Risiken', 'geändert'),
(49, '2026-01-09 11:32:21', 1, '15', 'Risiken', 'Review 1 Jahr'),
(50, '2026-01-09 11:33:17', 1, 'RSK-11', 'Risiken', 'geändert'),
(51, '2026-01-09 11:33:19', 1, '12', 'Risiken', 'Review 1 Jahr'),
(52, '2026-01-09 11:34:12', 1, 'RSK-32', 'Risiken', 'geändert'),
(53, '2026-01-09 11:34:57', 1, 'RSK-12', 'Risiken', 'geändert'),
(54, '2026-01-09 11:35:00', 1, '13', 'Risiken', 'Review 1 Jahr'),
(55, '2026-01-09 11:35:37', 1, 'RSK-13', 'Risiken', 'geändert'),
(56, '2026-01-09 11:36:27', 1, 'RSK-18', 'Risiken', 'geändert'),
(57, '2026-01-09 11:36:43', 1, 'RSK-18', 'Risiken', 'geändert'),
(58, '2026-01-09 11:38:01', 1, '5', 'Maßnahmen', 'Review 1 Monat'),
(59, '2026-01-09 11:38:18', 1, '6', 'Maßnahmen', 'Review 1 Monat'),
(60, '2026-01-09 11:38:33', 1, 'MAS-6', 'Maßnahmen', 'geändert'),
(61, '2026-01-09 11:38:38', 1, '6', 'Maßnahmen', 'Review 1 Monat'),
(62, '2026-01-09 11:39:22', 1, '7', 'Maßnahmen', 'Review 1 Monat'),
(63, '2026-01-09 12:16:12', 1, 'MAS-3', 'Maßnahmen', 'geändert'),
(64, '2026-01-09 12:16:19', 1, 'MAS-3', 'Maßnahmen', 'geändert'),
(65, '2026-01-09 12:16:47', 1, 'RSK-13', 'Risiken', 'geändert'),
(66, '2026-01-09 12:21:06', 1, '', 'ISMS', 'Login'),
(67, '2026-01-09 12:25:45', 1, '', 'ISMS', 'Login'),
(68, '2026-01-09 13:55:15', 1, '', 'ISMS', 'Login'),
(69, '2026-01-09 13:56:24', 1, 'RSK-15', 'Risiken', 'geändert'),
(70, '2026-01-09 13:56:28', 1, '16', 'Risiken', 'Review 1 Jahr'),
(71, '2026-01-09 14:07:14', 1, 'RSK-16', 'Risiken', 'geändert'),
(72, '2026-01-09 14:08:43', 1, 'RSK-17', 'Risiken', 'geändert'),
(73, '2026-01-09 14:08:46', 1, '18', 'Risiken', 'Review 1 Jahr'),
(74, '2026-01-09 14:08:58', 1, '17', 'Risiken', 'Review 1 Jahr'),
(75, '2026-01-09 14:09:25', 1, 'RSK-17', 'Risiken', 'geändert'),
(76, '2026-01-09 14:10:28', 1, 'RSK-19', 'Risiken', 'geändert'),
(77, '2026-01-09 14:11:14', 1, 'RSK-20', 'Risiken', 'geändert'),
(78, '2026-01-09 14:11:19', 1, '21', 'Risiken', 'Review 1 Jahr'),
(79, '2026-01-09 14:11:54', 1, '14', 'Risiken', 'Review 1 Jahr'),
(80, '2026-01-09 14:12:11', 1, '19', 'Risiken', 'Review 1 Jahr'),
(81, '2026-01-09 14:12:23', 1, '20', 'Risiken', 'Review 1 Jahr'),
(82, '2026-01-09 14:17:29', 1, 'RSK-21', 'Risiken', 'geändert'),
(83, '2026-01-09 14:18:01', 1, 'RSK-23', 'Risiken', 'geändert'),
(84, '2026-01-09 14:18:05', 1, '24', 'Risiken', 'Review 1 Jahr'),
(85, '2026-01-09 14:18:41', 1, '22', 'Risiken', 'Review 1 Jahr'),
(86, '2026-01-09 14:19:39', 1, '29', 'Risiken', 'Review 1 Jahr'),
(87, '2026-01-09 14:20:00', 1, '27', 'Risiken', 'Review 1 Monat'),
(88, '2026-01-09 14:20:15', 1, '28', 'Risiken', 'Review 1 Monat'),
(89, '2026-01-09 14:20:35', 1, '30', 'Risiken', 'Review 1 Jahr'),
(90, '2026-01-09 14:20:49', 1, '31', 'Risiken', 'Review 1 Jahr'),
(91, '2026-01-09 14:21:26', 1, '34', 'Risiken', 'Review 1 Jahr'),
(92, '2026-01-09 14:21:53', 1, '32', 'Risiken', 'Review 1 Jahr'),
(93, '2026-01-09 14:22:26', 1, '33', 'Risiken', 'Review 1 Monat'),
(94, '2026-01-09 14:22:40', 1, '35', 'Risiken', 'Review 1 Jahr'),
(95, '2026-01-09 14:23:10', 1, '36', 'Risiken', 'Review 1 Jahr'),
(96, '2026-01-09 14:24:11', 1, '37', 'Risiken', 'Review 1 Jahr'),
(97, '2026-01-09 15:45:29', 1, 'RSK-22', 'Risiken', 'geändert'),
(98, '2026-01-09 15:45:34', 1, '23', 'Risiken', 'Review 1 Jahr'),
(99, '2026-01-09 17:23:31', 1, '', 'ISMS', 'Login'),
(100, '2026-01-09 17:24:02', 1, '38', 'Risiken', 'Review 1 Jahr'),
(101, '2026-01-09 17:24:17', 1, '39', 'Risiken', 'Review 1 Jahr'),
(102, '2026-01-09 17:36:18', 1, '40', 'Risiken', 'Review 1 Jahr'),
(103, '2026-01-09 17:37:30', 1, '41', 'Risiken', 'Review 1 Jahr'),
(104, '2026-01-09 17:37:55', 1, '45', 'Risiken', 'Review 1 Jahr'),
(105, '2026-01-10 02:46:44', 1, '3', 'Normen', 'geändert'),
(106, '2026-01-10 02:50:21', 1, '4', 'Normen', 'geändert'),
(107, '2026-01-10 02:50:42', 1, '238', 'Normen', 'Review 1 Monat'),
(108, '2026-01-10 02:50:51', 1, '239', 'Normen', 'Review 1 Monat'),
(109, '2026-01-10 02:51:03', 1, '240', 'Normen', 'Review 1 Monat'),
(110, '2026-01-10 02:51:24', 1, '241', 'Normen', 'Review 1 Monat'),
(111, '2026-01-10 02:53:18', 1, '5', 'Normen', 'geändert'),
(112, '2026-01-10 02:59:58', 1, '6', 'Normen', 'geändert'),
(113, '2026-01-10 03:04:43', 1, '7', 'Normen', 'geändert'),
(114, '2026-01-10 03:09:49', 1, '8', 'Normen', 'geändert'),
(115, '2026-01-10 03:11:03', 1, '9', 'Normen', 'geändert'),
(116, '2026-01-10 03:13:55', 1, '10', 'Normen', 'geändert'),
(117, '2026-01-10 03:15:41', 1, 'MAS-8', 'Maßnahmen', 'angelegt'),
(118, '2026-01-10 03:15:57', 1, 'MAS-8', 'Maßnahmen', 'geändert'),
(119, '2026-01-10 05:51:57', 1, '', 'ISMS', 'Login'),
(120, '2026-01-10 08:44:30', 1, '', 'ISMS', 'Login'),
(121, '2026-01-10 10:15:20', 1, 'MAS-8', 'Maßnahmen', 'geändert'),
(122, '2026-01-10 11:10:14', 1, 'VND-5', 'Lieferanten', 'geändert'),
(123, '2026-01-10 11:38:58', 1, 'VND-8', 'Lieferanten', 'geändert'),
(124, '2026-01-10 11:39:11', 1, 'VND-15', 'Lieferanten', 'geändert'),
(125, '2026-01-10 11:39:20', 1, 'VND-17', 'Lieferanten', 'geändert'),
(126, '2026-01-10 11:39:28', 1, 'VND-19', 'Lieferanten', 'geändert'),
(127, '2026-01-10 11:39:52', 1, 'VND-20', 'Lieferanten', 'geändert'),
(128, '2026-01-10 11:40:01', 1, 'VND-22', 'Lieferanten', 'geändert'),
(129, '2026-01-10 11:40:19', 1, 'VND-23', 'Lieferanten', 'geändert'),
(130, '2026-01-10 11:40:26', 1, 'VND-24', 'Lieferanten', 'geändert'),
(131, '2026-01-10 11:40:33', 1, 'VND-25', 'Lieferanten', 'geändert'),
(132, '2026-01-10 11:41:06', 1, 'VND-26', 'Lieferanten', 'geändert'),
(133, '2026-01-10 11:41:23', 1, 'VND-27', 'Lieferanten', 'geändert'),
(134, '2026-01-10 11:41:29', 1, 'VND-32', 'Lieferanten', 'geändert'),
(135, '2026-01-10 11:41:35', 1, 'VND-33', 'Lieferanten', 'geändert'),
(136, '2026-01-10 11:41:46', 1, 'VND-28', 'Lieferanten', 'geändert'),
(137, '2026-01-10 11:41:58', 1, 'VND-29', 'Lieferanten', 'geändert'),
(138, '2026-01-10 11:42:14', 1, 'VND-1', 'Lieferanten', 'geändert'),
(139, '2026-01-10 11:42:39', 1, 'VND-30', 'Lieferanten', 'geändert'),
(140, '2026-01-10 11:42:45', 1, 'VND-31', 'Lieferanten', 'geändert'),
(141, '2026-01-10 11:44:10', 1, 'VND-17', 'Lieferanten', 'geändert'),
(142, '2026-01-10 11:44:23', 1, 'VND-19', 'Lieferanten', 'geändert'),
(143, '2026-01-10 12:05:16', 1, 'POL-8', 'Dokumente', 'geändert'),
(144, '2026-01-10 12:06:27', 1, 'POL-3', 'Dokumente', 'geändert'),
(145, '2026-01-10 12:06:59', 1, 'POL-9', 'Dokumente', 'geändert'),
(146, '2026-01-10 12:08:34', 1, 'POL-8', 'Dokumente', 'geändert'),
(147, '2026-01-10 14:31:35', 1, '', 'ISMS', 'Login'),
(148, '2026-01-10 14:56:26', 1, '245', 'Normen', 'Review 1 Monat'),
(149, '2026-01-10 14:57:35', 1, '242', 'Normen', 'Review 1 Monat'),
(150, '2026-01-10 15:00:02', 1, '243', 'Normen', 'Review 1 Monat'),
(151, '2026-01-10 15:00:37', 1, '244', 'Normen', 'Review 1 Monat'),
(152, '2026-01-10 15:01:32', 1, '246', 'Normen', 'Review 1 Monat'),
(153, '2026-01-10 15:03:57', 1, '247', 'Normen', 'Review 1 Monat'),
(154, '2026-01-10 15:04:54', 1, '246', 'Normen', 'Review 1 Monat'),
(155, '2026-01-10 15:05:47', 1, '246', 'Normen', 'Review 1 Monat'),
(156, '2026-01-10 15:06:22', 1, '246', 'Normen', 'Review 1 Monat'),
(157, '2026-01-10 15:08:38', 1, '246', 'Normen', 'Review 1 Monat'),
(158, '2026-01-10 15:09:36', 1, '246', 'Normen', 'Review 1 Monat'),
(159, '2026-01-10 15:11:44', 1, '11', 'Normen', 'geändert'),
(160, '2026-01-10 15:11:49', 1, '248', 'Normen', 'Review 1 Monat'),
(161, '2026-01-10 15:12:33', 1, '12', 'Normen', 'geändert'),
(162, '2026-01-10 15:12:36', 1, '249', 'Normen', 'Review 1 Monat'),
(163, '2026-01-10 15:13:00', 1, '13', 'Normen', 'geändert'),
(164, '2026-01-10 15:13:53', 1, '250', 'Normen', 'Review 1 Monat'),
(165, '2026-01-10 15:14:59', 1, '§20', 'Normen', 'geändert'),
(166, '2026-01-10 15:15:02', 1, '289', 'Normen', 'Review 1 Monat'),
(167, '2026-01-10 15:15:33', 1, '§21', 'Normen', 'geändert'),
(168, '2026-01-10 15:15:44', 1, '290', 'Normen', 'Review 1 Monat'),
(169, '2026-01-10 15:28:58', 1, '§23', 'Normen', 'geändert'),
(170, '2026-01-10 15:29:06', 1, '§23', 'Normen', 'geändert'),
(171, '2026-01-10 15:30:31', 1, '§24', 'Normen', 'geändert'),
(172, '2026-01-10 15:31:07', 1, '§25', 'Normen', 'geändert'),
(173, '2026-01-10 15:32:40', 1, '293', 'Normen', 'Review 1 Monat'),
(174, '2026-01-10 15:32:48', 1, '292', 'Normen', 'Review 1 Monat'),
(175, '2026-01-10 15:32:56', 1, '291', 'Normen', 'Review 1 Monat'),
(176, '2026-01-10 15:33:55', 1, '§27', 'Normen', 'geändert'),
(177, '2026-01-10 15:33:58', 1, '295', 'Normen', 'Review 1 Monat'),
(178, '2026-01-10 15:34:34', 1, '§32-34', 'Normen', 'geändert'),
(179, '2026-01-10 15:34:37', 1, '296', 'Normen', 'Review 1 Monat'),
(180, '2026-01-10 15:36:32', 1, '§26', 'Normen', 'geändert'),
(181, '2026-01-10 15:36:35', 1, '294', 'Normen', 'Review 1 Monat'),
(182, '2026-01-10 15:37:00', 1, '§3&4', 'Normen', 'geändert'),
(183, '2026-01-10 15:37:03', 1, '297', 'Normen', 'Review 1 Monat'),
(184, '2026-01-10 15:37:46', 1, 'AST-5', 'Assets', 'geändert'),
(185, '2026-01-10 15:46:49', 1, 'VND-17', 'Lieferanten', 'geändert'),
(186, '2026-01-10 15:53:22', 1, 'MAS-6', 'Maßnahmen', 'geändert'),
(187, '2026-01-11 09:47:55', 1, '', 'ISMS', 'Login'),
(188, '2026-01-11 10:09:57', 1, 'AST-20', 'Assets', 'angelegt'),
(189, '2026-01-11 10:10:32', 1, 'AST-20', 'Assets', 'geändert'),
(190, '2026-01-11 10:51:42', 1, 'AST-20', 'Assets', 'geändert'),
(191, '2026-01-11 10:52:12', 1, 'AST-21', 'Assets', 'angelegt'),
(192, '2026-01-11 10:52:27', 1, 'AST-21', 'Assets', 'geändert'),
(193, '2026-01-11 10:53:58', 1, 'AST-22', 'Assets', 'angelegt'),
(194, '2026-01-11 10:56:47', 1, 'AST-20', 'Assets', 'geändert'),
(195, '2026-01-11 10:57:12', 1, 'AST-23', 'Assets', 'angelegt'),
(196, '2026-01-11 10:57:44', 1, 'AST-23', 'Assets', 'geändert'),
(197, '2026-01-11 10:58:14', 1, 'AST-22', 'Assets', 'geändert'),
(198, '2026-01-11 10:58:45', 1, 'AST-20', 'Assets', 'geändert'),
(199, '2026-01-11 10:59:00', 1, 'AST-21', 'Assets', 'geändert'),
(200, '2026-01-11 10:59:30', 1, 'AST-24', 'Assets', 'angelegt'),
(201, '2026-01-11 11:00:04', 1, 'AST-24', 'Assets', 'geändert'),
(202, '2026-01-11 11:00:34', 1, 'AST-25', 'Assets', 'angelegt'),
(203, '2026-01-11 11:00:51', 1, 'AST-25', 'Assets', 'geändert'),
(204, '2026-01-11 11:01:28', 1, 'AST-26', 'Assets', 'angelegt'),
(205, '2026-01-11 11:01:43', 1, 'AST-26', 'Assets', 'geändert'),
(206, '2026-01-11 11:05:25', 1, 'AST-19', 'Assets', 'geändert'),
(207, '2026-01-11 11:08:14', 1, 'AST-27', 'Assets', 'angelegt'),
(208, '2026-01-11 11:08:42', 1, 'AST-27', 'Assets', 'geändert'),
(209, '2026-01-11 11:09:28', 1, 'AST-28', 'Assets', 'angelegt'),
(210, '2026-01-11 11:09:50', 1, 'AST-28', 'Assets', 'geändert'),
(211, '2026-01-11 11:10:26', 1, 'AST-29', 'Assets', 'angelegt'),
(212, '2026-01-11 11:10:49', 1, 'AST-29', 'Assets', 'geändert'),
(213, '2026-01-11 11:11:00', 1, 'AST-29', 'Assets', 'geändert'),
(214, '2026-01-11 11:11:50', 1, 'AST-30', 'Assets', 'angelegt'),
(215, '2026-01-11 11:12:28', 1, 'AST-30', 'Assets', 'geändert'),
(216, '2026-01-11 11:12:53', 1, 'AST-31', 'Assets', 'angelegt'),
(217, '2026-01-11 11:13:10', 1, 'AST-31', 'Assets', 'geändert'),
(218, '2026-01-11 11:13:47', 1, 'AST-32', 'Assets', 'angelegt'),
(219, '2026-01-11 11:14:09', 1, 'AST-32', 'Assets', 'geändert'),
(220, '2026-01-11 11:14:56', 1, 'AST-33', 'Assets', 'angelegt'),
(221, '2026-01-11 11:15:18', 1, 'AST-33', 'Assets', 'geändert'),
(222, '2026-01-11 11:15:56', 1, 'AST-34', 'Assets', 'angelegt'),
(223, '2026-01-11 11:16:18', 1, 'AST-34', 'Assets', 'geändert'),
(224, '2026-01-11 11:18:04', 1, 'AST-30', 'Assets', 'geändert'),
(225, '2026-01-11 11:18:16', 1, 'AST-35', 'Assets', 'angelegt'),
(226, '2026-01-11 11:18:37', 1, 'AST-35', 'Assets', 'geändert'),
(227, '2026-01-11 11:19:33', 1, 'AST-36', 'Assets', 'angelegt'),
(228, '2026-01-11 11:19:50', 1, 'AST-36', 'Assets', 'geändert'),
(229, '2026-01-11 11:20:33', 1, 'AST-37', 'Assets', 'angelegt'),
(230, '2026-01-11 11:20:55', 1, 'AST-37', 'Assets', 'geändert'),
(231, '2026-01-11 11:21:20', 1, 'AST-38', 'Assets', 'angelegt'),
(232, '2026-01-11 11:21:35', 1, 'AST-38', 'Assets', 'geändert'),
(233, '2026-01-11 11:22:39', 1, 'AST-39', 'Assets', 'angelegt'),
(234, '2026-01-11 11:22:56', 1, 'AST-39', 'Assets', 'geändert'),
(235, '2026-01-11 11:24:29', 1, 'AST-30', 'Assets', 'geändert'),
(236, '2026-01-11 11:24:47', 1, 'AST-37', 'Assets', 'geändert'),
(237, '2026-01-11 11:25:01', 1, 'AST-38', 'Assets', 'geändert'),
(238, '2026-01-11 11:25:15', 1, 'AST-39', 'Assets', 'geändert'),
(239, '2026-01-11 11:27:23', 1, 'AST-1', 'Assets', 'geändert'),
(240, '2026-01-11 11:27:43', 1, 'AST-13', 'Assets', 'geändert'),
(241, '2026-01-11 11:28:01', 1, 'AST-14', 'Assets', 'geändert'),
(242, '2026-01-11 11:29:59', 1, 'AST-16', 'Assets', 'geändert'),
(243, '2026-01-11 11:30:11', 1, 'AST-17', 'Assets', 'geändert'),
(244, '2026-01-11 11:30:26', 1, 'AST-18', 'Assets', 'geändert'),
(245, '2026-01-11 11:30:40', 1, 'AST-20', 'Assets', 'geändert'),
(246, '2026-01-11 11:30:54', 1, 'AST-21', 'Assets', 'geändert'),
(247, '2026-01-11 11:31:10', 1, 'AST-22', 'Assets', 'geändert'),
(248, '2026-01-11 11:31:29', 1, 'AST-23', 'Assets', 'geändert'),
(249, '2026-01-11 11:31:45', 1, 'AST-24', 'Assets', 'geändert'),
(250, '2026-01-11 11:32:00', 1, 'AST-25', 'Assets', 'geändert'),
(251, '2026-01-11 11:32:15', 1, 'AST-26', 'Assets', 'geändert'),
(252, '2026-01-11 11:35:27', 1, 'AST-8', 'Assets', 'geändert'),
(253, '2026-01-11 11:35:43', 1, 'AST-9', 'Assets', 'geändert'),
(254, '2026-01-11 11:36:14', 1, 'AST-10', 'Assets', 'geändert'),
(255, '2026-01-11 11:36:30', 1, 'AST-11', 'Assets', 'geändert'),
(256, '2026-01-11 11:36:53', 1, 'AST-12', 'Assets', 'geändert'),
(257, '2026-01-11 11:37:22', 1, 'AST-15', 'Assets', 'geändert'),
(258, '2026-01-11 11:40:49', 1, 'AST-40', 'Assets', 'angelegt'),
(259, '2026-01-11 11:41:04', 1, 'AST-40', 'Assets', 'geändert'),
(260, '2026-01-11 11:41:26', 1, 'AST-41', 'Assets', 'angelegt'),
(261, '2026-01-11 11:41:40', 1, 'AST-41', 'Assets', 'geändert'),
(262, '2026-01-11 11:42:03', 1, 'AST-42', 'Assets', 'angelegt'),
(263, '2026-01-11 11:42:15', 1, 'AST-42', 'Assets', 'geändert'),
(264, '2026-01-11 11:42:40', 1, 'AST-43', 'Assets', 'angelegt'),
(265, '2026-01-11 11:42:52', 1, 'AST-43', 'Assets', 'geändert'),
(266, '2026-01-11 11:43:08', 1, 'AST-44', 'Assets', 'angelegt'),
(267, '2026-01-11 11:43:22', 1, 'AST-44', 'Assets', 'geändert'),
(268, '2026-01-11 11:43:49', 1, 'AST-45', 'Assets', 'angelegt'),
(269, '2026-01-11 11:44:03', 1, 'AST-45', 'Assets', 'geändert'),
(270, '2026-01-11 11:44:29', 1, 'AST-46', 'Assets', 'angelegt'),
(271, '2026-01-11 11:44:51', 1, 'AST-46', 'Assets', 'geändert'),
(272, '2026-01-11 11:45:20', 1, 'AST-47', 'Assets', 'angelegt'),
(273, '2026-01-11 11:45:47', 1, 'AST-47', 'Assets', 'geändert'),
(274, '2026-01-11 11:46:06', 1, 'AST-48', 'Assets', 'angelegt'),
(275, '2026-01-11 11:46:16', 1, 'AST-48', 'Assets', 'geändert'),
(276, '2026-01-11 11:46:37', 1, 'AST-49', 'Assets', 'angelegt'),
(277, '2026-01-11 11:46:50', 1, 'AST-49', 'Assets', 'geändert'),
(278, '2026-01-11 11:47:17', 1, 'AST-50', 'Assets', 'angelegt'),
(279, '2026-01-11 11:47:26', 1, 'AST-50', 'Assets', 'geändert'),
(280, '2026-01-11 11:47:54', 1, 'AST-51', 'Assets', 'angelegt'),
(281, '2026-01-11 11:48:04', 1, 'AST-51', 'Assets', 'geändert'),
(282, '2026-01-11 11:48:24', 1, 'AST-52', 'Assets', 'angelegt'),
(283, '2026-01-11 11:48:33', 1, 'AST-52', 'Assets', 'geändert'),
(284, '2026-01-11 11:48:47', 1, 'AST-53', 'Assets', 'angelegt'),
(285, '2026-01-11 11:49:07', 1, 'AST-54', 'Assets', 'angelegt'),
(286, '2026-01-11 11:49:30', 1, 'AST-55', 'Assets', 'angelegt'),
(287, '2026-01-11 11:49:40', 1, 'AST-55', 'Assets', 'geändert'),
(288, '2026-01-11 11:50:39', 1, 'AST-56', 'Assets', 'angelegt'),
(289, '2026-01-11 11:50:50', 1, 'AST-56', 'Assets', 'geändert'),
(290, '2026-01-11 11:51:29', 1, 'AST-57', 'Assets', 'angelegt'),
(291, '2026-01-11 11:51:47', 1, 'AST-57', 'Assets', 'geändert'),
(292, '2026-01-11 11:52:20', 1, 'AST-58', 'Assets', 'angelegt'),
(293, '2026-01-11 11:52:30', 1, 'AST-58', 'Assets', 'geändert'),
(294, '2026-01-11 11:52:51', 1, 'AST-59', 'Assets', 'angelegt'),
(295, '2026-01-11 11:53:02', 1, 'AST-59', 'Assets', 'geändert'),
(296, '2026-01-11 11:53:23', 1, 'AST-50', 'Assets', 'geändert'),
(297, '2026-01-11 11:53:45', 1, 'AST-53', 'Assets', 'geändert'),
(298, '2026-01-11 11:54:05', 1, 'AST-54', 'Assets', 'geändert'),
(299, '2026-01-11 11:54:27', 1, 'AST-51', 'Assets', 'geändert'),
(300, '2026-01-11 11:54:52', 1, 'AST-52', 'Assets', 'geändert'),
(301, '2026-01-11 11:55:10', 1, 'AST-55', 'Assets', 'geändert'),
(302, '2026-01-11 11:55:35', 1, 'AST-60', 'Assets', 'angelegt'),
(303, '2026-01-11 11:55:48', 1, 'AST-60', 'Assets', 'geändert'),
(304, '2026-01-11 11:56:03', 1, 'AST-61', 'Assets', 'angelegt'),
(305, '2026-01-11 11:56:16', 1, 'AST-61', 'Assets', 'geändert'),
(306, '2026-01-11 11:56:37', 1, 'AST-62', 'Assets', 'angelegt'),
(307, '2026-01-11 11:56:49', 1, 'AST-62', 'Assets', 'geändert'),
(308, '2026-01-11 11:57:32', 1, 'AST-63', 'Assets', 'angelegt'),
(309, '2026-01-11 11:57:47', 1, 'AST-63', 'Assets', 'geändert'),
(310, '2026-01-11 11:58:04', 1, 'AST-64', 'Assets', 'angelegt'),
(311, '2026-01-11 11:58:16', 1, 'AST-64', 'Assets', 'geändert'),
(312, '2026-01-11 11:58:54', 1, 'AST-65', 'Assets', 'angelegt'),
(313, '2026-01-11 11:59:05', 1, 'AST-65', 'Assets', 'geändert'),
(314, '2026-01-11 11:59:28', 1, 'AST-66', 'Assets', 'angelegt'),
(315, '2026-01-11 11:59:41', 1, 'AST-66', 'Assets', 'geändert'),
(316, '2026-01-11 12:00:00', 1, 'AST-67', 'Assets', 'angelegt'),
(317, '2026-01-11 12:00:12', 1, 'AST-67', 'Assets', 'geändert'),
(318, '2026-01-11 12:00:26', 1, 'AST-68', 'Assets', 'angelegt'),
(319, '2026-01-11 12:00:38', 1, 'AST-68', 'Assets', 'geändert'),
(320, '2026-01-11 12:01:07', 1, 'AST-69', 'Assets', 'angelegt'),
(321, '2026-01-11 12:01:18', 1, 'AST-69', 'Assets', 'geändert'),
(322, '2026-01-11 12:01:34', 1, 'AST-69', 'Assets', 'geändert'),
(323, '2026-01-11 12:01:51', 1, 'AST-70', 'Assets', 'angelegt'),
(324, '2026-01-11 12:02:06', 1, 'AST-70', 'Assets', 'geändert'),
(325, '2026-01-11 12:03:52', 1, 'AST-71', 'Assets', 'angelegt'),
(326, '2026-01-11 12:04:07', 1, 'AST-71', 'Assets', 'geändert'),
(327, '2026-01-11 12:04:46', 1, 'AST-72', 'Assets', 'angelegt'),
(328, '2026-01-11 12:07:18', 1, 'AST-72', 'Assets', 'geändert'),
(329, '2026-01-11 12:07:52', 1, 'AST-73', 'Assets', 'angelegt'),
(330, '2026-01-11 12:08:04', 1, 'AST-73', 'Assets', 'geändert'),
(331, '2026-01-11 12:08:22', 1, 'AST-74', 'Assets', 'angelegt'),
(332, '2026-01-11 12:08:35', 1, 'AST-74', 'Assets', 'geändert'),
(333, '2026-01-11 12:09:02', 1, 'AST-75', 'Assets', 'angelegt'),
(334, '2026-01-11 12:09:15', 1, 'AST-75', 'Assets', 'geändert'),
(335, '2026-01-11 12:09:34', 1, 'AST-76', 'Assets', 'angelegt'),
(336, '2026-01-11 12:09:45', 1, 'AST-76', 'Assets', 'geändert'),
(337, '2026-01-11 12:10:26', 1, 'AST-77', 'Assets', 'angelegt'),
(338, '2026-01-11 12:10:38', 1, 'AST-77', 'Assets', 'geändert'),
(339, '2026-01-11 12:11:14', 1, 'AST-78', 'Assets', 'angelegt'),
(340, '2026-01-11 12:11:25', 1, 'AST-78', 'Assets', 'geändert'),
(341, '2026-01-11 12:12:11', 1, 'AST-79', 'Assets', 'angelegt'),
(342, '2026-01-11 12:12:23', 1, 'AST-79', 'Assets', 'geändert'),
(343, '2026-01-11 12:15:54', 1, 'AST-80', 'Assets', 'angelegt'),
(344, '2026-01-11 12:16:05', 1, 'AST-80', 'Assets', 'geändert'),
(345, '2026-01-11 14:18:10', 1, 'AST-65', 'Assets', 'geändert'),
(346, '2026-01-11 14:18:29', 1, 'AST-66', 'Assets', 'geändert'),
(347, '2026-01-11 15:30:50', 1, 'AST-1', 'Assets', 'geändert'),
(348, '2026-01-11 15:32:36', 1, 'AST-1', 'Assets', 'geändert'),
(349, '2026-01-12 06:18:29', 1, '', 'ISMS', 'Login'),
(350, '2026-01-12 08:00:08', 1, '', 'ISMS', 'Login'),
(351, '2026-01-12 08:06:56', 1, 'AST-47', 'Assets', 'geändert'),
(352, '2026-01-12 08:07:12', 1, 'AST-48', 'Assets', 'geändert'),
(353, '2026-01-12 08:07:29', 1, 'AST-49', 'Assets', 'geändert'),
(354, '2026-01-12 08:07:51', 1, 'AST-50', 'Assets', 'geändert'),
(355, '2026-01-12 08:08:04', 1, 'AST-51', 'Assets', 'geändert'),
(356, '2026-01-12 08:08:22', 1, 'AST-52', 'Assets', 'geändert'),
(357, '2026-01-12 08:08:42', 1, 'AST-53', 'Assets', 'geändert'),
(358, '2026-01-12 08:08:53', 1, 'AST-54', 'Assets', 'geändert'),
(359, '2026-01-12 08:09:22', 1, 'AST-55', 'Assets', 'geändert'),
(360, '2026-01-12 08:09:33', 1, 'AST-55', 'Assets', 'geändert'),
(361, '2026-01-12 08:09:54', 1, 'AST-56', 'Assets', 'geändert'),
(362, '2026-01-12 08:10:17', 1, 'AST-58', 'Assets', 'geändert'),
(363, '2026-01-12 09:42:27', 1, 'AST-1', 'Assets', 'geändert'),
(364, '2026-01-12 09:52:29', 1, 'AST-52', 'Assets', 'geändert'),
(365, '2026-01-12 10:50:53', 1, '21002324', 'Lieferanten', 'geändert'),
(366, '2026-01-12 10:53:11', 1, '21007264', 'Lieferanten', 'geändert'),
(367, '2026-01-12 11:31:07', 1, 'VND-24', 'Lieferanten', 'geändert'),
(368, '2026-01-12 11:32:13', 1, 'VND-24', 'Lieferanten', 'geändert'),
(369, '2026-01-12 11:37:08', 1, '21008260', 'Lieferanten', 'geändert'),
(370, '2026-01-12 11:38:05', 1, '21007136', 'Lieferanten', 'geändert'),
(371, '2026-01-12 11:39:37', 1, '21009571', 'Lieferanten', 'geändert'),
(372, '2026-01-12 11:40:46', 1, 'VND-28', 'Lieferanten', 'geändert'),
(373, '2026-01-12 11:41:34', 1, 'VND-28', 'Lieferanten', 'geändert'),
(374, '2026-01-12 11:44:01', 1, '21009404', 'Lieferanten', 'geändert'),
(375, '2026-01-12 13:18:23', 1, '', 'ISMS', 'Login'),
(376, '2026-01-12 13:45:10', 1, 'VND-32', 'Lieferanten', 'geändert'),
(377, '2026-01-12 14:19:19', 1, '', 'ISMS', 'Login'),
(378, '2026-01-12 14:24:23', 1, 'INC-4', 'Incidents', 'angelegt'),
(379, '2026-01-12 14:29:06', 1, 'INC-4', 'Incidents', 'geändert'),
(380, '2026-01-12 14:59:29', 1, 'D0000022', 'Dokumente', 'geändert'),
(381, '2026-01-12 15:00:27', 1, 'D0000022', 'Dokumente', 'geändert'),
(382, '2026-01-12 15:06:35', 1, 'D0000022', 'Dokumente', 'geändert'),
(383, '2026-01-12 15:26:28', 1, 'D0000502', 'Dokumente', 'geändert'),
(384, '2026-01-12 15:28:32', 1, 'D0000502', 'Dokumente', 'geändert'),
(385, '2026-01-12 15:47:47', 1, 'D0000502', 'Dokumente', 'geändert'),
(386, '2026-01-12 15:48:16', 1, 'D0000502', 'Dokumente', 'geändert'),
(387, '2026-01-12 15:52:41', 1, 'D0000502', 'Dokumente', 'geändert'),
(388, '2026-01-12 15:57:13', 1, 'D0000502', 'Dokumente', 'geändert'),
(389, '2026-01-12 15:58:56', 1, 'GOV-1', 'Dokumente', 'geändert'),
(390, '2026-01-12 15:59:08', 1, 'GOV-2', 'Dokumente', 'geändert'),
(391, '2026-01-12 15:59:25', 1, 'GOV-3', 'Dokumente', 'geändert'),
(392, '2026-01-12 15:59:36', 1, 'GOV-4', 'Dokumente', 'geändert'),
(393, '2026-01-12 15:59:48', 1, 'GOV-5', 'Dokumente', 'geändert'),
(394, '2026-01-12 16:00:01', 1, 'GOV-6', 'Dokumente', 'geändert'),
(395, '2026-01-12 16:16:20', 1, 'POL-1', 'Dokumente', 'geändert'),
(396, '2026-01-12 16:16:55', 1, 'D0000022', 'Dokumente', 'geändert'),
(397, '2026-01-12 16:17:16', 1, 'POL-3', 'Dokumente', 'geändert'),
(398, '2026-01-12 16:17:39', 1, 'POL-4', 'Dokumente', 'geändert'),
(399, '2026-01-12 16:18:34', 1, 'POL-5', 'Dokumente', 'geändert'),
(400, '2026-01-12 16:18:49', 1, 'D0000502', 'Dokumente', 'geändert'),
(401, '2026-01-12 16:19:01', 1, 'POL-7', 'Dokumente', 'geändert'),
(402, '2026-01-12 16:19:15', 1, 'POL-8', 'Dokumente', 'geändert'),
(403, '2026-01-12 16:20:12', 1, 'POL-9', 'Dokumente', 'geändert'),
(404, '2026-01-12 16:20:21', 1, 'POL-10', 'Dokumente', 'geändert'),
(405, '2026-01-12 16:20:32', 1, 'POL-11', 'Dokumente', 'geändert'),
(406, '2026-01-12 16:20:56', 1, 'POL-12', 'Dokumente', 'geändert'),
(407, '2026-01-12 16:21:08', 1, 'POL-13', 'Dokumente', 'geändert'),
(408, '2026-01-12 16:21:31', 1, 'POL-14', 'Dokumente', 'geändert'),
(409, '2026-01-12 16:21:47', 1, 'POL-15', 'Dokumente', 'geändert'),
(410, '2026-01-12 16:21:58', 1, 'POL-16', 'Dokumente', 'geändert'),
(411, '2026-01-12 16:22:35', 1, 'POL-17', 'Dokumente', 'geändert'),
(412, '2026-01-12 16:22:46', 1, 'POL-18', 'Dokumente', 'geändert'),
(413, '2026-01-12 16:22:56', 1, 'POL-19', 'Dokumente', 'geändert'),
(414, '2026-01-12 16:23:14', 1, 'POL-20', 'Dokumente', 'geändert'),
(415, '2026-01-12 16:23:31', 1, 'POL-21', 'Dokumente', 'geändert'),
(416, '2026-01-12 16:23:42', 1, 'PRO-1', 'Dokumente', 'geändert'),
(417, '2026-01-12 16:23:54', 1, 'PRO-2', 'Dokumente', 'geändert'),
(418, '2026-01-12 16:24:13', 1, 'PRO-3', 'Dokumente', 'geändert'),
(419, '2026-01-12 16:24:21', 1, 'PRO-4', 'Dokumente', 'geändert'),
(420, '2026-01-12 17:22:17', 1, 'VND-5', 'Lieferanten', 'geändert'),
(421, '2026-01-12 17:22:33', 1, 'VND-8', 'Lieferanten', 'geändert'),
(422, '2026-01-12 17:22:48', 1, '21009404', 'Lieferanten', 'geändert'),
(423, '2026-01-12 17:23:06', 1, 'VND-17', 'Lieferanten', 'geändert'),
(424, '2026-01-12 17:23:17', 1, 'VND-19', 'Lieferanten', 'geändert'),
(425, '2026-01-12 17:23:52', 1, '21008260', 'Lieferanten', 'geändert'),
(426, '2026-01-12 17:24:09', 1, '21002324', 'Lieferanten', 'geändert'),
(427, '2026-01-12 17:24:28', 1, 'VND-24', 'Lieferanten', 'geändert'),
(428, '2026-01-12 17:24:40', 1, '21007264', 'Lieferanten', 'geändert'),
(429, '2026-01-12 17:25:18', 1, '21007136', 'Lieferanten', 'geändert'),
(430, '2026-01-12 17:25:29', 1, '21009571', 'Lieferanten', 'geändert'),
(431, '2026-01-12 17:25:44', 1, 'VND-28', 'Lieferanten', 'geändert'),
(432, '2026-01-12 17:26:07', 1, 'VND-29', 'Lieferanten', 'geändert'),
(433, '2026-01-12 17:26:53', 1, 'VND-33', 'Lieferanten', 'geändert'),
(434, '2026-01-13 01:10:41', 1, '', 'ISMS', 'Login'),
(435, '2026-01-13 01:18:57', 1, '', 'ISMS', 'Login'),
(436, '2026-01-13 01:20:40', 1, '', 'ISMS', 'Login'),
(437, '2026-01-13 01:55:24', 1, '', 'ISMS', 'Login'),
(438, '2026-01-13 01:57:40', 1, '', 'ISMS', 'Login'),
(439, '2026-01-13 01:58:11', 1, '', 'ISMS', 'Login'),
(440, '2026-01-13 02:25:17', 1, '', 'ISMS', 'Login'),
(441, '2026-01-13 02:32:23', 1, '', 'ISMS', 'Login'),
(442, '2026-01-13 02:33:25', 1, '', 'ISMS', 'Login'),
(443, '2026-01-13 02:33:47', 1, '', 'ISMS', 'Login'),
(444, '2026-01-13 06:52:42', 1, '', 'ISMS', 'Login'),
(445, '2026-01-13 07:31:42', 1, 'AST-71', 'Assets', 'geändert'),
(446, '2026-01-13 07:31:53', 1, 'AST-71', 'Assets', 'geändert'),
(447, '2026-01-13 07:32:18', 1, 'AST-72', 'Assets', 'geändert'),
(448, '2026-01-13 07:36:09', 1, 'AST-73', 'Assets', 'geändert'),
(449, '2026-01-13 07:36:29', 1, 'AST-74', 'Assets', 'geändert'),
(450, '2026-01-13 07:45:56', 1, 'AST-75', 'Assets', 'geändert'),
(451, '2026-01-13 07:46:12', 1, 'AST-76', 'Assets', 'geändert'),
(452, '2026-01-13 09:07:22', 1, '', 'ISMS', 'Login'),
(453, '2026-01-13 09:43:56', 1, '21009835', 'Lieferanten', 'angelegt'),
(454, '2026-01-13 17:57:06', 1, '', 'ISMS', 'Login'),
(455, '2026-01-13 17:57:44', 1, 'MAS-8', 'Maßnahmen', 'geändert'),
(456, '2026-01-14 16:29:27', 1, '', 'ISMS', 'Login'),
(457, '2026-01-14 16:48:15', 1, '', 'ISMS', 'Login'),
(458, '2026-01-14 16:50:06', 1, '', 'ISMS', 'Login'),
(459, '2026-01-14 17:13:18', 1, '10001', 'Assets', 'geändert'),
(460, '2026-01-14 17:13:49', 1, '10002', 'Assets', 'angelegt'),
(461, '2026-01-14 17:14:15', 1, '10002', 'Assets', 'geändert'),
(462, '2026-01-14 17:14:35', 1, '10001', 'Assets', 'geändert'),
(463, '2026-01-14 17:15:07', 1, '10003', 'Assets', 'angelegt'),
(464, '2026-01-14 17:15:46', 1, '10003', 'Assets', 'geändert'),
(465, '2026-01-14 17:16:30', 1, '10004', 'Assets', 'angelegt'),
(466, '2026-01-14 17:16:51', 1, '10004', 'Assets', 'geändert'),
(467, '2026-01-14 17:17:55', 1, '10005', 'Assets', 'angelegt'),
(468, '2026-01-14 17:18:18', 1, '10005', 'Assets', 'geändert'),
(469, '2026-01-14 17:18:36', 1, '10006', 'Assets', 'angelegt'),
(470, '2026-01-14 17:19:19', 1, '10006', 'Assets', 'geändert'),
(471, '2026-01-14 17:19:46', 1, '10006', 'Assets', 'geändert'),
(472, '2026-01-14 17:19:57', 1, '10001', 'Assets', 'geändert'),
(473, '2026-01-14 17:20:07', 1, '10002', 'Assets', 'geändert'),
(474, '2026-01-14 17:20:25', 1, '10003', 'Assets', 'geändert'),
(475, '2026-01-14 17:20:36', 1, '10004', 'Assets', 'geändert'),
(476, '2026-01-14 17:20:52', 1, '10005', 'Assets', 'geändert'),
(477, '2026-01-14 17:21:25', 1, '10007', 'Assets', 'angelegt'),
(478, '2026-01-14 17:21:43', 1, '10007', 'Assets', 'geändert'),
(479, '2026-01-14 17:22:43', 1, '10008', 'Assets', 'angelegt'),
(480, '2026-01-14 17:23:15', 1, '10008', 'Assets', 'geändert'),
(481, '2026-01-14 17:38:55', 1, 'MAS-1', 'Maßnahmen', 'geändert'),
(482, '2026-01-14 17:39:16', 1, 'MAS-2', 'Maßnahmen', 'geändert'),
(483, '2026-01-14 17:39:49', 1, 'MAS-4', 'Maßnahmen', 'geändert'),
(484, '2026-01-14 17:40:19', 1, 'MAS-5', 'Maßnahmen', 'geändert'),
(485, '2026-01-14 17:40:34', 1, 'MAS-5', 'Maßnahmen', 'geändert'),
(486, '2026-01-14 17:41:01', 1, 'MAS-6', 'Maßnahmen', 'geändert'),
(487, '2026-01-14 17:41:17', 1, 'MAS-7', 'Maßnahmen', 'geändert'),
(488, '2026-01-14 17:43:52', 1, '100001', 'Lieferanten', 'geändert'),
(489, '2026-01-14 17:44:01', 1, '10002', 'Lieferanten', 'angelegt'),
(490, '2026-01-14 17:44:23', 1, '10002', 'Lieferanten', 'geändert'),
(491, '2026-01-14 17:44:40', 1, '10003', 'Lieferanten', 'angelegt'),
(492, '2026-01-14 17:45:05', 1, '10003', 'Lieferanten', 'geändert'),
(493, '2026-01-14 17:45:21', 1, '10004', 'Lieferanten', 'angelegt'),
(494, '2026-01-14 17:45:39', 1, '10004', 'Lieferanten', 'geändert'),
(495, '2026-01-14 17:46:28', 1, '10001', 'Lieferanten', 'geändert'),
(496, '2026-01-14 17:46:46', 1, '10003', 'Lieferanten', 'geändert'),
(497, '2026-01-15 04:52:09', 1, '', 'ISMS', 'Login'),
(498, '2026-01-15 16:37:21', 1, '', 'ISMS', 'Login'),
(499, '2026-01-15 17:12:10', 1, '4.1', 'Normen', 'geändert'),
(500, '2026-01-15 17:12:40', 1, '4.2', 'Normen', 'geändert'),
(501, '2026-01-15 17:39:30', 1, '', 'ISMS', 'Login'),
(502, '2026-01-15 18:09:38', 1, '', 'ISMS', 'Login'),
(503, '2026-01-15 18:12:10', 1, 'GOV-2', 'Dokumente', 'geändert'),
(504, '2026-01-15 18:12:25', 1, 'GOV-2', 'Dokumente', 'geändert'),
(505, '2026-01-15 18:15:33', 1, '1', 'Assets', 'Review 1 Jahr'),
(506, '2026-01-15 18:15:49', 1, '93', 'Assets', 'Review 1 Jahr'),
(507, '2026-01-15 18:16:06', 1, '94', 'Assets', 'Review 1 Jahr'),
(508, '2026-01-15 18:16:19', 1, '95', 'Assets', 'Review 1 Jahr'),
(509, '2026-01-15 18:16:41', 1, '96', 'Assets', 'Review 1 Jahr'),
(510, '2026-01-15 18:16:50', 1, '98', 'Assets', 'Review 1 Jahr'),
(511, '2026-01-15 18:16:58', 1, '99', 'Assets', 'Review 1 Jahr'),
(512, '2026-01-15 18:17:10', 1, '99', 'Assets', 'Review 1 Jahr'),
(513, '2026-01-15 18:27:35', 1, '48', 'Lieferanten', 'Review 1 Jahr'),
(514, '2026-01-15 18:41:58', 1, '', 'ISMS', 'Login'),
(515, '2026-01-16 03:13:13', 1, '', 'ISMS', 'Login'),
(516, '2026-01-16 06:08:48', 0, '', 'ISMS', 'Login'),
(517, '2026-01-16 06:10:13', 1, '', 'ISMS', 'Login'),
(518, '2026-01-16 11:42:19', 1, '', 'ISMS', 'Login'),
(519, '2026-01-17 00:21:32', 1, '', 'ISMS', 'Login'),
(520, '2026-01-17 00:21:49', 1, '', 'ISMS', 'Login'),
(521, '2026-01-17 00:22:47', 1, '', 'ISMS', 'Login'),
(522, '2026-01-17 00:23:24', 1, '', 'ISMS', 'Login'),
(523, '2026-01-17 00:24:59', 1, '', 'ISMS', 'Login'),
(524, '2026-01-17 00:26:40', 1, '', 'ISMS', 'Login'),
(525, '2026-01-17 00:48:46', 1, '', 'ISMS', 'Login'),
(526, '2026-01-17 00:50:51', 1, '', 'ISMS', 'Login'),
(527, '2026-01-17 01:06:51', 1, 'POL-1', 'Dokumente', 'geändert'),
(528, '2026-01-17 05:43:14', 1, '', 'ISMS', 'Login'),
(529, '2026-01-17 06:09:48', 1, 'POL-1', 'Dokumente', 'geändert'),
(530, '2026-01-17 06:12:34', 1, 'POL-1', 'Dokumente', 'geändert'),
(531, '2026-01-17 06:12:48', 1, 'POL-1', 'Dokumente', 'geändert'),
(532, '2026-01-17 06:13:24', 1, 'POL-1', 'Dokumente', 'geändert'),
(533, '2026-01-17 06:15:24', 1, 'POL-1', 'Dokumente', 'geändert'),
(534, '2026-01-17 06:15:39', 1, 'POL-1', 'Dokumente', 'geändert'),
(535, '2026-01-17 06:18:21', 1, 'POL-1', 'Dokumente', 'geändert'),
(536, '2026-01-17 06:25:08', 1, 'POL-1', 'Dokumente', 'geändert'),
(537, '2026-01-17 06:27:13', 1, 'POL-1', 'Dokumente', 'geändert'),
(538, '2026-01-17 06:30:09', 1, 'POL-2', 'Dokumente', 'geändert'),
(539, '2026-01-17 06:30:54', 1, 'POL-2', 'Dokumente', 'geändert'),
(540, '2026-01-17 06:31:32', 1, 'POL-2', 'Dokumente', 'geändert'),
(541, '2026-01-17 06:51:27', 1, '', 'ISMS', 'Login'),
(542, '2026-01-17 07:07:44', 1, '', 'ISMS', 'Login'),
(543, '2026-01-17 07:08:20', 1, '', 'ISMS', 'Login'),
(544, '2026-01-17 07:23:30', 1, '', 'ISMS', 'Login'),
(545, '2026-01-17 08:16:26', 1, '', 'ISMS', 'Login'),
(546, '2026-01-17 08:21:06', 1, '', 'ISMS', 'Login'),
(547, '2026-01-17 08:31:19', 1, '', 'ISMS', 'Login'),
(548, '2026-01-17 08:38:05', 1, '', 'ISMS', 'Login'),
(549, '2026-01-17 08:55:11', 1, '', 'ISMS', 'Login'),
(550, '2026-01-17 09:24:28', 1, '', 'ISMS', 'Login'),
(551, '2026-01-17 09:27:43', 1, '', 'ISMS', 'Login'),
(552, '2026-01-17 09:31:17', 1, '', 'ISMS', 'Login'),
(553, '2026-01-17 09:33:59', 1, '', 'ISMS', 'Login'),
(554, '2026-01-17 09:37:09', 1, '', 'ISMS', 'Login'),
(555, '2026-01-17 09:52:53', 1, '', 'ISMS', 'Login'),
(556, '2026-01-17 10:09:24', 1, '', 'ISMS', 'Login'),
(557, '2026-01-17 10:49:51', 1, '', 'ISMS', 'Login'),
(558, '2026-01-17 11:31:06', 1, '', 'ISMS', 'Login'),
(559, '2026-01-17 13:44:00', 1, '', 'ISMS', 'Login'),
(560, '2026-01-17 15:33:09', 1, '', 'ISMS', 'Login'),
(561, '2026-01-17 15:35:30', 1, '', 'ISMS', 'Login'),
(562, '2026-01-17 15:41:33', 1, '', 'ISMS', 'Login'),
(563, '2026-01-18 03:05:46', 1, '', 'ISMS', 'Login'),
(564, '2026-01-18 03:15:08', 1, '', 'ISMS', 'Login'),
(565, '2026-01-18 03:24:44', 1, '', 'ISMS', 'Login'),
(566, '2026-01-18 03:28:19', 1, '', 'ISMS', 'Login'),
(567, '2026-01-18 03:40:08', 1, '', 'ISMS', 'Login'),
(568, '2026-01-18 05:54:05', 1, '', 'ISMS', 'Login'),
(569, '2026-01-18 05:58:17', 1, '', 'ISMS', 'Login'),
(570, '2026-01-18 06:23:52', 1, '18', 'Dokument', 'zu Prüfen'),
(571, '2026-01-18 06:23:56', 1, '18', 'Dokument', 'geprüft'),
(572, '2026-01-18 06:23:58', 1, '18', 'Dokument', 'freigegeben'),
(573, '2026-01-18 08:33:47', 1, '19', 'Dokument', 'zu Prüfen'),
(574, '2026-01-18 08:33:51', 1, '19', 'Dokument', 'geprüft'),
(575, '2026-01-18 08:33:53', 1, '19', 'Dokument', 'freigegeben'),
(576, '2026-01-18 08:34:21', 1, '24', 'Dokument', 'zu Prüfen'),
(577, '2026-01-18 08:34:24', 1, '24', 'Dokument', 'geprüft'),
(578, '2026-01-18 08:34:27', 1, '24', 'Dokument', 'freigegeben'),
(579, '2026-01-18 08:34:48', 1, '25', 'Dokument', 'zu Prüfen'),
(580, '2026-01-18 08:34:51', 1, '25', 'Dokument', 'geprüft'),
(581, '2026-01-18 08:34:53', 1, '25', 'Dokument', 'freigegeben'),
(582, '2026-01-18 08:36:04', 1, 'POL-6', 'Dokumente', 'geändert'),
(583, '2026-01-18 08:36:19', 1, '26', 'Dokument', 'zu Prüfen'),
(584, '2026-01-18 08:36:25', 1, '26', 'Dokument', 'geprüft'),
(585, '2026-01-18 08:36:28', 1, '26', 'Dokument', 'freigegeben'),
(586, '2026-01-18 08:43:21', 1, '', 'ISMS', 'Login'),
(587, '2026-01-18 10:35:56', 1, '', 'ISMS', 'Login'),
(588, '2026-01-18 10:53:04', 1, '', 'ISMS', 'Login'),
(589, '2026-01-18 13:25:09', 1, '', 'ISMS', 'Login'),
(590, '2026-01-18 13:47:59', 1, 'POL-7', 'Dokumente', 'geändert'),
(591, '2026-01-18 13:55:32', 1, 'POL-7', 'Dokumente', 'geändert'),
(592, '2026-01-18 13:56:59', 1, 'POL-7', 'Dokumente', 'geändert'),
(593, '2026-01-18 13:58:05', 1, 'POL-7', 'Dokumente', 'geändert'),
(594, '2026-01-18 14:04:17', 1, 'POL-7', 'Dokumente', 'geändert'),
(595, '2026-01-19 05:38:56', 1, '', 'ISMS', 'Login'),
(596, '2026-01-19 13:18:25', 1, '', 'ISMS', 'Login'),
(597, '2026-01-20 07:48:21', 1, '', 'ISMS', 'Login'),
(598, '2026-01-20 10:35:25', 1, '', 'ISMS', 'Login'),
(599, '2026-01-20 10:36:41', 1, '', 'ISMS', 'Login'),
(600, '2026-01-20 10:37:29', 1, '', 'ISMS', 'Login'),
(601, '2026-01-20 13:43:10', 1, '', 'ISMS', 'Login'),
(602, '2026-01-21 05:38:21', 1, '', 'ISMS', 'Login'),
(603, '2026-01-21 17:03:54', 1, '', 'ISMS', 'Login'),
(604, '2026-01-21 20:21:11', 1, '', 'ISMS', 'Login'),
(605, '2026-01-22 12:52:13', 1, '', 'ISMS', 'Login'),
(606, '2026-01-22 14:55:24', 1, '', 'ISMS', 'Login'),
(607, '2026-01-22 15:15:31', 1, 'A.1.1', 'Normen', 'angelegt'),
(608, '2026-01-22 15:19:13', 1, 'test', 'Normen', 'angelegt'),
(609, '2026-01-22 15:19:23', 1, 'test', 'Normen', 'geändert'),
(610, '2026-01-22 15:20:43', 1, 'A.1.1', 'Normen', 'angelegt'),
(611, '2026-01-22 15:21:37', 1, 'test', 'Normen', 'angelegt'),
(612, '2026-01-22 15:22:47', 1, 'A.1.1', 'Normen', 'geändert'),
(613, '2026-01-22 17:12:29', 1, '', 'ISMS', 'Login'),
(614, '2026-01-22 17:16:29', 1, '0815', 'Normen', 'angelegt'),
(615, '2026-01-22 17:16:49', 1, '0815', 'Normen', 'geändert'),
(616, '2026-01-22 17:45:32', 1, 'NIS2-A21-01', 'Normen', 'angelegt'),
(617, '2026-01-22 18:41:27', 1, '4.1', 'Normen', 'angelegt'),
(618, '2026-01-22 18:42:26', 1, '4.1', 'Normen', 'angelegt'),
(619, '2026-01-22 18:42:55', 1, '4.1', 'Normen', 'angelegt'),
(620, '2026-01-22 18:43:54', 1, '4.1', 'Normen', 'geändert'),
(621, '2026-01-23 01:14:33', 1, '', 'ISMS', 'Login'),
(622, '2026-01-23 06:44:35', 1, '', 'ISMS', 'Login'),
(623, '2026-01-23 07:31:23', 1, 'RSK-1', 'Risiken', 'geändert'),
(624, '2026-01-23 07:34:35', 1, 'INC-1', 'Incidents', 'geändert'),
(625, '2026-01-23 12:04:28', 1, '10002', 'Assets', 'geändert'),
(626, '2026-01-23 12:04:42', 1, '10002', 'Assets', 'geändert'),
(627, '2026-01-23 12:28:49', 1, '10005', 'Assets', 'geändert'),
(628, '2026-01-23 12:29:17', 1, '10007', 'Assets', 'geändert'),
(629, '2026-01-23 12:30:41', 1, '10006', 'Assets', 'geändert'),
(630, '2026-01-23 13:22:48', 1, 'RSK-1', 'Risiken', 'geändert'),
(631, '2026-01-23 13:23:22', 1, 'RSK-1', 'Risiken', 'geändert'),
(632, '2026-01-23 13:23:39', 1, 'RSK-1', 'Risiken', 'geändert'),
(633, '2026-01-23 13:25:25', 1, 'RSK-1', 'Risiken', 'geändert'),
(634, '2026-01-23 13:25:45', 1, 'RSK-1', 'Risiken', 'geändert'),
(635, '2026-01-23 13:28:29', 1, '10009', 'Assets', 'angelegt'),
(636, '2026-01-23 13:29:02', 1, '10009', 'Assets', 'geändert'),
(637, '2026-01-23 13:29:39', 1, 'RSK-1', 'Risiken', 'geändert'),
(638, '2026-01-23 13:29:48', 1, 'RSK-1', 'Risiken', 'geändert'),
(639, '2026-01-23 13:48:46', 1, '100010', 'Assets', 'angelegt'),
(640, '2026-01-23 13:49:33', 1, '100010', 'Assets', 'geändert'),
(641, '2026-01-23 13:50:11', 1, '100010', 'Assets', 'geändert'),
(642, '2026-01-23 13:55:42', 1, '100011', 'Assets', 'angelegt'),
(643, '2026-01-23 13:56:11', 1, '100011', 'Assets', 'geändert'),
(644, '2026-01-23 18:16:52', 1, '', 'ISMS', 'Login'),
(645, '2026-01-23 18:38:56', 1, '', 'ISMS', 'Login'),
(646, '2026-01-24 03:21:59', 1, '', 'ISMS', 'Login'),
(647, '2026-01-24 05:58:20', 1, '', 'ISMS', 'Login'),
(648, '2026-01-24 08:06:37', 1, 'INC-2', 'Incidents', 'geändert'),
(649, '2026-01-24 08:06:56', 1, 'INC-2', 'Incidents', 'geändert'),
(650, '2026-01-24 08:07:11', 1, 'GOV-1', 'Dokumente', 'geändert'),
(651, '2026-01-24 08:12:31', 1, '', 'ISMS', 'Login'),
(652, '2026-01-24 08:59:50', 1, '10001', 'Lieferanten', 'geändert'),
(653, '2026-01-24 09:26:05', 1, '', 'ISMS', 'Login'),
(654, '2026-01-24 09:40:29', 1, '', 'ISMS', 'Login'),
(655, '2026-01-24 09:51:05', 1, 'GOV-1', 'Dokumente', 'geändert'),
(656, '2026-01-24 10:30:22', 1, 'RSK-1', 'Risiken', 'geändert'),
(657, '2026-01-24 10:30:32', 1, 'RSK-1', 'Risiken', 'geändert'),
(658, '2026-01-24 11:37:17', 1, '', 'ISMS', 'Login'),
(659, '2026-01-24 11:53:18', 1, '', 'ISMS', 'Login'),
(660, '2026-01-24 11:59:04', 1, '', 'ISMS', 'Login'),
(661, '2026-01-24 14:58:36', 1, '', 'ISMS', 'Login'),
(662, '2026-01-24 15:18:01', 1, '', 'ISMS', 'Login'),
(663, '2026-01-24 17:44:22', 1, '100012', 'Assets', 'angelegt'),
(664, '2026-01-24 17:44:47', 1, '100012', 'Assets', 'geändert'),
(665, '2026-01-24 19:33:51', 1, '', 'ISMS', 'Login'),
(666, '2026-01-25 07:05:54', 1, '', 'ISMS', 'Login'),
(667, '2026-01-25 08:50:36', 1, '1', 'Audit', 'ISMS-Grundlagen und Governance'),
(668, '2026-01-25 08:50:51', 1, '1', 'Audit', 'ISMS-Grundlagen und Governance'),
(669, '2026-01-25 08:57:21', 1, '1', 'Audit', 'ISMS-Grundlagen und Governance'),
(670, '2026-01-25 09:02:29', 1, '1', 'Audit', 'ISMS-Grundlagen und Governance'),
(671, '2026-01-25 09:02:34', 1, '1', 'Audit', 'ISMS-Grundlagen und Governance'),
(672, '2026-01-25 09:03:26', 1, '1', 'Audit', 'ISMS-Grundlagen und Governance'),
(673, '2026-01-25 09:03:40', 1, '2', 'Audit', 'ISMS-Grundlagen und Governance'),
(674, '2026-01-25 09:03:44', 1, '1', 'Audit', 'ISMS-Grundlagen und Governance'),
(675, '2026-01-25 09:03:51', 1, '3', 'Audit', 'ISMS-Grundlagen und Governance'),
(676, '2026-01-25 09:05:10', 1, '4', 'Audit', 'ISMS-Grundlagen und Governance'),
(677, '2026-01-25 09:05:18', 1, '5', 'Audit', 'ISMS-Grundlagen und Governance'),
(678, '2026-01-25 09:05:25', 1, '6', 'Audit', 'ISMS-Grundlagen und Governance'),
(679, '2026-01-25 09:05:30', 1, '7', 'Audit', 'ISMS-Grundlagen und Governance'),
(680, '2026-01-25 09:10:02', 1, '5', 'Audit', 'ISMS-Grundlagen und Governance'),
(681, '2026-01-25 09:16:19', 1, '1', 'Audit', 'ISMS-Grundlagen und Governance'),
(682, '2026-01-25 09:16:27', 1, '1', 'Audit', 'ISMS-Grundlagen und Governance'),
(683, '2026-01-25 09:16:43', 1, '4', 'Audit', 'ISMS-Grundlagen und Governance'),
(684, '2026-01-25 09:19:06', 1, '1', 'Audit', 'ISMS-Grundlagen und Governance'),
(685, '2026-01-25 09:19:10', 1, '1', 'Audit', 'ISMS-Grundlagen und Governance'),
(686, '2026-01-25 09:19:28', 1, '5', 'Audit', 'ISMS-Grundlagen und Governance'),
(687, '2026-01-25 09:19:36', 1, '5', 'Audit', 'ISMS-Grundlagen und Governance'),
(688, '2026-01-25 09:22:04', 1, '4', 'Audit', 'ISMS-Grundlagen und Governance'),
(689, '2026-01-25 10:08:57', 1, '8', 'Audit', 'Informationssicherheitsleitlinie (Policy)'),
(690, '2026-01-25 10:09:03', 1, '9', 'Audit', 'Informationssicherheitsleitlinie (Policy)'),
(691, '2026-01-25 10:09:08', 1, '10', 'Audit', 'Informationssicherheitsleitlinie (Policy)'),
(692, '2026-01-25 10:09:13', 1, '11', 'Audit', 'Informationssicherheitsleitlinie (Policy)'),
(693, '2026-01-25 10:09:18', 1, '12', 'Audit', 'Informationssicherheitsleitlinie (Policy)'),
(694, '2026-01-25 10:09:28', 1, '13', 'Audit', 'Asset-Management'),
(695, '2026-01-25 10:09:36', 1, '14', 'Audit', 'Asset-Management'),
(696, '2026-01-25 10:09:42', 1, '15', 'Audit', 'Asset-Management'),
(697, '2026-01-25 10:09:48', 1, '16', 'Audit', 'Asset-Management'),
(698, '2026-01-25 10:09:58', 1, '17', 'Audit', 'Risikomanagement'),
(699, '2026-01-25 10:10:02', 1, '18', 'Audit', 'Risikomanagement'),
(700, '2026-01-25 10:10:06', 1, '19', 'Audit', 'Risikomanagement'),
(701, '2026-01-25 10:10:11', 1, '20', 'Audit', 'Risikomanagement'),
(702, '2026-01-25 10:10:16', 1, '21', 'Audit', 'Risikomanagement'),
(703, '2026-01-25 10:10:20', 1, '22', 'Audit', 'Risikomanagement'),
(704, '2026-01-25 10:10:25', 1, '23', 'Audit', 'Risikomanagement'),
(705, '2026-01-25 10:10:34', 1, '24', 'Audit', 'Statement of Applicability (SoA)'),
(706, '2026-01-25 10:10:38', 1, '25', 'Audit', 'Statement of Applicability (SoA)'),
(707, '2026-01-25 10:10:41', 1, '26', 'Audit', 'Statement of Applicability (SoA)'),
(708, '2026-01-25 10:10:47', 1, '27', 'Audit', 'Statement of Applicability (SoA)'),
(709, '2026-01-25 10:11:06', 1, '28', 'Audit', 'Richtlinien und Konzepte (Policies)'),
(710, '2026-01-25 10:11:10', 1, '29', 'Audit', 'Richtlinien und Konzepte (Policies)'),
(711, '2026-01-25 10:11:32', 1, '30', 'Audit', 'Richtlinien und Konzepte (Policies)'),
(712, '2026-01-25 10:11:35', 1, '31', 'Audit', 'Richtlinien und Konzepte (Policies)'),
(713, '2026-01-25 10:11:40', 1, '32', 'Audit', 'Richtlinien und Konzepte (Policies)'),
(714, '2026-01-25 10:11:47', 1, '33', 'Audit', 'Richtlinien und Konzepte (Policies)'),
(715, '2026-01-25 10:11:55', 1, '34', 'Audit', 'Richtlinien und Konzepte (Policies)'),
(716, '2026-01-25 10:12:04', 1, '35', 'Audit', 'Richtlinien und Konzepte (Policies)'),
(717, '2026-01-25 10:12:26', 1, '36', 'Audit', 'Operative Umsetzung (Wirksamkeit!)'),
(718, '2026-01-25 10:12:32', 1, '37', 'Audit', 'Operative Umsetzung (Wirksamkeit!)'),
(719, '2026-01-25 10:12:35', 1, '38', 'Audit', 'Operative Umsetzung (Wirksamkeit!)'),
(720, '2026-01-25 10:12:39', 1, '39', 'Audit', 'Operative Umsetzung (Wirksamkeit!)'),
(721, '2026-01-25 10:12:42', 1, '40', 'Audit', 'Operative Umsetzung (Wirksamkeit!)'),
(722, '2026-01-25 10:12:46', 1, '41', 'Audit', 'Operative Umsetzung (Wirksamkeit!)'),
(723, '2026-01-25 10:12:52', 1, '4', 'Audit', 'ISMS-Grundlagen und Governance'),
(724, '2026-01-25 10:13:02', 1, '42', 'Audit', 'Incident- und Ereignismanagement'),
(725, '2026-01-25 10:13:07', 1, '43', 'Audit', 'Incident- und Ereignismanagement'),
(726, '2026-01-25 10:13:13', 1, '44', 'Audit', 'Incident- und Ereignismanagement'),
(727, '2026-01-25 10:13:17', 1, '45', 'Audit', 'Incident- und Ereignismanagement'),
(728, '2026-01-25 10:13:23', 1, '46', 'Audit', 'Incident- und Ereignismanagement'),
(729, '2026-01-25 10:13:28', 1, '47', 'Audit', 'Incident- und Ereignismanagement'),
(730, '2026-01-25 10:13:38', 1, '48', 'Audit', 'Lieferanten- und Dienstleistermanagement'),
(731, '2026-01-25 10:13:42', 1, '49', 'Audit', 'Lieferanten- und Dienstleistermanagement'),
(732, '2026-01-25 10:13:46', 1, '50', 'Audit', 'Lieferanten- und Dienstleistermanagement'),
(733, '2026-01-25 10:13:50', 1, '51', 'Audit', 'Lieferanten- und Dienstleistermanagement'),
(734, '2026-01-25 10:13:53', 1, '52', 'Audit', 'Lieferanten- und Dienstleistermanagement'),
(735, '2026-01-25 10:14:18', 1, '53', 'Audit', 'Schulung und Awareness'),
(736, '2026-01-25 10:14:21', 1, '54', 'Audit', 'Schulung und Awareness'),
(737, '2026-01-25 10:14:25', 1, '55', 'Audit', 'Schulung und Awareness'),
(738, '2026-01-25 10:14:29', 1, '56', 'Audit', 'Schulung und Awareness'),
(739, '2026-01-25 10:14:34', 1, '57', 'Audit', 'Schulung und Awareness'),
(740, '2026-01-25 10:14:39', 1, '58', 'Audit', 'Schulung und Awareness'),
(741, '2026-01-25 10:14:48', 1, '59', 'Audit', 'Überwachung, Messung und KPIs'),
(742, '2026-01-25 10:14:52', 1, '60', 'Audit', 'Überwachung, Messung und KPIs'),
(743, '2026-01-25 10:14:56', 1, '61', 'Audit', 'Überwachung, Messung und KPIs'),
(744, '2026-01-25 10:14:59', 1, '62', 'Audit', 'Überwachung, Messung und KPIs'),
(745, '2026-01-25 10:15:04', 1, '63', 'Audit', 'Überwachung, Messung und KPIs'),
(746, '2026-01-25 10:15:14', 1, '64', 'Audit', 'Interne Audits'),
(747, '2026-01-25 10:15:22', 1, '65', 'Audit', 'Interne Audits'),
(748, '2026-01-25 10:15:26', 1, '66', 'Audit', 'Interne Audits'),
(749, '2026-01-25 10:15:31', 1, '67', 'Audit', 'Interne Audits'),
(750, '2026-01-25 10:15:35', 1, '68', 'Audit', 'Interne Audits'),
(751, '2026-01-25 10:15:39', 1, '69', 'Audit', 'Interne Audits'),
(752, '2026-01-25 10:16:55', 1, '70', 'Audit', 'Management-Review'),
(753, '2026-01-25 10:17:00', 1, '71', 'Audit', 'Management-Review'),
(754, '2026-01-25 10:17:03', 1, '72', 'Audit', 'Management-Review'),
(755, '2026-01-25 10:17:06', 1, '73', 'Audit', 'Management-Review'),
(756, '2026-01-25 10:17:09', 1, '74', 'Audit', 'Management-Review'),
(757, '2026-01-25 10:17:20', 1, '75', 'Audit', 'Korrektur- und Verbesserungsmaßnahmen'),
(758, '2026-01-25 10:17:25', 1, '76', 'Audit', 'Korrektur- und Verbesserungsmaßnahmen'),
(759, '2026-01-25 10:17:29', 1, '77', 'Audit', 'Korrektur- und Verbesserungsmaßnahmen'),
(760, '2026-01-25 10:17:34', 1, '78', 'Audit', 'Korrektur- und Verbesserungsmaßnahmen'),
(761, '2026-01-25 10:17:38', 1, '79', 'Audit', 'Korrektur- und Verbesserungsmaßnahmen'),
(762, '2026-01-25 10:18:07', 1, '81', 'Audit', 'Dokumenten- und Nachweismanagement'),
(763, '2026-01-25 10:18:11', 1, '82', 'Audit', 'Dokumenten- und Nachweismanagement'),
(764, '2026-01-25 10:18:16', 1, '83', 'Audit', 'Dokumenten- und Nachweismanagement'),
(765, '2026-01-25 10:18:21', 1, '84', 'Audit', 'Dokumenten- und Nachweismanagement'),
(766, '2026-01-25 10:18:25', 1, '85', 'Audit', 'Dokumenten- und Nachweismanagement'),
(767, '2026-01-25 10:24:25', 1, '8', 'Audit', 'Informationssicherheitsleitlinie (Policy)'),
(768, '2026-01-25 10:24:27', 1, '9', 'Audit', 'Informationssicherheitsleitlinie (Policy)'),
(769, '2026-01-25 10:24:30', 1, '10', 'Audit', 'Informationssicherheitsleitlinie (Policy)'),
(770, '2026-01-25 10:24:32', 1, '11', 'Audit', 'Informationssicherheitsleitlinie (Policy)'),
(771, '2026-01-25 10:24:34', 1, '12', 'Audit', 'Informationssicherheitsleitlinie (Policy)'),
(772, '2026-01-25 10:49:04', 2, '', 'ISMS', 'Login'),
(773, '2026-01-25 10:52:08', 1, '', 'ISMS', 'Login'),
(774, '2026-01-25 11:20:25', 1, '13', 'Audit', 'Asset-Management'),
(775, '2026-01-25 11:20:28', 1, '14', 'Audit', 'Asset-Management'),
(776, '2026-01-25 11:20:31', 1, '15', 'Audit', 'Asset-Management'),
(777, '2026-01-25 11:20:34', 1, '16', 'Audit', 'Asset-Management'),
(778, '2026-01-25 11:21:07', 1, '17', 'Audit', 'Risikomanagement'),
(779, '2026-01-25 11:21:10', 1, '18', 'Audit', 'Risikomanagement'),
(780, '2026-01-25 11:21:14', 1, '19', 'Audit', 'Risikomanagement'),
(781, '2026-01-25 11:21:19', 1, '20', 'Audit', 'Risikomanagement'),
(782, '2026-01-25 11:21:23', 1, '21', 'Audit', 'Risikomanagement'),
(783, '2026-01-25 11:21:29', 1, '22', 'Audit', 'Risikomanagement'),
(784, '2026-01-25 11:21:31', 1, '23', 'Audit', 'Risikomanagement'),
(785, '2026-01-25 11:24:01', 1, '4.1', 'Normen', 'geändert'),
(786, '2026-01-25 11:24:43', 1, '24', 'Audit', 'Statement of Applicability (SoA)'),
(787, '2026-01-25 11:24:48', 1, '25', 'Audit', 'Statement of Applicability (SoA)'),
(788, '2026-01-25 11:24:51', 1, '26', 'Audit', 'Statement of Applicability (SoA)'),
(789, '2026-01-25 11:24:55', 1, '27', 'Audit', 'Statement of Applicability (SoA)'),
(790, '2026-01-25 11:26:14', 1, '28', 'Audit', 'Richtlinien und Konzepte (Policies)'),
(791, '2026-01-25 11:26:17', 1, '29', 'Audit', 'Richtlinien und Konzepte (Policies)'),
(792, '2026-01-25 11:26:21', 1, '30', 'Audit', 'Richtlinien und Konzepte (Policies)'),
(793, '2026-01-25 11:26:25', 1, '31', 'Audit', 'Richtlinien und Konzepte (Policies)'),
(794, '2026-01-25 11:26:29', 1, '32', 'Audit', 'Richtlinien und Konzepte (Policies)'),
(795, '2026-01-25 11:26:34', 1, '33', 'Audit', 'Richtlinien und Konzepte (Policies)'),
(796, '2026-01-25 11:26:38', 1, '34', 'Audit', 'Richtlinien und Konzepte (Policies)'),
(797, '2026-01-25 11:26:41', 1, '35', 'Audit', 'Richtlinien und Konzepte (Policies)');
INSERT INTO `activities` (`id`, `datumuhrzeit`, `user`, `nummer`, `bereich`, `was`) VALUES
(798, '2026-01-25 11:53:31', 1, 'GOV-1', 'Dokumente', 'geändert'),
(799, '2026-01-25 14:13:52', 1, '', 'ISMS', 'Login'),
(800, '2026-01-25 18:02:10', 1, '', 'ISMS', 'Login'),
(801, '2026-01-25 18:54:52', 1, '', 'ISMS', 'Login'),
(802, '2026-01-25 18:55:16', 1, '36', 'Audit', 'Operative Umsetzung (Wirksamkeit!)'),
(803, '2026-01-25 18:55:20', 1, '37', 'Audit', 'Operative Umsetzung (Wirksamkeit!)'),
(804, '2026-01-25 18:55:23', 1, '38', 'Audit', 'Operative Umsetzung (Wirksamkeit!)'),
(805, '2026-01-25 18:55:27', 1, '39', 'Audit', 'Operative Umsetzung (Wirksamkeit!)'),
(806, '2026-01-25 18:55:31', 1, '40', 'Audit', 'Operative Umsetzung (Wirksamkeit!)'),
(807, '2026-01-25 18:55:35', 1, '41', 'Audit', 'Operative Umsetzung (Wirksamkeit!)'),
(808, '2026-01-25 18:56:18', 1, '10010', 'Assets', 'geändert'),
(809, '2026-01-25 18:56:32', 1, '10011', 'Assets', 'geändert'),
(810, '2026-01-25 18:56:43', 1, '10012', 'Assets', 'geändert'),
(811, '2026-01-25 18:57:19', 1, '10009', 'Assets', 'geändert'),
(812, '2026-01-25 18:57:32', 1, '10013', 'Assets', 'angelegt'),
(813, '2026-01-25 18:57:58', 1, '10013', 'Assets', 'geändert'),
(814, '2026-01-25 19:00:30', 1, '42', 'Audit', 'Incident- und Ereignismanagement'),
(815, '2026-01-25 19:00:34', 1, '43', 'Audit', 'Incident- und Ereignismanagement'),
(816, '2026-01-25 19:00:37', 1, '44', 'Audit', 'Incident- und Ereignismanagement'),
(817, '2026-01-25 19:00:42', 1, '45', 'Audit', 'Incident- und Ereignismanagement'),
(818, '2026-01-25 19:00:46', 1, '46', 'Audit', 'Incident- und Ereignismanagement'),
(819, '2026-01-25 19:00:51', 1, '47', 'Audit', 'Incident- und Ereignismanagement'),
(820, '2026-01-25 19:01:07', 1, '48', 'Audit', 'Lieferanten- und Dienstleistermanagement'),
(821, '2026-01-25 19:01:11', 1, '49', 'Audit', 'Lieferanten- und Dienstleistermanagement'),
(822, '2026-01-25 19:01:16', 1, '50', 'Audit', 'Lieferanten- und Dienstleistermanagement'),
(823, '2026-01-25 19:01:19', 1, '51', 'Audit', 'Lieferanten- und Dienstleistermanagement'),
(824, '2026-01-25 19:01:22', 1, '52', 'Audit', 'Lieferanten- und Dienstleistermanagement'),
(825, '2026-01-25 19:01:36', 1, '53', 'Audit', 'Schulung und Awareness'),
(826, '2026-01-25 19:01:39', 1, '54', 'Audit', 'Schulung und Awareness'),
(827, '2026-01-25 19:01:43', 1, '55', 'Audit', 'Schulung und Awareness'),
(828, '2026-01-25 19:01:46', 1, '56', 'Audit', 'Schulung und Awareness'),
(829, '2026-01-25 19:01:49', 1, '57', 'Audit', 'Schulung und Awareness'),
(830, '2026-01-25 19:01:53', 1, '58', 'Audit', 'Schulung und Awareness'),
(831, '2026-01-25 19:02:23', 1, '59', 'Audit', 'Überwachung, Messung und KPIs'),
(832, '2026-01-25 19:02:26', 1, '60', 'Audit', 'Überwachung, Messung und KPIs'),
(833, '2026-01-25 19:02:32', 1, '61', 'Audit', 'Überwachung, Messung und KPIs'),
(834, '2026-01-25 19:02:38', 1, '62', 'Audit', 'Überwachung, Messung und KPIs'),
(835, '2026-01-25 19:02:42', 1, '63', 'Audit', 'Überwachung, Messung und KPIs'),
(836, '2026-01-25 19:03:02', 1, '64', 'Audit', 'Interne Audits'),
(837, '2026-01-25 19:03:05', 1, '65', 'Audit', 'Interne Audits'),
(838, '2026-01-25 19:03:09', 1, '66', 'Audit', 'Interne Audits'),
(839, '2026-01-25 19:03:12', 1, '67', 'Audit', 'Interne Audits'),
(840, '2026-01-25 19:03:17', 1, '68', 'Audit', 'Interne Audits'),
(841, '2026-01-25 19:03:19', 1, '69', 'Audit', 'Interne Audits'),
(842, '2026-01-25 19:03:37', 1, '70', 'Audit', 'Management-Review'),
(843, '2026-01-25 19:03:49', 1, '71', 'Audit', 'Management-Review'),
(844, '2026-01-25 19:03:53', 1, '72', 'Audit', 'Management-Review'),
(845, '2026-01-25 19:04:00', 1, '73', 'Audit', 'Management-Review'),
(846, '2026-01-25 19:04:04', 1, '71', 'Audit', 'Management-Review'),
(847, '2026-01-25 19:04:09', 1, '74', 'Audit', 'Management-Review'),
(848, '2026-01-25 19:04:44', 1, '75', 'Audit', 'Korrektur- und Verbesserungsmaßnahmen'),
(849, '2026-01-25 19:04:49', 1, '76', 'Audit', 'Korrektur- und Verbesserungsmaßnahmen'),
(850, '2026-01-25 19:04:51', 1, '77', 'Audit', 'Korrektur- und Verbesserungsmaßnahmen'),
(851, '2026-01-25 19:04:55', 1, '78', 'Audit', 'Korrektur- und Verbesserungsmaßnahmen'),
(852, '2026-01-25 19:04:58', 1, '79', 'Audit', 'Korrektur- und Verbesserungsmaßnahmen'),
(853, '2026-01-25 19:05:08', 1, '80', 'Audit', 'Korrektur- und Verbesserungsmaßnahmen'),
(854, '2026-01-25 19:05:28', 1, '81', 'Audit', 'Dokumenten- und Nachweismanagement'),
(855, '2026-01-25 19:05:44', 1, '82', 'Audit', 'Dokumenten- und Nachweismanagement'),
(856, '2026-01-25 19:05:47', 1, '83', 'Audit', 'Dokumenten- und Nachweismanagement'),
(857, '2026-01-25 19:05:51', 1, '84', 'Audit', 'Dokumenten- und Nachweismanagement'),
(858, '2026-01-25 19:05:54', 1, '85', 'Audit', 'Dokumenten- und Nachweismanagement'),
(859, '2026-01-25 19:08:34', 1, '10002', 'Assets', 'geändert'),
(860, '2026-01-28 07:17:03', 1, '', 'ISMS', 'Login'),
(861, '2026-01-28 07:33:31', 1, '', 'ISMS', 'Login'),
(862, '2026-01-28 14:49:06', 1, '', 'ISMS', 'Login'),
(863, '2026-01-29 07:53:21', 1, '', 'ISMS', 'Login'),
(864, '2026-01-29 10:39:36', 6, '', 'ISMS', 'Login'),
(865, '2026-01-29 10:46:19', 1, '', 'ISMS', 'Login'),
(866, '2026-01-29 10:46:46', 1, '', 'ISMS', 'Login'),
(867, '2026-01-29 10:47:44', 6, '', 'ISMS', 'Login'),
(868, '2026-01-29 10:48:08', 1, '', 'ISMS', 'Login'),
(869, '2026-01-29 10:48:45', 6, '', 'ISMS', 'Login'),
(870, '2026-01-29 11:04:23', 1, '', 'ISMS', 'Login'),
(871, '2026-01-29 13:36:01', 6, '', 'ISMS', 'Login'),
(872, '2026-01-29 13:44:14', 1, '', 'ISMS', 'Login'),
(873, '2026-01-29 14:04:07', 1, '', 'ISMS', 'Login'),
(874, '2026-01-29 15:26:51', 1, '', 'ISMS', 'Login'),
(875, '2026-01-29 15:31:22', 1, '', 'ISMS', 'Login'),
(876, '2026-01-29 15:33:38', 1, '', 'ISMS', 'Login'),
(877, '2026-01-29 15:33:55', 6, '', 'ISMS', 'Login'),
(878, '2026-01-29 18:46:32', 1, '', 'ISMS', 'Login'),
(879, '2026-01-29 19:03:02', 1, '', 'ISMS', 'Login'),
(880, '2026-01-29 19:15:24', 1, '', 'ISMS', 'Login'),
(881, '2026-01-30 06:46:09', 1, '', 'ISMS', 'Login'),
(882, '2026-01-30 08:30:09', 1, '', 'ISMS', 'Login'),
(883, '2026-01-30 15:48:48', 1, '', 'ISMS', 'Login'),
(884, '2026-01-31 03:20:39', 1, '', 'ISMS', 'Login'),
(885, '2026-01-31 04:13:29', 1, '', 'ISMS', 'Login'),
(886, '2026-01-31 12:35:42', 1, '', 'ISMS', 'Login'),
(887, '2026-02-01 08:43:59', 1, '', 'ISMS', 'Login'),
(888, '2026-02-01 12:14:52', 1, '', 'ISMS', 'Login'),
(889, '2026-02-02 18:03:29', 1, '', 'ISMS', 'Login'),
(890, '2026-02-03 17:57:51', 1, '', 'ISMS', 'Login'),
(891, '2026-02-04 03:28:04', 1, '', 'ISMS', 'Login'),
(892, '2026-02-04 07:55:34', 1, '', 'ISMS', 'Login'),
(893, '2026-02-05 13:15:02', 1, '', 'ISMS', 'Login'),
(894, '2026-02-06 07:15:27', 1, '', 'ISMS', 'Login'),
(895, '2026-02-06 08:58:16', 1, '', 'ISMS', 'Login'),
(896, '2026-02-06 16:48:11', 1, 'MAS-1', 'Maßnahmen', 'geändert'),
(897, '2026-02-06 16:48:32', 1, 'MAS-1', 'Maßnahmen', 'geändert'),
(898, '2026-02-06 16:49:12', 1, 'MAS-1', 'Maßnahmen', 'geändert'),
(899, '2026-02-07 00:49:34', 1, '', 'ISMS', 'Login'),
(900, '2026-02-07 01:04:04', 1, 'RSK-23', 'Risiken', 'geändert'),
(901, '2026-02-07 01:04:56', 1, 'RSK-22', 'Risiken', 'geändert'),
(902, '2026-02-07 01:05:19', 1, 'RSK-21', 'Risiken', 'geändert'),
(903, '2026-02-07 01:36:07', 1, '', 'ISMS', 'Login'),
(904, '2026-02-07 01:36:48', 1, '', 'ISMS', 'Login'),
(905, '2026-02-07 01:37:17', 1, '', 'ISMS', 'Login'),
(906, '2026-02-07 07:47:04', 1, '', 'ISMS', 'Login'),
(907, '2026-02-07 07:57:38', 1, 'RSK-21', 'Risiken', 'geändert'),
(908, '2026-02-07 08:51:53', 1, '', 'ISMS', 'Login'),
(909, '2026-02-07 08:59:41', 1, 'RSK-1', 'Risiken', 'geändert'),
(910, '2026-02-07 08:59:56', 1, 'RSK-2', 'Risiken', 'geändert'),
(911, '2026-02-07 09:00:07', 1, 'RSK-3', 'Risiken', 'geändert'),
(912, '2026-02-07 09:00:17', 1, 'RSK-4', 'Risiken', 'geändert'),
(913, '2026-02-07 09:00:32', 1, 'RSK-5', 'Risiken', 'geändert'),
(914, '2026-02-07 09:00:39', 1, 'RSK-6', 'Risiken', 'geändert'),
(915, '2026-02-07 09:00:48', 1, 'RSK-7', 'Risiken', 'geändert'),
(916, '2026-02-07 09:01:01', 1, 'RSK-9', 'Risiken', 'geändert'),
(917, '2026-02-07 09:01:09', 1, 'RSK-8', 'Risiken', 'geändert'),
(918, '2026-02-07 09:01:29', 1, '', 'ISMS', 'Login'),
(919, '2026-02-07 09:01:50', 1, 'RSK-11', 'Risiken', 'geändert'),
(920, '2026-02-07 09:02:02', 1, 'RSK-12', 'Risiken', 'geändert'),
(921, '2026-02-07 09:02:16', 1, 'RSK-13', 'Risiken', 'geändert'),
(922, '2026-02-07 09:02:24', 1, 'RSK-14', 'Risiken', 'geändert'),
(923, '2026-02-07 09:02:32', 1, 'RSK-15', 'Risiken', 'geändert'),
(924, '2026-02-07 09:02:40', 1, 'RSK-16', 'Risiken', 'geändert'),
(925, '2026-02-07 09:03:03', 1, 'RSK-17', 'Risiken', 'geändert'),
(926, '2026-02-07 09:03:26', 1, 'RSK-19', 'Risiken', 'geändert'),
(927, '2026-02-07 09:03:36', 1, 'RSK-20', 'Risiken', 'geändert'),
(928, '2026-02-07 09:04:00', 1, 'RSK-23', 'Risiken', 'geändert'),
(929, '2026-02-07 09:04:19', 1, 'RSK-22', 'Risiken', 'geändert'),
(930, '2026-02-07 09:10:47', 1, 'RSK-1', 'Risiken', 'geändert'),
(931, '2026-02-07 09:11:26', 1, 'RSK-1', 'Risiken', 'geändert'),
(932, '2026-02-07 09:11:55', 1, 'RSK-1', 'Risiken', 'geändert'),
(933, '2026-02-07 09:14:42', 1, 'RSK-2', 'Risiken', 'geändert'),
(934, '2026-02-07 09:15:07', 1, 'RSK-2', 'Risiken', 'geändert'),
(935, '2026-02-07 09:15:37', 1, 'RSK-2', 'Risiken', 'geändert'),
(936, '2026-02-07 09:16:42', 1, 'RSK-2', 'Risiken', 'geändert'),
(937, '2026-02-07 09:27:23', 1, 'RSK-1', 'Risiken', 'geändert'),
(938, '2026-02-07 09:29:03', 1, 'RSK-1', 'Risiken', 'geändert'),
(939, '2026-02-07 11:34:47', 1, 'RSK-1', 'Risiken', 'geändert'),
(940, '2026-02-07 11:35:02', 1, 'RSK-2', 'Risiken', 'geändert'),
(941, '2026-02-07 11:35:09', 1, 'RSK-3', 'Risiken', 'geändert'),
(942, '2026-02-07 11:35:15', 1, 'RSK-4', 'Risiken', 'geändert'),
(943, '2026-02-07 11:35:23', 1, 'RSK-5', 'Risiken', 'geändert'),
(944, '2026-02-07 11:35:31', 1, 'RSK-6', 'Risiken', 'geändert'),
(945, '2026-02-07 11:35:40', 1, 'RSK-7', 'Risiken', 'geändert'),
(946, '2026-02-07 11:35:49', 1, 'RSK-8', 'Risiken', 'geändert'),
(947, '2026-02-07 11:35:56', 1, 'RSK-9', 'Risiken', 'geändert'),
(948, '2026-02-07 11:36:01', 1, 'RSK-10', 'Risiken', 'geändert'),
(949, '2026-02-07 11:36:22', 1, 'RSK-11', 'Risiken', 'geändert'),
(950, '2026-02-07 11:36:29', 1, 'RSK-12', 'Risiken', 'geändert'),
(951, '2026-02-07 11:36:35', 1, 'RSK-13', 'Risiken', 'geändert'),
(952, '2026-02-07 11:36:41', 1, 'RSK-14', 'Risiken', 'geändert'),
(953, '2026-02-07 11:36:50', 1, 'RSK-15', 'Risiken', 'geändert'),
(954, '2026-02-07 11:36:56', 1, 'RSK-16', 'Risiken', 'geändert'),
(955, '2026-02-07 11:37:03', 1, 'RSK-17', 'Risiken', 'geändert'),
(956, '2026-02-07 11:37:11', 1, 'RSK-18', 'Risiken', 'geändert'),
(957, '2026-02-07 11:37:17', 1, 'RSK-19', 'Risiken', 'geändert'),
(958, '2026-02-07 11:37:26', 1, 'RSK-20', 'Risiken', 'geändert'),
(959, '2026-02-07 11:37:47', 1, 'RSK-21', 'Risiken', 'geändert'),
(960, '2026-02-07 11:37:57', 1, 'RSK-22', 'Risiken', 'geändert'),
(961, '2026-02-07 11:38:04', 1, 'RSK-23', 'Risiken', 'geändert'),
(962, '2026-02-07 11:43:19', 1, 'RSK-1', 'Risiken', 'geändert'),
(963, '2026-02-07 14:12:22', 1, 'RSK-2', 'Risiken', 'geändert'),
(964, '2026-02-07 15:35:49', 1, '', 'ISMS', 'Login'),
(965, '2026-02-07 17:59:03', 1, '', 'ISMS', 'Login'),
(966, '2026-02-08 02:19:08', 1, '', 'ISMS', 'Login'),
(967, '2026-02-08 02:53:35', 1, 'MAS-4', 'Maßnahmen', 'geändert'),
(968, '2026-02-08 08:27:28', 1, '', 'ISMS', 'Login'),
(969, '2026-02-08 09:07:53', 1, '10005', 'Lieferanten', 'angelegt'),
(970, '2026-02-08 09:09:42', 1, '10005', 'Lieferanten', 'geändert'),
(971, '2026-02-08 09:12:30', 1, '10001', 'Lieferanten', 'geändert'),
(972, '2026-02-08 09:12:36', 1, '10002', 'Lieferanten', 'geändert'),
(973, '2026-02-08 09:12:43', 1, '10003', 'Lieferanten', 'geändert'),
(974, '2026-02-08 09:12:51', 1, '10004', 'Lieferanten', 'geändert'),
(975, '2026-02-08 11:56:08', 1, '10001', 'Lieferanten', 'geändert'),
(976, '2026-02-08 12:05:44', 1, '10002', 'Lieferanten', 'geändert'),
(977, '2026-02-08 12:05:52', 1, '10001', 'Lieferanten', 'geändert'),
(978, '2026-02-08 12:11:38', 1, '10001', 'Lieferanten', 'geändert'),
(979, '2026-02-08 12:16:25', 1, '10005', 'Lieferanten', 'geändert'),
(980, '2026-02-08 12:19:12', 1, '10005', 'Lieferanten', 'geändert'),
(981, '2026-02-09 13:22:12', 1, '', 'ISMS', 'Login'),
(982, '2026-02-09 13:22:40', 1, '1', 'Maßnahmen', 'set review'),
(983, '2026-02-09 13:30:46', 1, '1', 'Maßnahmen', 'set review'),
(984, '2026-02-10 07:12:14', 1, '', 'ISMS', 'Login'),
(985, '2026-02-10 14:29:47', 1, 'RSK-2', 'Risiken', 'geändert'),
(986, '2026-02-10 14:33:08', 1, 'RSK-2', 'Risiken', 'geändert'),
(987, '2026-02-13 06:24:29', 1, '', 'ISMS', 'Login'),
(988, '2026-02-13 07:30:32', 1, '', 'ISMS', 'Login'),
(989, '2026-02-13 08:33:19', 1, '', 'ISMS', 'Login'),
(990, '2026-02-13 11:31:57', 1, '2', 'Risiken', 'Auswirkung'),
(991, '2026-02-13 11:32:19', 1, '2', 'Risiken', 'Auswirkung'),
(992, '2026-02-13 15:39:43', 1, 'A.5.1', 'Normen', 'geändert'),
(993, '2026-02-13 18:22:41', 1, 'Art.20', 'Normen', 'geändert'),
(994, '2026-02-13 18:26:05', 1, 'Art. 21 Abs. 1 & 2a', 'Normen', 'geändert'),
(995, '2026-02-13 18:27:44', 1, 'Art. 21 Abs. 2b', 'Normen', 'geändert'),
(996, '2026-02-13 18:28:54', 1, 'Art. 21 Abs. 2c', 'Normen', 'geändert'),
(997, '2026-02-13 18:29:46', 1, 'Art. 21 Abs. 2c', 'Normen', 'geändert'),
(998, '2026-02-13 18:30:58', 1, 'Art. 21 Abs. 2c', 'Normen', 'geändert'),
(999, '2026-02-13 18:32:18', 1, 'Art. 21 Abs. 2f', 'Normen', 'geändert'),
(1000, '2026-02-13 18:33:46', 1, 'Art. 21 Abs. 2g', 'Normen', 'geändert'),
(1001, '2026-02-13 18:34:40', 1, 'Art. 21 Abs. 2h', 'Normen', 'geändert'),
(1002, '2026-02-13 18:35:17', 1, 'Art. 21 Abs. 2i', 'Normen', 'angelegt'),
(1003, '2026-02-13 18:35:34', 1, 'Art. 21 Abs. 2i', 'Normen', 'geändert'),
(1004, '2026-02-13 18:36:10', 1, 'Art. 23', 'Normen', 'angelegt'),
(1005, '2026-02-13 18:36:26', 1, 'Art. 23', 'Normen', 'geändert'),
(1006, '2026-02-13 18:36:35', 1, 'Art. 23', 'Normen', 'geändert'),
(1007, '2026-02-14 02:41:54', 1, '', 'ISMS', 'Login'),
(1008, '2026-02-14 02:44:18', 1, 'NIS2-1', 'Maßnahmen', 'angelegt'),
(1009, '2026-02-14 02:45:31', 1, 'NIS2-2', 'Maßnahmen', 'angelegt'),
(1010, '2026-02-14 02:45:46', 1, 'NIS2-1', 'Maßnahmen', 'geändert'),
(1011, '2026-02-14 02:46:45', 1, 'NIS2-3', 'Maßnahmen', 'angelegt'),
(1012, '2026-02-14 02:47:50', 1, 'NIS2-4', 'Maßnahmen', 'angelegt'),
(1013, '2026-02-14 02:48:55', 1, 'NIS2-5', 'Maßnahmen', 'angelegt'),
(1014, '2026-02-14 02:50:09', 1, 'NIS2-6', 'Maßnahmen', 'angelegt'),
(1015, '2026-02-14 02:50:34', 1, 'NIS2-6', 'Maßnahmen', 'geändert'),
(1016, '2026-02-14 02:51:52', 1, 'NIS2-7', 'Maßnahmen', 'angelegt'),
(1017, '2026-02-14 02:52:50', 1, 'NIS2-8', 'Maßnahmen', 'angelegt'),
(1018, '2026-02-14 02:54:18', 1, 'NIS2-9', 'Maßnahmen', 'angelegt'),
(1019, '2026-02-14 02:55:09', 1, 'NIS2-10', 'Maßnahmen', 'angelegt'),
(1020, '2026-02-14 02:56:10', 1, 'NIS2-11', 'Maßnahmen', 'angelegt'),
(1021, '2026-02-14 02:57:11', 1, 'NIS2-12', 'Maßnahmen', 'angelegt'),
(1022, '2026-02-14 02:58:07', 1, 'NIS2-13', 'Maßnahmen', 'angelegt'),
(1023, '2026-02-14 03:16:34', 1, 'Art. 20', 'Normen', 'geändert'),
(1024, '2026-02-14 03:17:32', 1, 'Art. 21 Abs. 1 & 2a', 'Normen', 'geändert'),
(1025, '2026-02-14 03:18:54', 1, 'Art. 21 Abs. 2b', 'Normen', 'geändert'),
(1026, '2026-02-14 03:19:42', 1, 'Art. 21 Abs. 2c', 'Normen', 'geändert'),
(1027, '2026-02-14 11:05:48', 1, '', 'ISMS', 'Login'),
(1028, '2026-02-14 11:12:40', 1, 'Art. 21 Abs. 2d', 'Normen', 'geändert'),
(1029, '2026-02-14 11:30:57', 1, '5', 'Maßnahmen', 'set review'),
(1030, '2026-02-14 11:32:54', 1, '1', 'Maßnahmen', 'set review'),
(1031, '2026-02-14 11:33:18', 1, 'MAS-1', 'Maßnahmen', 'geändert'),
(1032, '2026-02-14 11:34:02', 1, '7', 'Maßnahmen', 'set review'),
(1033, '2026-02-14 12:09:13', 1, 'RSK-23', 'Risiken', 'geändert'),
(1034, '2026-02-14 12:10:13', 1, 'RSK-23', 'Risiken', 'geändert'),
(1035, '2026-02-14 12:13:02', 1, 'RSK-23', 'Risiken', 'geändert'),
(1036, '2026-02-14 12:15:22', 1, 'RSK-23', 'Risiken', 'geändert'),
(1037, '2026-02-14 15:20:31', 1, '', 'ISMS', 'Login'),
(1038, '2026-02-14 15:29:45', 1, '10001', 'Lieferanten', 'geändert'),
(1039, '2026-02-14 15:30:17', 1, '10001', 'Lieferanten', 'geändert'),
(1040, '2026-02-14 15:31:32', 1, '10001', 'Lieferanten', 'geändert'),
(1041, '2026-02-14 15:32:45', 1, '10001', 'Lieferanten', 'geändert'),
(1042, '2026-02-16 13:39:14', 1, '', 'ISMS', 'Login'),
(1043, '2026-02-16 13:39:14', 1, '', 'ISMS', 'Login'),
(1044, '2026-02-16 13:58:27', 1, '', 'ISMS', 'Login'),
(1045, '2026-02-16 17:46:59', 1, '', 'ISMS', 'Login'),
(1046, '2026-02-17 07:38:47', 1, 'Art. 21 Abs. 1 &amp; 2a', 'Normen', 'geändert'),
(1047, '2026-02-17 07:39:58', 1, 'POL-10', 'Dokumente', 'geändert'),
(1048, '2026-02-17 07:51:19', 1, 'POL-10', 'Dokumente', 'geändert'),
(1049, '2026-02-17 07:51:39', 1, 'Art. 21 Abs. 1 & 2a', 'Normen', 'geändert'),
(1050, '2026-02-17 08:56:42', 1, 'POL-10', 'Dokumente', 'geändert'),
(1051, '2026-02-17 12:27:03', 1, 'MAS-1', 'Maßnahmen', 'geändert'),
(1052, '2026-02-17 12:27:11', 1, 'MAS-1', 'Maßnahmen', 'geändert'),
(1053, '2026-02-17 12:28:41', 1, 'MAS-1', 'Maßnahmen', 'geändert'),
(1054, '2026-02-17 12:29:23', 1, 'MAS-1', 'Maßnahmen', 'geändert'),
(1055, '2026-02-17 12:31:23', 1, 'MAS-1', 'Maßnahmen', 'geändert'),
(1056, '2026-02-17 12:32:30', 1, 'MAS-2', 'Maßnahmen', 'geändert'),
(1057, '2026-02-17 12:35:29', 1, 'MAS-2', 'Maßnahmen', 'geändert'),
(1058, '2026-02-17 12:39:22', 1, 'MAS-2', 'Maßnahmen', 'geändert'),
(1059, '2026-02-17 12:48:19', 1, 'MAS-2', 'Maßnahmen', 'geändert'),
(1060, '2026-02-17 12:48:30', 1, 'MAS-2', 'Maßnahmen', 'geändert'),
(1061, '2026-02-17 12:48:34', 1, 'MAS-2', 'Maßnahmen', 'geändert'),
(1062, '2026-02-17 12:48:51', 1, 'MAS-3', 'Maßnahmen', 'geändert'),
(1063, '2026-02-17 12:49:30', 1, 'MAS-5', 'Maßnahmen', 'geändert'),
(1064, '2026-02-17 12:50:22', 1, 'MAS-5', 'Maßnahmen', 'geändert'),
(1065, '2026-02-17 12:50:39', 1, 'MAS-6', 'Maßnahmen', 'geändert'),
(1066, '2026-02-17 12:51:02', 1, 'MAS-7', 'Maßnahmen', 'geändert'),
(1067, '2026-02-17 14:29:41', 1, 'NIS2-1', 'Maßnahmen', 'geändert'),
(1068, '2026-02-17 14:31:43', 1, 'NIS2-1', 'Maßnahmen', 'geändert'),
(1069, '2026-02-17 14:38:34', 1, 'NIS2-2', 'Maßnahmen', 'geändert'),
(1070, '2026-02-18 17:26:32', 1, '', 'ISMS', 'Login'),
(1071, '2026-02-18 18:14:41', 1, 'RSK-2', 'Risiken', 'geändert'),
(1072, '2026-02-18 18:41:30', 1, 'RSK-2', 'Risiken', 'geändert'),
(1073, '2026-02-20 06:55:32', 1, '', 'ISMS', 'Login'),
(1074, '2026-02-27 01:40:08', 1, '', 'ISMS', 'Login'),
(1075, '2026-02-28 04:45:18', 1, 'PRO-1', 'Dokumente', 'geändert'),
(1076, '2026-02-28 04:48:09', 1, 'PRO-1', 'Dokumente', 'geändert'),
(1077, '2026-02-28 05:38:49', 1, 'RSK-2', 'Risiken', 'geändert'),
(1078, '2026-02-28 05:45:55', 1, 'RSK-21', 'Risiken', 'geändert'),
(1079, '2026-02-28 05:56:40', 1, 'RSK-2', 'Risiken', 'geändert'),
(1080, '2026-02-28 06:19:19', 1, 'RSK-22', 'Risiken', 'geändert'),
(1081, '2026-02-28 06:19:34', 1, 'RSK-23', 'Risiken', 'geändert'),
(1082, '2026-02-28 06:25:03', 1, 'RSK-20', 'Risiken', 'geändert'),
(1083, '2026-03-01 08:22:28', 1, '10001', 'Lieferanten', 'geändert'),
(1084, '2026-03-03 07:06:01', 1, '10001', 'Lieferanten', 'geändert'),
(1085, '2026-03-03 07:06:19', 1, '10002', 'Lieferanten', 'geändert'),
(1086, '2026-03-03 10:58:08', 1, '10004', 'Lieferanten', 'geändert'),
(1087, '2026-03-06 01:04:42', 6, '', 'ISMS', 'Login'),
(1088, '2026-03-06 01:21:14', 1, '', 'ISMS', 'Login'),
(1089, '2026-03-06 01:31:14', 6, '', 'ISMS', 'Login'),
(1090, '2026-03-06 01:32:07', 1, '', 'ISMS', 'Login'),
(1091, '2026-03-06 01:34:35', 6, '', 'ISMS', 'Login'),
(1092, '2026-03-06 01:49:10', 1, '', 'ISMS', 'Login'),
(1093, '2026-03-07 02:55:27', 1, '', 'ISMS', 'Login'),
(1094, '2026-03-07 02:57:59', 1, '', 'ISMS', 'Login'),
(1095, '2026-03-07 02:59:52', 1, '', 'ISMS', 'Login'),
(1096, '2026-03-07 07:40:49', 1, '27', 'Dokument', 'zu Prüfen'),
(1097, '2026-03-07 07:40:55', 1, '27', 'Dokument', 'geprüft'),
(1098, '2026-03-07 07:41:01', 1, '27', 'Dokument', 'freigegeben'),
(1099, '2026-03-08 05:23:53', 1, '28', 'Dokument', 'zu Prüfen'),
(1100, '2026-03-08 05:25:46', 1, '28', 'Dokument', 'zu Prüfen'),
(1101, '2026-03-08 05:27:41', 1, '28', 'Dokument', 'zu Prüfen'),
(1102, '2026-03-08 05:35:44', 1, '28', 'Dokument', 'geprüft'),
(1103, '2026-03-08 05:35:57', 1, '28', 'Dokument', 'freigegeben'),
(1104, '2026-03-08 05:36:36', 1, '29', 'Dokument', 'zu Prüfen'),
(1105, '2026-03-08 07:21:37', 1, '29', 'Dokument', 'geprüft'),
(1106, '2026-03-08 07:44:31', 1, '30', 'Dokument', 'zu Prüfen'),
(1107, '2026-03-08 07:44:38', 1, '30', 'Dokument', 'geprüft'),
(1108, '2026-03-08 07:47:35', 1, '30', 'Dokument', 'zu Prüfen'),
(1109, '2026-03-08 07:47:41', 1, '30', 'Dokument', 'geprüft'),
(1110, '2026-03-08 07:47:44', 1, '30', 'Dokument', 'freigegeben'),
(1111, '2026-03-08 09:17:19', 1, '29', 'Dokument', 'zu Prüfen'),
(1112, '2026-03-08 09:17:32', 1, '29', 'Dokument', 'freigegeben'),
(1113, '2026-03-08 09:17:52', 1, '29', 'Dokument', 'zu Prüfen'),
(1114, '2026-03-08 09:24:00', 1, '29', 'Dokument', 'freigegeben'),
(1115, '2026-03-08 09:31:58', 1, '29', 'Dokument', 'zu Prüfen'),
(1116, '2026-03-08 09:37:33', 1, '29', 'Dokument', 'geprüft'),
(1117, '2026-03-08 09:44:41', 1, '29', 'Dokument', 'zu Prüfen'),
(1118, '2026-03-08 09:44:48', 1, '29', 'Dokument', 'geprüft'),
(1119, '2026-03-08 09:46:07', 1, '29', 'Dokument', 'geprüft'),
(1120, '2026-03-08 09:48:34', 1, '29', 'Dokument', 'freigegeben'),
(1121, '2026-03-08 09:48:37', 1, '29', 'Dokument', 'geprüft'),
(1122, '2026-03-08 09:49:00', 1, '29', 'Dokument', 'zu Prüfen'),
(1123, '2026-03-08 09:53:02', 1, '29', 'Dokument', 'geprüft'),
(1124, '2026-03-08 10:05:20', 1, '29', 'Dokument', 'zu Prüfen'),
(1125, '2026-03-08 10:05:28', 1, '29', 'Dokument', 'geprüft'),
(1126, '2026-03-08 10:09:05', 1, '29', 'Dokument', 'freigegeben'),
(1127, '2026-03-08 10:09:08', 1, '29', 'Dokument', 'geprüft'),
(1128, '2026-03-08 15:07:17', 1, '29', 'Dokument', 'zu Prüfen'),
(1129, '2026-03-08 16:40:19', 1, '29', 'Dokument', 'geprüft'),
(1130, '2026-03-08 16:40:42', 1, '29', 'Dokument', 'geprüft'),
(1131, '2026-03-08 16:43:31', 1, '29', 'Dokument', 'geprüft'),
(1132, '2026-03-08 16:43:53', 1, '29', 'Dokument', 'zu Prüfen'),
(1133, '2026-03-08 16:47:33', 1, '30', 'Dokument', 'zu Prüfen'),
(1134, '2026-03-08 16:47:52', 1, '30', 'Dokument', 'geprüft'),
(1135, '2026-03-10 14:33:54', 1, '', 'ISMS', 'Login'),
(1136, '2026-03-12 05:57:51', 6, '', 'ISMS', 'Login'),
(1137, '2026-03-12 05:58:23', 1, '', 'ISMS', 'Login'),
(1138, '2026-03-12 05:59:17', 6, '', 'ISMS', 'Login'),
(1139, '2026-03-12 06:03:39', 1, '', 'ISMS', 'Login'),
(1140, '2026-03-12 06:04:13', 6, '', 'ISMS', 'Login'),
(1141, '2026-03-12 06:10:26', 6, '', 'ISMS', 'Login'),
(1142, '2026-03-12 06:10:56', 1, '', 'ISMS', 'Login'),
(1143, '2026-03-12 06:22:12', 6, '', 'ISMS', 'Login'),
(1144, '2026-03-12 06:57:30', 1, '', 'ISMS', 'Login'),
(1145, '2026-03-12 06:58:10', 0, '', 'ISMS', 'Login'),
(1146, '2026-03-12 06:58:34', 1, '', 'ISMS', 'Login'),
(1147, '2026-03-13 07:39:06', 1, '', 'ISMS', 'Login'),
(1148, '2026-03-13 07:40:52', 1, '', 'ISMS', 'Login'),
(1149, '2026-03-13 16:41:13', 1, '50', 'Dokument', 'set review'),
(1150, '2026-03-13 23:55:57', 1, 'NIS2-1', 'Maßnahmen', 'geändert'),
(1151, '2026-03-13 23:56:12', 1, 'NIS2-2', 'Maßnahmen', 'geändert'),
(1152, '2026-03-14 06:15:14', 1, 'PRO-1', 'Projekte', 'geändert'),
(1153, '2026-03-14 06:16:46', 1, 'PRO-1', 'Projekte', 'geändert'),
(1154, '2026-03-14 06:25:36', 1, 'PRO-1', 'Projekte', 'geändert'),
(1155, '2026-03-14 07:11:53', 1, 'PRO-1', 'Projekte', 'geändert'),
(1156, '2026-03-14 08:03:03', 1, 'NIS2-1', 'Maßnahmen', 'geändert'),
(1157, '2026-03-14 08:03:32', 1, 'NIS2-2', 'Maßnahmen', 'geändert'),
(1158, '2026-03-14 08:04:38', 1, 'NIS2-3', 'Maßnahmen', 'geändert'),
(1159, '2026-03-14 08:05:12', 1, 'NIS2-4', 'Maßnahmen', 'geändert'),
(1160, '2026-03-14 08:05:27', 1, 'NIS2-5', 'Maßnahmen', 'geändert'),
(1161, '2026-03-14 08:07:08', 1, 'MAS-1', 'Maßnahmen', 'geändert'),
(1162, '2026-03-14 08:27:25', 1, '', 'ISMS', 'Login'),
(1163, '2026-03-14 08:46:39', 1, '', 'ISMS', 'Login'),
(1164, '2026-03-14 12:02:30', 1, '24', 'Risiken', 'Auswirkung'),
(1165, '2026-03-14 12:06:57', 1, 'RSK-23', 'Risiken', 'geändert'),
(1166, '2026-03-14 12:07:27', 1, '24', 'Risiken', 'Auswirkung'),
(1167, '2026-03-18 06:59:23', 1, '58', 'Dokument', 'zu Prüfen'),
(1168, '2026-03-18 07:00:06', 1, '58', 'Dokument', 'geprüft'),
(1169, '2026-03-18 07:00:15', 1, '58', 'Dokument', 'freigegeben'),
(1170, '2026-03-18 07:04:26', 1, '59', 'Dokument', 'zu Prüfen'),
(1171, '2026-03-18 07:11:26', 1, '59', 'Dokument', 'geprüft'),
(1172, '2026-03-18 07:12:34', 1, '29', 'Dokument', 'geprüft'),
(1173, '2026-03-18 07:16:03', 1, '59', 'Dokument', 'freigegeben'),
(1174, '2026-03-18 07:23:00', 1, '60', 'Dokument', 'zu Prüfen'),
(1175, '2026-03-18 07:23:06', 1, '60', 'Dokument', 'geprüft'),
(1176, '2026-03-18 07:23:09', 1, '60', 'Dokument', 'freigegeben'),
(1177, '2026-03-18 07:33:17', 1, '56', 'Dokument', 'zu Prüfen'),
(1178, '2026-03-18 07:33:21', 1, '56', 'Dokument', 'geprüft'),
(1179, '2026-03-18 07:33:23', 1, '56', 'Dokument', 'freigegeben'),
(1180, '2026-03-21 03:54:33', 1, 'RSK-23', 'Risiken', 'geändert'),
(1181, '2026-03-22 03:36:47', 1, '', 'ISMS', 'Login'),
(1182, '2026-03-24 07:07:09', 1, '', 'ISMS', 'Login'),
(1183, '2026-03-24 13:34:09', 1, 'Vendor-Gewichte', 'Admin', 'Tabelle angelegt / Standardwerte geladen'),
(1184, '2026-03-24 13:34:37', 1, 'Vendor-Gewichte', 'Admin', 'Bewertungsgewichte geändert'),
(1185, '2026-03-25 19:00:18', 1, '', 'ISMS', 'Login'),
(1186, '2026-03-26 13:59:04', 1, '', 'ISMS', 'Login'),
(1187, '2026-03-26 15:27:06', 18, '', 'ISMS', 'Login (SSO Google)'),
(1188, '2026-03-26 17:43:23', 18, '', 'ISMS', 'Login (SSO Google)'),
(1189, '2026-03-26 17:44:02', 1, '', 'ISMS', 'Login'),
(1190, '2026-03-26 17:44:28', 18, '', 'ISMS', 'Login (SSO Google)'),
(1191, '2026-03-27 18:29:08', 18, '', 'ISMS', 'Login (SSO Google)'),
(1192, '2026-03-28 06:56:26', 1, '', 'ISMS', 'Login'),
(1193, '2026-03-30 06:48:55', 1, '', 'ISMS', 'Login'),
(1194, '2026-03-31 06:50:10', 1, 'SOA-1', 'Dokumente', 'SoA angelegt'),
(1195, '2026-03-31 06:52:51', 1, 'SOA-2', 'Dokumente', 'SoA angelegt'),
(1196, '2026-03-31 07:00:36', 1, 'SOA-1', 'Dokumente', 'SoA v0.0 angelegt'),
(1197, '2026-03-31 07:01:08', 1, 'SOA-1', 'Dokumente', 'SoA v0.1 aktualisiert'),
(1198, '2026-03-31 07:01:54', 1, '63', 'Dokument', 'zu Prüfen'),
(1199, '2026-03-31 07:02:14', 1, 'SOA-2', 'Dokumente', 'SoA v1.0 (neuer Entwurf) angelegt'),
(1200, '2026-03-31 07:02:29', 1, 'SOA-3', 'Dokumente', 'SoA v1.0 (neuer Entwurf) angelegt'),
(1201, '2026-03-31 07:06:02', 1, 'SOA-2', 'Dokumente', 'SoA v1.1 Entwurf angelegt'),
(1202, '2026-03-31 07:06:22', 1, 'SOA-2', 'Dokumente', 'SoA v1.1 Entwurf aktualisiert'),
(1203, '2026-03-31 07:06:41', 1, 'SOA-2', 'Dokumente', 'SoA v1.1 Entwurf aktualisiert'),
(1204, '2026-03-31 07:08:13', 1, 'SOA-2', 'Dokumente', 'SoA v1.2 Entwurf aktualisiert'),
(1205, '2026-03-31 07:08:38', 1, '63', 'Dokument', 'geprüft'),
(1206, '2026-03-31 07:08:42', 1, '63', 'Dokument', 'freigegeben'),
(1207, '2026-03-31 13:40:13', 6, '', 'ISMS', 'Login'),
(1208, '2026-03-31 13:40:48', 1, '', 'ISMS', 'Login'),
(1209, '2026-03-31 13:41:38', 6, '', 'ISMS', 'Login'),
(1210, '2026-03-31 13:42:03', 1, '', 'ISMS', 'Login'),
(1211, '2026-03-31 13:44:46', 0, '', 'ISMS', 'Fehlanmeldung (Benutzer nicht gefunden): ignatz.kiechle@depp.de'),
(1212, '2026-03-31 13:44:58', 1, '', 'ISMS', 'Fehlanmeldung (falsches Passwort): wolfgang@schuster.ws'),
(1213, '2026-03-31 13:45:07', 1, '', 'ISMS', 'Login'),
(1214, '2026-03-31 13:55:51', 1, '23', 'Risiken', 'Auswirkung'),
(1215, '2026-03-31 13:59:19', 1, '23', 'Risiken', 'Auswirkung'),
(1216, '2026-03-31 14:04:30', 1, '23', 'Risiken', 'Auswirkung'),
(1217, '2026-03-31 23:38:05', 1, '', 'ISMS', 'Login'),
(1218, '2026-04-01 09:55:02', 1, '', 'ISMS', 'Login'),
(1219, '2026-04-01 09:55:26', 18, '', 'ISMS', 'Fehlanmeldung (falsches Passwort): wolfschus@gmail.com'),
(1220, '2026-04-01 09:55:42', 18, '', 'ISMS', 'Fehlanmeldung (falsches Passwort): wolfschus@gmail.com'),
(1221, '2026-04-01 09:55:53', 1, '', 'ISMS', 'Login'),
(1222, '2026-04-01 09:56:36', 18, '', 'ISMS', 'Fehlanmeldung (falsches Passwort): wolfschus@gmail.com'),
(1223, '2026-04-01 09:56:47', 1, '', 'ISMS', 'Login'),
(1224, '2026-04-01 09:58:15', 19, '', 'ISMS', 'Login'),
(1225, '2026-04-01 09:59:36', 19, '', 'ISMS', 'Fehlanmeldung (falsches Passwort): wolfgang.schuster@wittenstein.de'),
(1226, '2026-04-01 09:59:46', 19, '', 'ISMS', 'Fehlanmeldung (falsches Passwort): wolfgang.schuster@wittenstein.de'),
(1227, '2026-04-01 09:59:57', 1, '', 'ISMS', 'Fehlanmeldung (falsches Passwort): wolfgang@schuster.ws'),
(1228, '2026-04-01 10:00:21', 19, '', 'ISMS', 'Login (2FA)'),
(1229, '2026-04-01 12:26:28', 1, '', 'ISMS', 'Login'),
(1230, '2026-04-01 13:52:33', 19, '', 'ISMS', 'Login (2FA)'),
(1231, '2026-04-01 14:57:09', 1, '', 'ISMS', 'Login'),
(1232, '2026-04-01 15:02:38', 19, '', 'ISMS', 'Login (2FA)'),
(1233, '2026-04-01 15:04:14', 1, '', 'ISMS', 'Login'),
(1234, '2026-04-01 15:19:00', 1, '13', 'Maßnahmen', 'Review durchgeführt'),
(1235, '2026-04-01 15:20:10', 1, '56', 'Dokumente', 'Review durchgeführt'),
(1236, '2026-04-01 15:43:18', 1, '10010004', 'Assets', 'angelegt'),
(1237, '2026-04-01 15:43:55', 1, '10010005', 'Assets', 'angelegt'),
(1238, '2026-04-01 15:45:51', 1, '10004', 'Assets', 'geändert'),
(1239, '2026-04-01 15:52:42', 1, '10002', 'Assets', 'CIA vererbt von Töchtern (101,102,103,104)'),
(1240, '2026-04-01 15:53:34', 1, '10010005', 'Assets', 'CIA vererbt von Töchtern (95,94,93,92)'),
(1241, '2026-04-01 15:59:00', 1, '10010004', 'Assets', 'CIA vererbt von Töchtern (106)'),
(1242, '2026-04-01 15:59:20', 1, '105', 'Assets', 'Review durchgeführt'),
(1243, '2026-04-01 16:34:05', 1, 'Art. 2', 'Normen', 'geändert'),
(1244, '2026-04-01 16:34:22', 1, 'Art. 3', 'Normen', 'geändert'),
(1245, '2026-04-01 16:39:54', 1, 'Art. 8', 'Normen', 'geändert'),
(1246, '2026-04-01 17:02:26', 1, '10010006', 'Assets', 'angelegt'),
(1247, '2026-04-01 17:02:50', 1, '10010006', 'Assets', 'CIA vererbt von Töchtern (98)'),
(1248, '2026-04-04 06:20:19', 1, '', 'ISMS', 'Fehlanmeldung (falsches Passwort): wolfgang@schuster.ws'),
(1249, '2026-04-04 06:20:27', 1, '', 'ISMS', 'Login'),
(1250, '2026-04-04 09:04:04', 1, '', 'ISMS', 'Login'),
(1251, '2026-04-04 09:08:45', 1, 'NIS2-6', 'Maßnahmen', 'geändert'),
(1252, '2026-04-04 15:08:22', 1, 'NIS2-7', 'Maßnahmen', 'geändert'),
(1253, '2026-04-04 15:17:33', 1, 'NIS2-8', 'Maßnahmen', 'geändert'),
(1254, '2026-04-04 15:18:02', 1, 'NIS2-9', 'Maßnahmen', 'geändert'),
(1255, '2026-04-04 15:18:35', 1, 'NIS2-10', 'Maßnahmen', 'geändert'),
(1256, '2026-04-04 15:18:53', 1, 'NIS2-11', 'Maßnahmen', 'geändert'),
(1257, '2026-04-04 15:19:08', 1, 'NIS2-12', 'Maßnahmen', 'geändert'),
(1258, '2026-04-04 15:19:22', 1, 'NIS2-13', 'Maßnahmen', 'geändert'),
(1259, '2026-04-04 15:19:42', 1, 'MAS-3', 'Maßnahmen', 'geändert'),
(1260, '2026-04-04 15:19:54', 1, '6', 'Maßnahmen', 'Review durchgeführt'),
(1261, '2026-04-05 08:13:47', 1, '97', 'Assets', 'Review durchgeführt'),
(1262, '2026-04-05 08:14:16', 1, '49', 'Lieferanten', 'Review durchgeführt'),
(1263, '2026-04-05 08:17:00', 1, '50', 'Lieferanten', 'Review durchgeführt'),
(1264, '2026-04-05 08:17:36', 1, '100', 'Assets', 'Review durchgeführt'),
(1265, '2026-04-05 08:18:39', 1, '101', 'Assets', 'Review durchgeführt'),
(1266, '2026-04-05 08:23:51', 1, '102', 'Assets', 'Review durchgeführt'),
(1267, '2026-04-05 08:24:29', 1, '103', 'Assets', 'Review durchgeführt'),
(1268, '2026-04-05 08:25:17', 1, '104', 'Assets', 'Review durchgeführt'),
(1269, '2026-04-05 08:25:56', 1, '51', 'Lieferanten', 'Review durchgeführt'),
(1270, '2026-04-05 08:26:37', 1, '106', 'Assets', 'Review durchgeführt'),
(1271, '2026-04-05 08:33:01', 1, '107', 'Assets', 'Review durchgeführt'),
(1272, '2026-04-05 08:33:35', 1, '9', 'Maßnahmen', 'Review durchgeführt'),
(1273, '2026-04-05 08:33:47', 1, '10', 'Maßnahmen', 'Review durchgeführt'),
(1274, '2026-04-05 08:34:00', 1, '11', 'Maßnahmen', 'Review durchgeführt'),
(1275, '2026-04-05 08:34:13', 1, '12', 'Maßnahmen', 'Review durchgeführt'),
(1276, '2026-04-05 08:34:45', 1, '14', 'Maßnahmen', 'Review durchgeführt'),
(1277, '2026-04-05 08:35:06', 1, '15', 'Maßnahmen', 'Review durchgeführt'),
(1278, '2026-04-05 08:35:25', 1, '16', 'Maßnahmen', 'Review durchgeführt'),
(1279, '2026-04-05 08:35:34', 1, '17', 'Maßnahmen', 'Review durchgeführt'),
(1280, '2026-04-05 08:35:51', 1, '18', 'Maßnahmen', 'Review durchgeführt'),
(1281, '2026-04-05 08:36:03', 1, '19', 'Maßnahmen', 'Review durchgeführt'),
(1282, '2026-04-05 08:36:16', 1, '20', 'Maßnahmen', 'Review durchgeführt'),
(1283, '2026-04-05 08:36:28', 1, '21', 'Maßnahmen', 'Review durchgeführt'),
(1284, '2026-04-07 13:02:45', 1, '', 'ISMS', 'Login'),
(1285, '2026-04-09 03:15:40', 1, '', 'ISMS', 'Login'),
(1286, '2026-04-09 03:18:12', 0, '', 'ISMS', 'Fehlanmeldung (Benutzer nicht gefunden): test@schuster.ws'),
(1287, '2026-04-09 03:18:30', 1, '', 'ISMS', 'Login'),
(1288, '2026-04-09 03:18:45', 1, '', 'ISMS', 'Login'),
(1289, '2026-04-09 03:20:30', 17, '', 'ISMS', 'Fehlanmeldung (falsches Passwort): test@wolfisms.de'),
(1290, '2026-04-09 03:21:40', 17, '', 'ISMS', 'Login'),
(1291, '2026-04-09 03:31:31', 1, '', 'ISMS', 'Login'),
(1292, '2026-04-09 03:44:04', 1, 'SOA-0003', 'Dokumente', 'angelegt (Risikobehandlungsplan)'),
(1293, '2026-04-10 03:15:53', 1, '10010006', 'Assets', 'geändert'),
(1294, '2026-04-10 03:16:32', 1, '10010005', 'Assets', 'geändert'),
(1295, '2026-04-10 03:16:50', 1, '10010004', 'Assets', 'geändert'),
(1296, '2026-04-10 03:17:37', 1, '10009', 'Assets', 'geändert'),
(1297, '2026-04-10 03:18:00', 1, '10008', 'Assets', 'geändert'),
(1298, '2026-04-10 03:18:28', 1, '10007', 'Assets', 'geändert'),
(1299, '2026-04-10 03:18:47', 1, '10006', 'Assets', 'geändert'),
(1300, '2026-04-10 03:19:08', 1, '10005', 'Assets', 'geändert'),
(1301, '2026-04-10 03:19:32', 1, '10004', 'Assets', 'geändert'),
(1302, '2026-04-10 03:19:57', 1, '10003', 'Assets', 'geändert'),
(1303, '2026-04-10 03:20:17', 1, '10002', 'Assets', 'geändert'),
(1304, '2026-04-10 03:20:40', 1, '10001', 'Assets', 'geändert'),
(1305, '2026-04-10 03:40:15', 1, '10005', 'Lieferanten', 'geändert'),
(1306, '2026-04-10 07:13:03', 1, '10007', 'Assets', 'geändert'),
(1307, '2026-04-10 07:13:10', 1, '10007', 'Assets', 'geändert'),
(1308, '2026-04-10 07:20:34', 1, '10010', 'Assets', 'geändert'),
(1309, '2026-04-10 07:20:49', 1, '10010', 'Assets', 'geändert'),
(1310, '2026-04-10 11:32:51', 1, '10010006', 'Assets', 'geändert'),
(1311, '2026-04-10 11:33:05', 1, '10010005', 'Assets', 'geändert'),
(1312, '2026-04-10 11:33:22', 1, '10010004', 'Assets', 'geändert'),
(1313, '2026-04-10 11:34:07', 1, '10013', 'Assets', 'geändert'),
(1314, '2026-04-10 11:42:46', 1, 'Personalleitung', 'Admin', 'Rolle angelegt'),
(1315, '2026-04-10 11:42:59', 1, 'ID 37', 'Admin', 'Rolle gelöscht'),
(1316, '2026-04-10 11:43:17', 1, '10012', 'Assets', 'geändert'),
(1317, '2026-04-10 11:43:38', 1, 'Leitung Finanzwesen', 'Admin', 'Rolle angelegt'),
(1318, '2026-04-10 11:44:33', 1, 'Leitung Vertrieb', 'Admin', 'Rolle angelegt'),
(1319, '2026-04-10 11:44:50', 1, '10010', 'Assets', 'geändert'),
(1320, '2026-04-10 11:46:37', 1, '10009', 'Assets', 'geändert'),
(1321, '2026-04-10 11:47:00', 1, '10008', 'Assets', 'geändert'),
(1322, '2026-04-10 11:47:12', 1, '10007', 'Assets', 'geändert'),
(1323, '2026-04-10 11:47:29', 1, '10006', 'Assets', 'geändert'),
(1324, '2026-04-10 11:47:42', 1, '10005', 'Assets', 'geändert'),
(1325, '2026-04-10 11:48:09', 1, '10004', 'Assets', 'geändert'),
(1326, '2026-04-10 11:48:22', 1, '10003', 'Assets', 'geändert'),
(1327, '2026-04-10 11:48:32', 1, '10002', 'Assets', 'geändert'),
(1328, '2026-04-10 11:48:52', 1, '10001', 'Assets', 'geändert'),
(1329, '2026-04-10 11:57:01', 1, '100014', 'Assets', 'geändert'),
(1330, '2026-04-10 11:57:12', 1, '10014', 'Assets', 'geändert'),
(1331, '2026-04-10 11:57:21', 1, '10015', 'Assets', 'geändert'),
(1332, '2026-04-10 11:57:32', 1, '10016', 'Assets', 'geändert'),
(1333, '2026-04-10 11:58:58', 1, 'RSK-23', 'Risiken', 'geändert'),
(1334, '2026-04-10 12:04:48', 1, 'RSK-22', 'Risiken', 'geändert'),
(1335, '2026-04-10 12:05:02', 1, 'RSK-21', 'Risiken', 'geändert'),
(1336, '2026-04-10 12:05:19', 1, 'RSK-20', 'Risiken', 'geändert'),
(1337, '2026-04-10 12:05:29', 1, 'RSK-2', 'Risiken', 'geändert'),
(1338, '2026-04-11 10:36:47', 1, '', 'ISMS', 'Fehlanmeldung (falsches Passwort): wolfgang@schuster.ws'),
(1339, '2026-04-11 10:36:57', 1, '', 'ISMS', 'Login'),
(1340, '2026-04-11 16:59:41', 1, 'RBP-0003', 'Dokumente', 'geändert'),
(1341, '2026-04-11 17:37:04', 1, 'MAS-3', 'Maßnahmen', 'geändert'),
(1342, '2026-04-11 17:38:28', 1, 'RSK-1', 'Risiken', 'geändert'),
(1343, '2026-04-11 17:38:42', 1, 'RBP-0004', 'Dokumente', 'angelegt (Risikobehandlungsplan)'),
(1344, '2026-04-11 17:56:00', 1, '116', 'Dokument', 'zu Prüfen'),
(1345, '2026-04-11 17:56:06', 1, '116', 'Dokument', 'geprüft'),
(1346, '2026-04-11 17:56:08', 1, '116', 'Dokument', 'freigegeben'),
(1347, '2026-04-12 06:17:25', 18, '', 'ISMS', 'Login (SSO Google)'),
(1348, '2026-04-12 06:20:11', 18, '', 'ISMS', 'Login (SSO Google)'),
(1349, '2026-04-12 06:44:27', 1, '', 'ISMS', 'Login'),
(1350, '2026-04-12 07:03:29', 1, '', 'ISMS', 'Login'),
(1351, '2026-04-12 07:08:37', 1, '', 'ISMS', 'Fehlanmeldung (falsches Passwort): wolfgang@schuster.ws'),
(1352, '2026-04-12 07:08:46', 1, '', 'ISMS', 'Login'),
(1353, '2026-04-12 07:09:46', 18, '', 'ISMS', 'Login (SSO Google)'),
(1354, '2026-04-12 07:56:59', 18, '', 'ISMS', 'Login (SSO Google)'),
(1355, '2026-04-12 08:46:16', 18, '', 'ISMS', 'Login (SSO Google)'),
(1356, '2026-04-12 08:49:22', 1, '', 'ISMS', 'Login'),
(1357, '2026-04-12 08:51:19', 18, '', 'ISMS', 'Login (SSO Google)'),
(1358, '2026-04-12 08:56:51', 1, '', 'ISMS', 'Login'),
(1359, '2026-04-12 08:59:12', 1, '', 'ISMS', 'Login'),
(1360, '2026-04-12 09:00:59', 1, '', 'ISMS', 'Login'),
(1361, '2026-04-12 09:02:26', 18, '', 'ISMS', 'Login (SSO Google)'),
(1362, '2026-04-12 09:04:25', 1, '', 'ISMS', 'Login'),
(1363, '2026-04-12 09:07:13', 1, '', 'ISMS', 'Login'),
(1364, '2026-04-12 09:26:44', 1, '', 'ISMS', 'Login'),
(1365, '2026-04-12 09:33:43', 1, '', 'ISMS', 'Login'),
(1366, '2026-04-12 09:35:40', 1, 'POL-11', 'Dokumente', 'geändert'),
(1367, '2026-04-12 09:36:28', 1, 'POL-11', 'Dokumente', 'geändert'),
(1368, '2026-04-12 09:36:34', 18, '', 'ISMS', 'Login (SSO Google)'),
(1369, '2026-04-12 09:36:51', 1, '', 'ISMS', 'Login'),
(1370, '2026-04-12 09:37:34', 1, '31', 'Dokument', 'zu Prüfen'),
(1371, '2026-04-12 09:37:41', 1, '31', 'Dokument', 'geprüft'),
(1372, '2026-04-12 09:37:44', 1, '31', 'Dokument', 'freigegeben'),
(1373, '2026-04-12 09:38:01', 18, '', 'ISMS', 'Login (SSO Google)'),
(1374, '2026-04-12 09:38:48', 18, '', 'ISMS', 'Login (SSO Google)'),
(1375, '2026-04-12 09:38:58', 18, '', 'ISMS', 'Login (SSO Google)'),
(1376, '2026-04-12 09:40:10', 18, '', 'ISMS', 'Login (SSO Google)'),
(1377, '2026-04-12 09:45:12', 1, '', 'ISMS', 'Login'),
(1378, '2026-04-12 14:19:20', 18, '', 'ISMS', 'Login (SSO Google)'),
(1379, '2026-04-13 02:19:25', 18, '', 'ISMS', 'Login (SSO Google)'),
(1380, '2026-04-13 02:32:17', 18, '', 'ISMS', 'Login (SSO Google)'),
(1381, '2026-04-13 13:22:00', 1, '', 'ISMS', 'Login'),
(1382, '2026-04-14 15:26:09', 1, '50', 'Dokumente', 'Review durchgeführt'),
(1383, '2026-04-14 15:26:34', 1, '4', 'Maßnahmen', 'Review durchgeführt'),
(1384, '2026-04-14 15:26:56', 1, 'MAS-4', 'Maßnahmen', 'geändert'),
(1385, '2026-04-14 15:27:14', 1, 'MAS-3', 'Maßnahmen', 'geändert'),
(1386, '2026-04-14 16:12:31', 1, 'MAS-0002', 'Maßnahmen', 'angelegt'),
(1387, '2026-04-14 16:13:25', 1, 'RSK-2', 'Risiken', 'geändert'),
(1388, '2026-04-14 16:14:31', 1, '2', 'Risiken', 'Auswirkung'),
(1389, '2026-04-14 16:15:00', 1, 'RSK-2', 'Risiken', 'geändert'),
(1390, '2026-04-14 16:15:21', 1, 'RBP-0005', 'Dokumente', 'angelegt (Risikobehandlungsplan)'),
(1391, '2026-04-14 18:34:30', 1, '', 'ISMS', 'Login'),
(1392, '2026-04-15 02:56:43', 1, 'MAS-0002', 'Maßnahmen', 'geändert'),
(1393, '2026-04-16 13:05:36', 1, '', 'ISMS', 'Login'),
(1394, '2026-04-18 03:01:25', 1, '', 'ISMS', 'Login'),
(1395, '2026-04-19 18:25:16', 1, 'POL-1', 'Dokumente', 'KI-Bearbeitung vorgeschlagen'),
(1396, '2026-04-19 18:29:01', 1, 'POL-1', 'Dokumente', 'KI-Bearbeitung vorgeschlagen'),
(1397, '2026-04-19 18:29:28', 1, 'POL-1', 'Dokumente', 'KI-Bearbeitung übernommen'),
(1398, '2026-04-19 18:35:06', 1, 'POL-2', 'Dokumente', 'KI-Bearbeitung vorgeschlagen'),
(1399, '2026-04-19 18:35:23', 1, 'POL-2', 'Dokumente', 'KI-Bearbeitung übernommen'),
(1400, '2026-04-21 06:20:59', 1, '', 'ISMS', 'Login'),
(1401, '2026-04-21 11:47:50', 1, 'POL-21', 'Dokumente', 'geändert'),
(1402, '2026-04-22 03:53:34', 1, '', 'ISMS', 'Login'),
(1403, '2026-04-22 18:04:39', 1, '', 'ISMS', 'Login'),
(1404, '2026-04-24 17:54:51', 1, '', 'ISMS', 'Login'),
(1405, '2026-04-27 01:17:00', 1, '', 'ISMS', 'Login'),
(1406, '2026-04-27 12:32:08', 1, '', 'ISMS', 'Login'),
(1407, '2026-04-28 18:18:11', 1, '', 'ISMS', 'Fehlanmeldung (falsches Passwort): wolfgang@schuster.ws'),
(1408, '2026-04-28 18:18:22', 1, '', 'ISMS', 'Login'),
(1409, '2026-04-29 03:40:38', 1, '', 'ISMS', 'Login'),
(1410, '2026-04-29 03:52:05', 1, 'RBP-0006', 'Dokumente', 'angelegt (Auditbericht)'),
(1411, '2026-04-29 03:57:11', 1, 'RBP-0007', 'Dokumente', 'angelegt (Auditbericht)'),
(1412, '2026-04-29 04:00:34', 1, 'RBP-0008', 'Dokumente', 'angelegt (Auditbericht)'),
(1413, '2026-04-29 04:07:18', 1, 'RBP-0006', 'Dokumente', 'Entwurf gelöscht: Auditbericht 29.04.2026'),
(1414, '2026-04-29 04:07:26', 1, 'RBP-0007', 'Dokumente', 'Entwurf gelöscht: Auditbericht 29.04.2026'),
(1415, '2026-04-29 05:21:27', 1, '', 'ISMS', 'Login'),
(1416, '2026-04-30 14:21:32', 1, '', 'ISMS', 'Login'),
(1417, '2026-05-01 03:47:27', 1, '', 'ISMS', 'Login'),
(1418, '2026-05-01 07:29:30', 1, '', 'ISMS', 'Login'),
(1419, '2026-05-04 13:45:03', 1, '', 'ISMS', 'Login'),
(1420, '2026-05-06 03:16:37', 1, '', 'ISMS', 'Fehlanmeldung (falsches Passwort): wolfgang@schuster.ws'),
(1421, '2026-05-06 03:16:48', 1, '', 'ISMS', 'Login'),
(1422, '2026-05-06 12:41:55', 1, '', 'ISMS', 'Login'),
(1423, '2026-05-06 12:44:49', 1, '10013', 'Assets', 'geändert'),
(1424, '2026-05-09 01:44:46', 1, '', 'ISMS', 'Login'),
(1425, '2026-05-09 05:00:28', 1, '–', 'Audit', 'Norm-Übernahme: Audit → ISO/IEC 27001:2022 (0 Einträge aktualisiert)'),
(1426, '2026-05-09 05:04:42', 1, '–', 'Audit', 'Norm-Übernahme: Audit → ISO/IEC 27001:2022 (115 Einträge aktualisiert)'),
(1427, '2026-05-09 05:38:20', 1, '1.1', 'Normen', 'geändert'),
(1428, '2026-05-09 05:38:37', 1, '1.2', 'Normen', 'geändert'),
(1429, '2026-05-09 05:39:24', 1, '1.3', 'Normen', 'geändert'),
(1430, '2026-05-09 05:39:40', 1, '1.4', 'Normen', 'geändert'),
(1431, '2026-05-09 05:39:56', 1, '1.5', 'Normen', 'geändert'),
(1432, '2026-05-09 05:40:18', 1, '1.6', 'Normen', 'geändert'),
(1433, '2026-05-09 05:40:39', 1, '1.7', 'Normen', 'geändert'),
(1434, '2026-05-09 05:41:02', 1, '1.8', 'Normen', 'geändert'),
(1435, '2026-05-09 05:41:25', 1, '1.9', 'Normen', 'geändert'),
(1436, '2026-05-10 19:33:35', 1, '', 'ISMS', 'Login'),
(1437, '2026-05-12 02:52:47', 1, '', 'ISMS', 'Login'),
(1438, '2026-05-12 15:38:30', 1, '', 'ISMS', 'Login'),
(1439, '2026-05-14 02:38:39', 1, '', 'ISMS', 'Login'),
(1440, '2026-05-17 06:24:08', 1, '', 'ISMS', 'Login'),
(1441, '2026-05-17 06:29:19', 1, '', 'ISMS', 'Login'),
(1442, '2026-05-19 13:06:04', 1, '', 'ISMS', 'Login'),
(1443, '2026-05-20 18:28:38', 1, '', 'ISMS', 'Login'),
(1444, '2026-05-20 18:40:53', 1, '10008', 'Assets', 'geändert'),
(1445, '2026-05-21 09:03:27', 1, '', 'ISMS', 'Fehlanmeldung (falsches Passwort): wolfgang@schuster.ws'),
(1446, '2026-05-21 09:14:49', 1, '', 'ISMS', 'Login'),
(1447, '2026-05-21 12:49:45', 1, '', 'ISMS', 'Login'),
(1448, '2026-05-22 06:33:23', 1, 'ASS-0001', 'Assets', 'angelegt'),
(1449, '2026-05-22 06:33:48', 1, 'ASS-0001', 'Assets', 'CIA vererbt an Tochterassets (99)'),
(1450, '2026-05-22 06:34:09', 1, 'ASS-0001', 'Assets', 'CIA vererbt an Tochterassets (99)'),
(1451, '2026-05-22 06:36:21', 1, 'ASS-0001', 'Assets', 'CIA top-down vererbt an (99): V=niedrig I=niedrig A=normal'),
(1452, '2026-05-22 06:36:35', 1, 'ASS-0001', 'Assets', 'CIA top-down vererbt an (99): V=niedrig I=niedrig A=normal'),
(1453, '2026-05-22 06:37:44', 1, 'ASS-0001', 'Assets', 'CIA top-down vererbt an (99): V=niedrig I=niedrig A=normal'),
(1454, '2026-05-22 06:41:10', 1, 'ASS-0001', 'Assets', 'CIA top-down vererbt an (99): V=niedrig I=niedrig A=normal'),
(1455, '2026-05-22 06:42:30', 1, 'ASS-0001', 'Assets', 'CIA top-down vererbt an (99): V=niedrig I=niedrig A=normal'),
(1456, '2026-05-22 06:44:29', 1, 'ASS-0001', 'Assets', 'CIA top-down vererbt an (99): V=niedrig I=niedrig A=normal'),
(1457, '2026-05-22 06:46:26', 1, 'ASS-0001', 'Assets', 'CIA top-down vererbt an (99): V=niedrig I=niedrig A=normal'),
(1458, '2026-05-25 05:23:48', 1, '', 'ISMS', 'Login'),
(1459, '2026-05-26 17:45:59', 1, '', 'ISMS', 'Login'),
(1460, '2026-05-29 10:37:58', 1, '', 'ISMS', 'Login'),
(1461, '2026-05-30 11:04:31', 18, '', 'ISMS', 'Login (SSO Google)'),
(1462, '2026-05-31 15:05:01', 1, '', 'ISMS', 'Login'),
(1463, '2026-05-31 15:08:57', 1, '', 'ISMS', 'Login'),
(1464, '2026-05-31 15:09:12', 18, '', 'ISMS', 'Login (SSO Google)'),
(1465, '2026-05-31 15:16:49', 1, '', 'ISMS', 'Login'),
(1466, '2026-06-02 06:05:46', 1, '', 'ISMS', 'Login'),
(1467, '2026-06-10 14:25:23', 1, '', 'ISMS', 'Login'),
(1468, '2026-06-10 14:39:14', 1, '', 'Kommentare', 'Kommentar erstellt (Dokument)'),
(1469, '2026-06-10 14:52:21', 1, '', 'Kommentare', 'Antwort erstellt (Dokument)'),
(1470, '2026-06-12 14:44:38', 1, '', 'ISMS', 'Login'),
(1471, '2026-06-12 13:09:59', 1, '', 'ISMS', 'Login'),
(1472, '2026-06-12 14:30:26', 1, '', 'ISMS', 'Login'),
(1473, '2026-06-13 05:36:13', 1, '', 'ISMS', 'Login'),
(1474, '2026-06-13 05:41:17', 1, '', 'ISMS', 'Login'),
(1475, '2026-06-16 13:16:25', 1, '', 'ISMS', 'Login'),
(1476, '2026-06-16 15:41:52', 1, '', 'ISMS', 'Login'),
(1477, '2026-06-17 13:07:42', 1, '', 'ISMS', 'Login'),
(1478, '2026-06-17 16:49:16', 1, '', 'ISMS', 'Login'),
(1479, '2026-06-19 04:42:01', 1, '', 'ISMS', 'Login'),
(1480, '2026-06-20 05:06:20', 1, '', 'ISMS', 'Login'),
(1481, '2026-06-20 05:10:52', 1, '', 'ISMS', 'Login'),
(1482, '2026-06-30 15:15:47', 1, '', 'ISMS', 'Login'),
(1483, '2026-06-30 15:15:54', 1, '', 'ISMS', 'Login'),
(1484, '2026-06-30 15:16:09', 1, '', 'ISMS', 'Login'),
(1485, '2026-06-30 15:16:22', 1, '', 'ISMS', 'Login'),
(1486, '2026-06-30 15:16:30', 1, '', 'ISMS', 'Login'),
(1487, '2026-06-30 15:16:36', 1, '', 'ISMS', 'Login'),
(1488, '2026-06-30 15:27:41', 1, '', 'ISMS', 'Login'),
(1489, '2026-06-30 15:52:11', 1, '', 'ISMS', 'Login'),
(1490, '2026-07-02 05:42:33', 1, '', 'ISMS', 'Login'),
(1491, '2026-07-02 14:02:41', 18, '', 'ISMS', 'Login (SSO Google)'),
(1492, '2026-07-02 14:42:44', 18, '', 'ISMS', 'Login (SSO Google)'),
(1493, '2026-07-02 14:48:22', 18, '', 'ISMS', 'Login (SSO Google)'),
(1494, '2026-07-02 15:41:44', 1, '', 'ISMS', 'Login'),
(1495, '2026-07-02 15:42:29', 18, '', 'ISMS', 'Login (SSO Google)'),
(1496, '2026-07-04 13:32:23', 18, '', 'ISMS', 'Login (SSO Google)'),
(1497, '2026-07-05 14:21:57', 1, '', 'ISMS', 'Login'),
(1498, '2026-07-05 14:22:02', 1, '', 'ISMS', 'Login'),
(1499, '2026-07-05 14:23:51', 1, '', 'ISMS', 'Login'),
(1500, '2026-07-05 16:54:12', 1, '', 'ISMS', 'Login'),
(1501, '2026-07-05 16:54:17', 1, '', 'ISMS', 'Login'),
(1502, '2026-07-05 16:58:54', 1, '', 'ISMS', 'Login'),
(1503, '2026-07-06 11:12:30', 1, '', 'ISMS', 'Login'),
(1504, '2026-07-06 11:13:15', 1, 'RSK-22', 'Risiken', 'geändert'),
(1505, '2026-07-06 11:14:19', 1, 'RSK-22', 'Risiken', 'geändert'),
(1506, '2026-07-06 11:15:06', 1, 'RSK-22', 'Risiken', 'geändert'),
(1507, '2026-07-06 11:31:46', 1, 'RSK-22', 'Risiken', 'geändert'),
(1508, '2026-07-06 11:31:56', 1, 'RSK-22', 'Risiken', 'geändert'),
(1509, '2026-07-06 11:44:30', 1, 'PRJ-0001', 'Projekte', 'angelegt'),
(1510, '2026-07-06 12:30:57', 1, '', 'ISMS', 'Login'),
(1511, '2026-07-06 12:31:02', 1, '', 'ISMS', 'Login'),
(1512, '2026-07-06 12:31:19', 1, '', 'ISMS', 'Login'),
(1513, '2026-07-06 15:31:24', 1, 'ID 17', 'Admin', 'Benutzer gelöscht: test@wolfisms.de'),
(1514, '2026-07-07 01:35:54', 1, '', 'ISMS', 'Login'),
(1515, '2026-07-07 05:15:00', 1, '10008', 'Assets', 'geändert'),
(1516, '2026-07-07 09:24:34', 23, '', 'ISMS', 'Login'),
(1517, '2026-07-07 09:45:14', 1, '', 'ISMS', 'Login'),
(1518, '2026-07-07 11:18:38', 1, '', 'ISMS', 'Login'),
(1519, '2026-07-07 15:06:41', 1, 'POL-22', 'Dokumente', 'angelegt'),
(1520, '2026-07-07 15:07:25', 1, 'POL-22', 'Dokumente', 'KI-Bearbeitung vorgeschlagen'),
(1521, '2026-07-07 15:08:16', 1, 'POL-22', 'Dokumente', 'KI-Bearbeitung übernommen'),
(1522, '2026-07-08 12:17:57', 1, 'MAS-0021', 'Maßnahmen', 'angelegt'),
(1523, '2026-07-08 13:04:21', 1, 'SQL-SELECT', 'SQL-Konsole', '❌ SELECT * FROM Risiken LIMIT 50'),
(1524, '2026-07-08 13:04:30', 1, 'SQL-SELECT', 'SQL-Konsole', '❌ SELECT * FROM risiken LIMIT 50'),
(1525, '2026-07-08 13:04:53', 1, 'SQL-SELECT', 'SQL-Konsole', '✅ SELECT * FROM users LIMIT 50'),
(1526, '2026-07-08 13:09:54', 1, 'SQL-SELECT', 'SQL-Konsole', '✅ SELECT VERSION()'),
(1527, '2026-07-08 13:09:59', 1, 'SQL-SHOW', 'SQL-Konsole', '✅ SHOW FULL PROCESSLIST'),
(1528, '2026-07-08 13:10:06', 1, 'SQL-SELECT', 'SQL-Konsole', '✅ SELECT VERSION()'),
(1529, '2026-07-08 13:10:15', 1, 'SQL-SHOW', 'SQL-Konsole', '✅ SHOW TABLE STATUS'),
(1530, '2026-07-08 13:47:35', 1, 'SQL-ALTER', 'SQL-Konsole', '✅ ALTER TABLE `Normen`\r\n  ADD COLUMN `gelöscht` TINYINT(1) NOT NULL DEFAULT 0 AFTER `verwandte_normen`'),
(1531, '2026-07-08 13:47:56', 1, 'SQL-ALTER', 'SQL-Konsole', '✅ ALTER TABLE `Normen`\r\n  ADD INDEX `idx_normen_geloescht` (`gelöscht`)'),
(1532, '2026-07-09 16:45:37', 1, '', 'ISMS', 'Login'),
(1533, '2026-07-10 05:27:02', 1, '', 'ISMS', 'Login'),
(1534, '2026-07-10 05:27:04', 1, '', 'ISMS', 'Login'),
(1535, '2026-07-10 05:27:14', 1, '', 'ISMS', 'Login'),
(1536, '2026-07-10 05:41:25', 1, 'SQL-ALTER', 'SQL-Konsole', '❌ ALTER TABLE `Risiko`\r\n  ADD COLUMN `normen` varchar(256) DEFAULT NULL\r\n  COMMENT \'Kommagetrennte IDs verknüpfter Normen (aus Tabelle Normen)\'\r\n  AFTER `dokumente`'),
(1537, '2026-07-10 06:15:12', 1, 'SQL-ALTER', 'SQL-Konsole', '✅ ALTER TABLE `Assets`\r\n  ADD COLUMN `normen` varchar(256) DEFAULT NULL\r\n  COMMENT \'Kommagetrennte IDs verknüpfter Normen (aus Tabelle Normen)\''),
(1538, '2026-07-10 06:29:18', 1, '', 'ISMS', 'Login'),
(1539, '2026-07-10 15:34:54', 1, 'NIS2', 'Normen', 'komplett gelöscht (40 Einträge)'),
(1540, '2026-07-10 16:05:02', 1, 'NIS2-DVO EU 2024/2690', 'Normen', 'komplett gelöscht (27 Einträge)'),
(1541, '2026-07-10 23:24:10', 1, '', 'ISMS', 'Login'),
(1542, '2026-07-10 23:25:57', 1, '', 'ISMS', 'Login'),
(1543, '2026-07-10 23:25:59', 1, '', 'ISMS', 'Login'),
(1544, '2026-07-10 23:30:53', 1, '', 'ISMS', 'Login'),
(1545, '2026-07-10 23:30:55', 1, '', 'ISMS', 'Login'),
(1546, '2026-07-11 05:42:55', 1, 'NIS2-DVO EU 2024/2690', 'Normen', 'komplett gelöscht (27 Einträge)'),
(1547, '2026-07-13 11:54:01', 1, '', 'ISMS', 'Login'),
(1548, '2026-07-13 12:09:43', 1, 'ISO/IEC 27002:2022', 'Normen', 'komplett gelöscht (93 Einträge)'),
(1549, '2026-07-13 15:27:53', 1, 'RSK-00023', 'Risiken', 'geändert');
INSERT INTO `activities` (`id`, `datumuhrzeit`, `user`, `nummer`, `bereich`, `was`) VALUES
(1550, '2026-07-14 00:17:22', 1, '', 'ISMS', 'Login'),
(1551, '2026-07-14 00:37:47', 1, 'Dokumente', 'Dokumente-SQL-Export', '43 Dokument(e) exportiert'),
(1552, '2026-07-14 03:01:40', 24, '', 'ISMS', 'Fehlanmeldung (falsches Passwort): claude@schuster.ws'),
(1553, '2026-07-14 03:01:55', 24, '', 'ISMS', 'Fehlanmeldung (falsches Passwort): claude@schuster.ws'),
(1554, '2026-07-14 03:02:09', 1, '', 'ISMS', 'Fehlanmeldung (falsches Passwort): wolfgang@schuster.ws'),
(1555, '2026-07-14 03:02:20', 1, '', 'ISMS', 'Login'),
(1556, '2026-07-14 03:04:45', 25, '', 'ISMS', 'Login'),
(1557, '2026-07-14 03:11:21', 25, '', 'ISMS', 'Fehlanmeldung (falsches Passwort): claude@schuster.ws'),
(1558, '2026-07-14 08:15:04', 1, 'DOK-00037', 'Dokumente', 'SoA v1.1 Entwurf aktualisiert'),
(1559, '2026-07-14 08:34:28', 1, 'DOK-00037', 'Dokumente', 'SoA v1.2 Entwurf aktualisiert'),
(1560, '2026-07-14 08:35:10', 1, 'DOK-00033', 'Dokumente', 'Entwurf gelöscht: Statement of Applicability (SoA) – 31.03.2026'),
(1561, '2026-07-14 08:38:14', 1, 'DOK-00037', 'Dokumente', 'Entwurf gelöscht: Statement of Applicability (SoA) – 14.07.2026'),
(1562, '2026-07-14 08:51:32', 1, 'TISAX', 'Normen', 'komplett gelöscht (72 Einträge)'),
(1563, '2026-07-14 12:58:22', 1, 'BSI Grundschutz++', 'Normen', 'komplett gelöscht (29 Einträge)'),
(1564, '2026-07-14 12:58:28', 1, 'BSI-Grundschutz', 'Normen', 'komplett gelöscht (111 Einträge)'),
(1565, '2026-07-14 13:05:25', 1, 'SQL-ALTER', 'SQL-Konsole', '✅ ALTER TABLE `Normen`\r\n  MODIFY `Kapitel` varchar(256) DEFAULT NULL'),
(1566, '2026-07-14 13:08:19', 1, 'BSI Grundschutz++', 'Normen', 'komplett gelöscht (636 Einträge)'),
(1567, '2026-07-15 10:53:52', 1, '18', 'Admin', 'Benutzer deaktiviert: Wolfgang Schuster G'),
(1568, '2026-07-15 11:40:22', 1, 'RSK-0024', 'Risiken', 'angelegt'),
(1569, '2026-07-15 11:40:47', 1, 'RSK-00023', 'Risiken', 'geändert'),
(1570, '2026-07-15 11:56:19', 1, 'RSK-0025', 'Risiken', 'angelegt'),
(1571, '2026-07-16 07:46:51', 1, '', 'ISMS', 'Login'),
(1572, '2026-07-16 07:46:58', 1, '', 'ISMS', 'Login'),
(1573, '2026-07-16 17:17:49', 1, '', 'ISMS', 'Login'),
(1574, '2026-07-16 17:18:13', 1, 'DOK-00038', 'Dokumente', 'Entwurf gelöscht: KI'),
(1575, '2026-07-16 17:18:53', 1, 'POL-40', 'Dokumente', 'angelegt'),
(1576, '2026-07-16 17:20:08', 1, 'POL-40', 'Dokumente', 'KI-Bearbeitung vorgeschlagen'),
(1577, '2026-07-16 17:22:22', 1, 'POL-40', 'Dokumente', 'KI-Bearbeitung übernommen'),
(1578, '2026-07-16 21:07:39', 1, 'SQL-UPDATE', 'SQL-Konsole', '❌ UPDATE risiko_status SET <spalte> = \'behandelt\'     WHERE <spalte> = \'umgesetzt\''),
(1579, '2026-07-16 21:10:39', 1, 'SQL-UPDATE', 'SQL-Konsole', '✅ UPDATE risiko_status SET status = \'behandelt\'     WHERE status = \'umgesetzt\''),
(1580, '2026-07-16 21:10:51', 1, 'SQL-UPDATE', 'SQL-Konsole', '✅ UPDATE risiko_status SET status = \'in Behandlung\' WHERE status = \'in Umsetzung\''),
(1581, '2026-07-16 21:11:05', 1, 'SQL-UPDATE', 'SQL-Konsole', '✅ UPDATE Risiko SET Status = \'behandelt\'     WHERE Status = \'umgesetzt\''),
(1582, '2026-07-16 21:11:17', 1, 'SQL-UPDATE', 'SQL-Konsole', '✅ UPDATE Risiko SET Status = \'in Behandlung\' WHERE Status = \'in Umsetzung\''),
(1583, '2026-07-16 21:11:30', 1, 'SQL-UPDATE', 'SQL-Konsole', '✅ UPDATE Risiko SET archiviert = 0'),
(1584, '2026-07-16 21:13:29', 1, 'RSK-00019', 'Risiken', 'geändert'),
(1585, '2026-07-16 21:13:43', 1, 'RSK-00018', 'Risiken', 'geändert'),
(1586, '2026-07-17 03:48:08', 1, '', 'ISMS', 'Login'),
(1587, '2026-07-17 03:48:30', 1, '', 'ISMS', 'Login'),
(1588, '2026-07-17 03:50:24', 1, 'POL-40', 'Dokumente', 'Entwurf gelöscht: KI Richlinie'),
(1589, '2026-07-17 08:50:20', 1, '', 'ISMS', 'Login'),
(1590, '2026-07-18 05:51:38', 1, 'SQL-ALTER', 'SQL-Konsole', '✅ ALTER TABLE Dokumente\r\n    MODIFY werpruefen int(10) NULL,\r\n    MODIFY werfreigeben int(10) NULL'),
(1591, '2026-07-20 12:36:51', 1, '', 'ISMS', 'Login'),
(1592, '2026-07-20 13:40:46', 1, 'DOK-00031', 'Dokumente', 'geändert'),
(1593, '2026-07-20 13:42:42', 1, 'DOK-00031', 'Dokumente', 'geändert'),
(1594, '2026-07-20 13:43:54', 1, 'DOK-00031', 'Dokumente', 'geändert'),
(1595, '2026-07-20 13:58:59', 1, 'DOK-00031', 'Dokumente', 'geändert'),
(1596, '2026-07-21 17:43:46', 1, '', 'ISMS', 'Login'),
(1597, '2026-07-21 17:44:19', 1, '', 'ISMS', 'Login'),
(1598, '2026-07-21 17:44:28', 1, '', 'ISMS', 'Login'),
(1599, '2026-07-21 17:44:40', 1, '', 'ISMS', 'Login'),
(1600, '2026-07-21 17:45:52', 1, '', 'ISMS', 'Login'),
(1601, '2026-07-21 17:45:53', 1, '', 'ISMS', 'Login'),
(1602, '2026-07-21 18:15:55', 1, '26', 'Benutzer', 'CSV-Import: Leon Schuster (leon@schuster.ws)'),
(1603, '2026-07-23 02:24:30', 1, '', 'ISMS', 'Login'),
(1604, '2026-07-23 02:28:10', 1, '32', 'Dokument', 'zu Prüfen'),
(1605, '2026-07-23 02:28:35', 1, '32', 'Dokument', 'geprüft'),
(1606, '2026-07-23 05:56:57', 1, '', 'ISMS', 'Login'),
(1607, '2026-07-23 12:54:13', 1, 'AST-00017', 'Assets', 'geändert'),
(1608, '2026-07-23 18:05:58', 1, 'RSK-00017', 'Risiken', 'geändert'),
(1609, '2026-07-23 18:09:53', 23, '', 'ISMS', 'Login'),
(1610, '2026-07-23 18:10:43', 1, '', 'ISMS', 'Login'),
(1611, '2026-07-24 05:50:46', 1, 'MAS-00021', 'Maßnahmen', 'geändert'),
(1612, '2026-07-24 14:13:18', 1, 'RSK-00016', 'Risiken', 'geändert'),
(1613, '2026-07-24 14:15:18', 1, 'RSK-0024', 'Risiken', 'geändert'),
(1614, '2026-07-26 18:20:00', 1, '', 'ISMS', 'Login'),
(1615, '2026-07-27 17:12:03', 1, 'DOK-00014', 'Dokumente', 'geändert'),
(1616, '2026-07-27 17:29:31', 1, 'LIF-00006', 'Lieferanten', 'angelegt'),
(1617, '2026-07-28 06:05:46', 1, 'AST-00018', 'Assets', 'angelegt'),
(1618, '2026-07-28 06:08:09', 1, 'AST-00019', 'Assets', 'angelegt'),
(1619, '2026-07-28 06:08:57', 1, 'AST-00018', 'Assets', 'geändert'),
(1620, '2026-07-28 06:09:37', 1, 'AST-00018', 'Assets', 'CIA top-down vererbt an (108): V=normal I=normal A=normal'),
(1621, '2026-07-29 03:07:13', 1, '', 'ISMS', 'Login'),
(1622, '2026-07-29 13:31:18', 1, 'A.5.1', 'Normen', 'geändert'),
(1623, '2026-07-29 13:32:24', 1, 'A.5.1', 'Normen', 'geändert'),
(1624, '2026-07-29 13:35:46', 1, 'A.8.17', 'Normen', 'geändert'),
(1625, '2026-07-30 14:27:09', 1, '', 'ISMS', 'Login'),
(1626, '2026-07-30 14:27:13', 1, '', 'ISMS', 'Login'),
(1627, '2026-07-30 14:27:32', 1, '', 'ISMS', 'Login'),
(1628, '2026-07-30 14:29:34', 1, 'RSK-00023', 'Risiken', 'geändert'),
(1629, '2026-07-30 14:51:09', 1, 'Risiken', 'Risiken-SQL-Export', '23 Risiko/Risiken exportiert'),
(1630, '2026-07-31 06:56:49', 1, 'Dokumente', 'Dokumente-SQL-Export', '40 Dokument(e) exportiert'),
(1631, '2026-07-31 07:39:21', 1, 'Dokumente', 'Dokumente-SQL-Export', '40 Datensatz/Datensätze exportiert'),
(1632, '2026-07-31 07:49:12', 1, 'Alle Bereiche', 'Daten-SQL-Export', 'Komplettpaket exportiert (Dokumente: 40, Risiken: 23, Maßnahmen: 21)'),
(1633, '2026-07-31 09:45:36', 1, 'Maßnahmen', 'Massnahmen-SQL-Import', '126 importiert, 0 übersprungen, 125 Fehler'),
(1634, '2026-07-31 10:17:07', 1, 'zum Testen', 'Admin', 'API-Key angelegt'),
(1635, '2026-07-31 10:38:07', 1, 'REST-GET', 'REST-Konsole', '❌ GET https://isms/isms/api/v1/incidents?status=Gemeldet,in%20Bewertung&prio=hoch,kritisch&von=2025-07-01 → –'),
(1636, '2026-07-31 10:49:12', 1, 'REST-GET', 'REST-Konsole', '✅ GET https://isms/isms/api/v1/incidents?status=Gemeldet,in%20Bewertung&prio=hoch,kritisch&von=2025-07-01 → 200'),
(1637, '2026-07-31 10:56:33', 1, '', 'ISMS', 'Login'),
(1638, '2026-07-31 10:56:34', 1, '', 'ISMS', 'Login'),
(1639, '2026-08-01 03:05:35', 1, '', 'ISMS', 'Login'),
(1640, '2026-08-02 07:47:15', 1, '', 'ISMS', 'Login'),
(1641, '2026-08-02 09:34:10', 1, 'MAS-00003', 'Maßnahmen', 'geändert'),
(1642, '2026-08-02 09:34:35', 1, 'MAS-00021', 'Maßnahmen', 'geändert'),
(1643, '2026-08-02 09:35:02', 1, 'MAS-00004', 'Maßnahmen', 'geändert'),
(1644, '2026-08-02 09:35:20', 1, 'MAS-00012', 'Maßnahmen', 'geändert'),
(1645, '2026-08-02 09:35:35', 1, 'MAS-00012', 'Maßnahmen', 'geändert'),
(1646, '2026-08-02 09:36:07', 1, '13', 'Maßnahmen', 'Review durchgeführt'),
(1647, '2026-08-02 09:36:27', 1, '4', 'Maßnahmen', 'Review durchgeführt'),
(1648, '2026-08-02 14:32:39', 1, '', 'ISMS', 'Login'),
(1649, '2026-08-03 13:46:13', 1, 'RSK-00023', 'Risiko', 'KI-Maßnahmenvorschlag erzeugt'),
(1650, '2026-08-03 13:47:16', 1, 'MAS-00148', 'Maßnahmen', 'per KI angelegt'),
(1651, '2026-08-03 13:47:16', 1, 'MAS-00149', 'Maßnahmen', 'per KI angelegt'),
(1652, '2026-08-03 13:47:16', 1, 'MAS-00150', 'Maßnahmen', 'per KI angelegt'),
(1653, '2026-08-03 13:47:16', 1, 'MAS-00151', 'Maßnahmen', 'per KI angelegt'),
(1654, '2026-08-03 13:47:16', 1, 'MAS-00152', 'Maßnahmen', 'per KI angelegt'),
(1655, '2026-08-03 13:47:16', 1, 'RSK-00023', 'Risiko', '11 Maßnahme(n) per KI verknüpft'),
(1656, '2026-08-03 15:09:17', 1, 'RSK-00023', 'Risiko', 'KI-Vorschlag erzeugt'),
(1657, '2026-08-03 15:10:06', 1, 'RSK-00023', 'Risiko', '8 Bedrohung(en) per KI verknüpft'),
(1658, '2026-08-03 15:10:06', 1, 'RSK-00023', 'Risiko', '8 Schwachstelle(n) per KI verknüpft'),
(1659, '2026-08-03 15:48:09', 1, 'RSK-00022', 'Risiko', 'KI-Vorschlag erzeugt'),
(1660, '2026-08-03 15:48:50', 1, 'MAS-00153', 'Maßnahmen', 'per KI angelegt'),
(1661, '2026-08-03 15:48:50', 1, 'MAS-00154', 'Maßnahmen', 'per KI angelegt'),
(1662, '2026-08-03 15:48:50', 1, 'MAS-00155', 'Maßnahmen', 'per KI angelegt'),
(1663, '2026-08-03 15:48:50', 1, 'MAS-00156', 'Maßnahmen', 'per KI angelegt'),
(1664, '2026-08-03 15:48:50', 1, 'MAS-00157', 'Maßnahmen', 'per KI angelegt'),
(1665, '2026-08-03 15:48:50', 1, 'RSK-00022', 'Risiko', '11 Maßnahme(n) per KI verknüpft'),
(1666, '2026-08-03 15:48:50', 1, 'RSK-00022', 'Risiko', '5 Bedrohung(en) per KI verknüpft'),
(1667, '2026-08-03 15:48:50', 1, 'RSK-00022', 'Risiko', '7 Schwachstelle(n) per KI verknüpft'),
(1668, '2026-08-03 15:48:51', 1, 'RSK-00022', 'Risiko', '6 Dokument(e) per KI verknüpft'),
(1669, '2026-08-03 15:48:51', 1, 'RSK-00022', 'Risiko', '8 Norm(en) per KI verknüpft'),
(1670, '2026-08-04 07:58:53', 1, 'INC-00001', 'Incidents', 'KI-Vorschlag erzeugt'),
(1671, '2026-08-05 14:16:52', 1, '', 'ISMS', 'Login'),
(1672, '2026-08-05 17:33:48', 1, 'RSK-00021', 'Risiko', 'KI-Vorschlag erzeugt'),
(1673, '2026-08-05 17:34:31', 1, 'RSK-00021', 'Risiko', '6 Maßnahme(n) per KI verknüpft'),
(1674, '2026-08-05 17:34:31', 1, 'RSK-00021', 'Risiko', '5 Bedrohung(en) per KI verknüpft'),
(1675, '2026-08-05 17:34:31', 1, 'RSK-00021', 'Risiko', '7 Schwachstelle(n) per KI verknüpft'),
(1676, '2026-08-05 17:34:31', 1, 'RSK-00021', 'Risiko', '7 Dokument(e) per KI verknüpft'),
(1677, '2026-08-05 17:34:57', 1, 'RSK-00021', 'Risiko', 'KI-Vorschlag erzeugt'),
(1678, '2026-08-05 21:13:09', 1, '', 'ISMS', 'Login'),
(1679, '2026-08-06 06:40:54', 1, 'RSK-00023', 'Risiko', 'KI-Vorschlag erzeugt'),
(1680, '2026-08-06 06:46:19', 1, 'RSK-00021', 'Risiko', 'KI-Vorschlag erzeugt'),
(1681, '2026-08-07 15:03:58', 18, '', 'ISMS', 'Fehlanmeldung (falsches Passwort): wolfschus@gmail.com'),
(1682, '2026-08-07 15:04:17', 1, '', 'ISMS', 'Login'),
(1683, '2026-08-08 16:24:17', 1, 'RSK-00019', 'Risiko', 'KI-Vorschlag erzeugt'),
(1684, '2026-08-08 16:25:01', 1, 'MAS-00158', 'Maßnahmen', 'per KI angelegt'),
(1685, '2026-08-08 16:25:01', 1, 'MAS-00159', 'Maßnahmen', 'per KI angelegt'),
(1686, '2026-08-08 16:25:01', 1, 'MAS-00160', 'Maßnahmen', 'per KI angelegt'),
(1687, '2026-08-08 16:25:01', 1, 'MAS-00161', 'Maßnahmen', 'per KI angelegt'),
(1688, '2026-08-08 16:25:01', 1, 'MAS-00162', 'Maßnahmen', 'per KI angelegt'),
(1689, '2026-08-08 16:25:01', 1, 'RSK-00019', 'Risiko', '12 Maßnahme(n) per KI verknüpft'),
(1690, '2026-08-08 16:25:01', 1, 'RSK-00019', 'Risiko', '7 Bedrohung(en) per KI verknüpft'),
(1691, '2026-08-08 16:25:01', 1, 'RSK-00019', 'Risiko', '7 Schwachstelle(n) per KI verknüpft'),
(1692, '2026-08-09 05:31:20', 1, '', 'ISMS', 'Login'),
(1693, '2026-08-10 13:14:48', 1, 'AST-00017', 'Assets', 'geändert'),
(1694, '2026-08-13 17:32:28', 1, '', 'ISMS', 'Login'),
(1695, '2026-08-14 15:55:28', 1, '', 'ISMS', 'Login'),
(1696, '2026-08-14 16:11:06', 1, '', 'ISMS', 'Login'),
(1697, '2026-08-15 06:23:21', 1, 'REST-GET', 'REST-Konsole', '❌ GET https://192.168.178.105/isms/api/v1/risiken?limit=20&sort=riskscore&order=desc → –'),
(1698, '2026-08-15 06:23:37', 1, 'REST-GET', 'REST-Konsole', '❌ GET https://192.168.178.105/isms/api/v1/risiken?limit=20&sort=riskscore&order=desc → 401'),
(1699, '2026-08-15 06:31:29', 1, 'REST-GET', 'REST-Konsole', '✅ GET https://192.168.178.105/isms/api/v1/risiken?limit=20&sort=riskscore&order=desc → 200'),
(1700, '2026-08-15 06:31:55', 1, 'REST-GET', 'REST-Konsole', '✅ GET https://192.168.178.105/isms/api/v1/assets?limit=20&sort=nummer&order=asc → 200'),
(1701, '2026-08-15 06:36:20', 1, 'REST-GET', 'REST-Konsole', '✅ GET https://192.168.178.105/isms/api/v1/risiken?risiko=hoch,kritisch&limit=50 → 200'),
(1702, '2026-08-16 06:21:24', 1, 'AST-00020', 'Assets', 'angelegt'),
(1703, '2026-08-16 08:45:14', 1, 'LIF-00005', 'Lieferanten', 'geändert'),
(1704, '2026-08-16 09:10:07', 1, '', 'Lieferanten', 'Fragebogen versendet'),
(1705, '2026-08-16 09:14:52', 1, '', 'Lieferanten', 'Fragebogen beantwortet'),
(1706, '2026-08-16 10:01:00', 1, 'LIF-00005', 'Lieferanten', 'geändert'),
(1707, '2026-08-16 10:09:04', 1, 'LIF-00003', 'Lieferanten', 'Fragebogen-Erfassung begonnen'),
(1708, '2026-08-16 13:24:02', 1, 'LIF-00005', 'Lieferanten', 'Fragebogen-PDF bereitgestellt'),
(1709, '2026-08-16 13:33:42', 1, 'LIF-00005', 'Lieferanten', 'Fragebogen-PDF bereitgestellt'),
(1710, '2026-08-16 15:37:03', 1, 'LIF-00001', 'Lieferanten', 'Fragebogen-PDF bereitgestellt'),
(1711, '2026-08-16 15:41:51', 1, 'LIF-00001', 'Lieferanten', 'Fragebogen-PDF bereitgestellt'),
(1712, '2026-08-16 15:42:26', 1, 'LIF-00001', 'Lieferanten', 'Fragebogen als PDF hinterlegt'),
(1713, '2026-08-16 15:43:10', 1, 'LIF-00001', 'Lieferanten', 'geändert'),
(1714, '2026-08-16 17:46:10', 1, '51', 'Lieferanten', 'Fragebogen gelöscht'),
(1715, '2026-08-17 12:48:46', 1, '18', 'Admin', 'Benutzer aktiviert: Wolfgang Schuster G'),
(1716, '2026-08-17 12:49:28', 18, '', 'ISMS', 'Fehlanmeldung (falsches Passwort): wolfschus@gmail.com'),
(1717, '2026-08-17 12:49:39', 18, '', 'ISMS', 'Fehlanmeldung (falsches Passwort): wolfschus@gmail.com'),
(1718, '2026-08-17 12:49:52', 1, '', 'ISMS', 'Login'),
(1719, '2026-08-17 12:51:47', 18, '', 'ISMS', 'Login'),
(1720, '2026-08-17 12:52:18', 1, '', 'ISMS', 'Login'),
(1721, '2026-08-17 12:53:07', 18, '', 'ISMS', 'Login'),
(1722, '2026-08-17 13:39:46', 1, '', 'ISMS', 'Login'),
(1723, '2026-08-18 04:41:14', 1, '', 'ISMS', 'Login'),
(1724, '2026-08-18 04:48:08', 1, '', 'ISMS', 'Login'),
(1725, '2026-08-18 04:49:37', 1, '', 'ISMS', 'Login'),
(1726, '2026-08-18 04:49:49', 18, '', 'ISMS', 'Login (SSO Google)'),
(1727, '2026-08-18 04:50:04', 18, '', 'ISMS', 'Login (SSO Google)'),
(1728, '2026-08-18 05:34:08', 18, '', 'ISMS', 'Login (SSO Google)'),
(1729, '2026-08-18 05:34:52', 1, '', 'ISMS', 'Login'),
(1730, '2026-08-18 08:14:44', 1, 'BPMN-00001', 'Dokumente', 'BPMN-Diagramm gelöscht: Test'),
(1731, '2026-08-19 14:25:53', 1, '', 'ISMS', 'Login'),
(1732, '2026-08-19 14:27:05', 0, '', 'ISMS', 'Login'),
(1733, '2026-08-19 14:27:32', 1, '', 'ISMS', 'Login'),
(1734, '2026-08-19 15:48:18', 0, '', 'ISMS', 'Login'),
(1735, '2026-08-19 15:48:41', 1, '', 'ISMS', 'Login'),
(1736, '2026-08-19 16:01:19', 1, 'TISAX', 'Normen', 'komplett gelöscht (36 Einträge)'),
(1737, '2026-08-21 18:56:17', 1, 'SQL-ALTER', 'SQL-Konsole', '✅ ALTER TABLE schwachstellen DROP COLUMN titel_en, DROP COLUMN beschreibung_en'),
(1738, '2026-08-22 02:27:56', 1, 'WEA-00001', 'Schwachstellen', 'Schwachstelle angelegt: CVE-2026-3055 Netscaler Gateway'),
(1739, '2026-08-22 06:02:04', 1, 'AST-00020', 'Assets', 'geändert'),
(1740, '2026-08-22 06:03:02', 1, 'AST-00004', 'Assets', 'geändert'),
(1741, '2026-08-22 06:04:02', 1, 'AST-00021', 'Assets', 'angelegt'),
(1742, '2026-08-22 06:10:43', 1, 'AST-00021', 'Assets', 'geändert'),
(1743, '2026-08-22 06:13:41', 1, 'AST-00022', 'Assets', 'angelegt'),
(1744, '2026-08-22 06:14:45', 1, 'AST-00023', 'Assets', 'angelegt'),
(1745, '2026-08-22 06:35:52', 1, 'AST-00024', 'Assets', 'angelegt'),
(1746, '2026-08-22 07:18:41', 1, '', 'Schwachstellen', 'KI-Schwachstellenanalyse über 3 Asset(s): 0 Fund(e)'),
(1747, '2026-08-22 07:19:58', 1, '', 'Schwachstellen', 'KI-Schwachstellenanalyse über 3 Asset(s): 2 Fund(e)'),
(1748, '2026-08-22 07:20:18', 1, 'WEA-00002', 'Schwachstellen', 'Schwachstelle per KI angelegt: CVE-2024-3094 – XZ Utils Backdoor'),
(1749, '2026-08-22 07:20:18', 1, 'WEA-00003', 'Schwachstellen', 'Schwachstelle per KI angelegt: CVE-2024-6387 – OpenSSH regreSSHion - Remote Code Execution'),
(1750, '2026-08-22 07:27:57', 1, '', 'Schwachstellen', 'KI-Schwachstellenanalyse über 3 Asset(s): 0 Fund(e)'),
(1751, '2026-08-22 07:47:01', 1, 'WEA-00002', 'Schwachstellen', 'Schwachstelle geändert: CVE-2024-3094 – XZ Utils Backdoor'),
(1752, '2026-08-22 07:47:25', 1, 'WEA-00001', 'Schwachstellen', 'Schwachstelle geändert: CVE-2026-3055 Netscaler Gateway'),
(1753, '2026-08-22 07:49:17', 1, 'MAS-0163', 'Maßnahmen', 'angelegt'),
(1754, '2026-08-22 07:49:17', 1, 'WEA-00002', 'Schwachstellen', 'Maßnahme MAS-0163 angelegt und verknüpft'),
(1755, '2026-08-22 07:49:39', 1, 'MAS-0163', 'Maßnahmen', 'geändert'),
(1756, '2026-08-22 07:52:58', 1, 'AST-00025', 'Assets', 'angelegt'),
(1757, '2026-08-22 09:21:34', 1, '', 'ISMS', 'Login'),
(1758, '2026-08-22 09:21:49', 1, '', 'ISMS', 'Login'),
(1759, '2026-08-22 09:24:36', 1, 'WEA-00004', 'Schwachstellen', 'Schwachstelle angelegt: TEST Claude – <b>Escaping</b> & \"Anführung\"'),
(1760, '2026-08-22 09:25:54', 1, 'MAS-0164', 'Maßnahmen', 'angelegt'),
(1761, '2026-08-22 09:25:54', 1, 'WEA-00004', 'Schwachstellen', 'Maßnahme MAS-0164 angelegt und verknüpft'),
(1762, '2026-08-22 09:29:07', 1, 'WEA-00004', 'Schwachstellen', 'Schwachstelle gelöscht: TEST Claude – <b>Escaping</b> & \"Anführung\"'),
(1763, '2026-08-22 09:31:43', 1, 'MAS-0164', 'Maßnahmen', 'geändert'),
(1764, '2026-08-23 04:39:43', 18, '', 'ISMS', 'Login (SSO Google)'),
(1765, '2026-08-23 04:40:10', 1, '', 'ISMS', 'Login'),
(1766, '2026-08-23 04:40:59', 18, '', 'ISMS', 'Login (SSO Google)'),
(1767, '2026-08-23 04:42:20', 18, 'WEA-00001', 'Schwachstellen', 'Schwachstelle gelöscht: CVE-2026-3055 Netscaler Gateway'),
(1768, '2026-08-23 05:08:01', 1, '', 'ISMS', 'Login'),
(1769, '2026-08-23 05:09:03', 18, '', 'ISMS', 'Login (SSO Google)'),
(1770, '2026-08-23 05:40:08', 18, '', 'ISMS', 'SSO-Einstellungen geändert (Quelle: Datenbank)'),
(1771, '2026-08-23 05:40:16', 18, '', 'ISMS', 'SSO-Einstellungen geändert (Quelle: Datenbank)'),
(1772, '2026-08-23 05:40:28', 18, '', 'ISMS', 'Login (SSO Google)'),
(1773, '2026-08-23 05:44:40', 18, '', 'ISMS', 'Login (SSO Google)'),
(1774, '2026-08-23 06:07:25', 18, '', 'ISMS', 'Login (SSO Google)'),
(1775, '2026-08-23 06:08:47', 18, '', 'ISMS', 'SSO-Einstellungen geändert (Quelle: Datenbank)'),
(1776, '2026-08-23 06:09:03', 23, '', 'ISMS', 'Login (SSO Google)'),
(1777, '2026-08-23 06:09:30', 18, '', 'ISMS', 'Login (SSO Google)'),
(1778, '2026-08-23 06:10:01', 23, '', 'ISMS', 'Login (SSO Google)'),
(1779, '2026-08-23 06:11:32', 23, '', 'ISMS', 'Unternehmensangaben gespeichert: WolfInfoSec Wolfgang Schuster'),
(1780, '2026-08-23 06:11:40', 23, '', 'ISMS', 'Unternehmensangaben gespeichert: WolfInfoSec Wolfgang Schuster'),
(1781, '2026-08-23 06:50:56', 18, '', 'ISMS', 'Login (SSO Google)'),
(1782, '2026-08-24 12:34:08', 23, '', 'ISMS', 'Login (SSO Google)'),
(1783, '2026-08-24 12:34:17', 18, '', 'ISMS', 'Login (SSO Google)'),
(1784, '2026-08-24 12:38:48', 23, '', 'ISMS', 'Login (SSO Google)'),
(1785, '2026-08-24 13:50:50', 23, 'GF', 'Organigramm', 'Abteilung gelöscht'),
(1786, '2026-08-24 13:50:59', 23, 'GL', 'Organigramm', 'Abteilung gelöscht'),
(1787, '2026-08-24 13:51:05', 23, 'Geschäftleitung', 'Organigramm', 'Abteilung gelöscht'),
(1788, '2026-08-24 13:51:12', 23, 'Abteilung', 'Organigramm', 'Abteilung gelöscht'),
(1789, '2026-08-24 13:52:51', 23, 'Admin', 'Admin', 'Abteilung geändert'),
(1790, '2026-08-24 13:52:57', 23, 'DEV', 'Admin', 'Abteilung geändert'),
(1791, '2026-08-24 13:53:03', 23, 'IT', 'Admin', 'Abteilung geändert'),
(1792, '2026-08-24 13:53:09', 23, 'Vertrieb', 'Admin', 'Abteilung geändert'),
(1793, '2026-08-24 13:53:13', 23, 'Verwaltung', 'Admin', 'Abteilung geändert'),
(1794, '2026-08-24 14:44:01', 23, 'Softwareentwicklungsprozess', 'Prozesslandkarte', 'Prozess angelegt'),
(1795, '2026-08-24 14:46:58', 23, 'Informationsmanagementprozess', 'Prozesslandkarte', 'Prozess geändert'),
(1796, '2026-08-24 14:47:05', 23, 'Informationsmanagementprozess', 'Prozesslandkarte', 'Prozess geändert'),
(1797, '2026-08-24 14:47:30', 23, 'Softwareentwicklung', 'Prozesslandkarte', 'Prozess angelegt'),
(1798, '2026-08-24 14:47:56', 23, 'Geschäftsführung', 'Prozesslandkarte', 'Prozess angelegt'),
(1799, '2026-08-24 14:58:00', 23, 'Internes Netz', 'Netzwerkzonen', 'Zone angelegt'),
(1800, '2026-08-26 10:59:26', 23, '', 'ISMS', 'Login (SSO Google)'),
(1801, '2026-08-26 11:51:13', 23, 'MAS-0163', 'Maßnahmen', 'geändert'),
(1802, '2026-08-26 11:52:24', 23, 'MAS-0163', 'Maßnahmen', 'geändert'),
(1803, '2026-08-27 07:40:08', 18, '', 'ISMS', 'Login (SSO Google)'),
(1804, '2026-08-27 08:10:22', 18, 'DOK-00001', 'Dokumente', 'Lesepflicht geändert (11 Rollen)'),
(1805, '2026-08-28 04:22:30', 18, 'AUD-00001', 'Audit', 'Audit angelegt: internet Audit 2026'),
(1806, '2026-08-29 04:55:01', 18, '', 'ISMS', 'Login (SSO Google)'),
(1807, '2026-08-29 05:29:43', 18, '', 'ISMS', 'Login (SSO Google)'),
(1808, '2026-08-29 05:50:13', 18, 'DOK-00015', 'Dokumente', 'KI-Bearbeitung vorgeschlagen'),
(1809, '2026-08-29 06:04:53', 18, 'DOK-00015', 'Dokumente', 'KI-Bearbeitung vorgeschlagen'),
(1810, '2026-08-29 06:13:17', 18, 'DOK-00015', 'Dokumente', 'KI-Bearbeitung vorgeschlagen'),
(1811, '2026-08-29 06:24:33', 18, 'Vertrieb/Marketing', 'Admin', 'Abteilung geändert'),
(1812, '2026-08-29 06:26:26', 18, 'Onboarding-1', 'Personal', 'angelegt: Karlein, Reto'),
(1813, '2026-08-29 06:27:31', 18, 'Onboarding-1', 'Personal', 'geändert: Karlein, Reto'),
(1814, '2026-08-29 07:44:03', 18, '', 'ISMS', 'Unternehmensangaben gespeichert: WolfInfoSec Wolfgang Schuster'),
(1815, '2026-08-29 09:08:25', 18, '', 'ISMS', 'Unternehmensangaben gespeichert: WolfInfoSec Wolfgang Schuster'),
(1816, '2026-08-29 09:59:04', 18, '1', 'Pläne', 'Datei „Netzwerk“ hochgeladen (Netzwerkpläne)'),
(1817, '2026-08-29 09:59:16', 18, '2', 'Pläne', 'Datei „Netzwerk.drawio“ hochgeladen (Netzwerkpläne)'),
(1818, '2026-08-29 10:00:21', 18, '3', 'Pläne', 'Datei „Prozesslandkarte_2026-08-29“ hochgeladen (Prozesse)'),
(1819, '2026-08-30 05:13:38', 23, '', 'ISMS', 'Login (SSO Google)'),
(1820, '2026-08-30 05:13:52', 18, '', 'ISMS', 'Login (SSO Google)'),
(1821, '2026-08-30 06:01:27', 23, '', 'ISMS', 'Login (SSO Google)'),
(1822, '2026-08-30 06:18:22', 23, '', 'ISMS', 'Setup-Assistent: Unternehmensangaben gespeichert: WolfInfoSec Wolfgang Schuster'),
(1823, '2026-08-30 06:19:59', 18, '', 'ISMS', 'Login (SSO Google)'),
(1824, '2026-08-30 06:31:14', 23, '', 'ISMS', 'Login (SSO Google)'),
(1825, '2026-08-30 06:31:44', 23, '', 'ISMS', 'Setup-Assistent: SMTP-Einstellungen gespeichert'),
(1826, '2026-08-30 06:36:13', 18, '', 'ISMS', 'Login (SSO Google)'),
(1827, '2026-08-30 06:37:27', 23, '', 'ISMS', 'Login (SSO Google)'),
(1828, '2026-08-30 06:37:56', 18, '', 'ISMS', 'Login (SSO Google)'),
(1829, '2026-08-30 06:38:30', 18, 'ID 35', 'Admin', 'Rollenzuweisung geändert'),
(1830, '2026-08-30 06:44:38', 18, 'ID 9', 'Admin', 'Rolle gelöscht'),
(1831, '2026-08-30 06:45:23', 18, 'ID 6', 'Admin', 'Rolle gelöscht'),
(1832, '2026-08-30 06:45:30', 18, 'ID 3', 'Admin', 'Rolle gelöscht'),
(1833, '2026-08-30 06:45:36', 18, 'ID 38', 'Admin', 'Rolle gelöscht'),
(1834, '2026-08-30 06:45:41', 18, 'ID 26', 'Admin', 'Rolle gelöscht'),
(1835, '2026-08-30 06:45:45', 18, 'ID 8', 'Admin', 'Rolle gelöscht'),
(1836, '2026-08-30 06:52:22', 18, 'ID 2', 'Admin', 'Abteilung gelöscht'),
(1837, '2026-08-30 06:52:45', 18, 'Entwicklung', 'Admin', 'Abteilung geändert'),
(1838, '2026-08-30 07:02:57', 23, '', 'ISMS', 'Login (SSO Google)'),
(1839, '2026-08-30 07:03:22', 23, 'Geschäftsführung', 'Admin', 'Abteilung angelegt'),
(1840, '2026-08-30 07:03:22', 23, 'Personal', 'Admin', 'Abteilung angelegt'),
(1841, '2026-08-30 07:03:22', 23, 'Einkauf', 'Admin', 'Abteilung angelegt'),
(1842, '2026-08-30 07:03:22', 23, '', 'ISMS', 'Setup-Assistent: 3 Abteilung(en) angelegt'),
(1843, '2026-08-30 07:03:32', 23, '', 'ISMS', 'Setup-Assistent: Schritt rollen uebersprungen'),
(1844, '2026-08-30 07:03:54', 18, '', 'ISMS', 'Login (SSO Google)'),
(1845, '2026-08-30 07:26:07', 18, '', 'ISMS', 'Setup-Assistent: Schritt unternehmen uebersprungen'),
(1846, '2026-08-30 07:36:05', 18, '', 'ISMS', 'Setup-Assistent: SMTP-Einstellungen gespeichert'),
(1847, '2026-08-30 07:36:09', 18, '', 'ISMS', 'Setup-Assistent: SMTP-Einstellungen gespeichert'),
(1848, '2026-08-30 07:36:12', 18, '', 'ISMS', 'Setup-Assistent: SMTP-Einstellungen gespeichert'),
(1849, '2026-08-30 07:36:15', 18, '', 'ISMS', 'Setup-Assistent: SMTP-Einstellungen gespeichert'),
(1850, '2026-08-30 07:36:17', 18, '', 'ISMS', 'Setup-Assistent: SMTP-Einstellungen gespeichert'),
(1851, '2026-08-30 07:36:19', 18, '', 'ISMS', 'Setup-Assistent: SMTP-Einstellungen gespeichert'),
(1852, '2026-08-30 07:36:23', 18, '', 'ISMS', 'Setup-Assistent: SMTP-Einstellungen gespeichert'),
(1853, '2026-08-30 07:36:25', 18, '', 'ISMS', 'Setup-Assistent: SMTP-Einstellungen gespeichert'),
(1854, '2026-08-30 07:43:15', 18, '', 'ISMS', 'Setup-Assistent: 0 Abteilung(en) angelegt'),
(1855, '2026-08-30 07:43:28', 18, '', 'ISMS', 'Setup-Assistent: 0 Abteilung(en) angelegt'),
(1856, '2026-08-30 07:43:46', 18, '', 'ISMS', 'Setup-Assistent: 0 Abteilung(en) angelegt'),
(1857, '2026-08-30 07:43:47', 18, '', 'ISMS', 'Setup-Assistent: 0 Abteilung(en) angelegt'),
(1858, '2026-08-30 07:43:56', 18, '', 'ISMS', 'Setup-Assistent: 0 Abteilung(en) angelegt'),
(1859, '2026-08-30 07:44:02', 18, '', 'ISMS', 'Setup-Assistent: 0 Abteilung(en) angelegt'),
(1860, '2026-08-30 07:44:12', 18, 'Datenschutzbeauftragter', 'Admin', 'Rolle angelegt'),
(1861, '2026-08-30 07:44:12', 18, 'Leitung IT', 'Admin', 'Rolle angelegt'),
(1862, '2026-08-30 07:44:12', 18, 'Leitung HR', 'Admin', 'Rolle angelegt'),
(1863, '2026-08-30 07:44:12', 18, 'Einkauf', 'Admin', 'Rolle angelegt'),
(1864, '2026-08-30 07:44:12', 18, 'Verwaltung', 'Admin', 'Rolle angelegt'),
(1865, '2026-08-30 07:44:12', 18, 'System Manager', 'Admin', 'Rolle angelegt'),
(1866, '2026-08-30 07:44:12', 18, 'Entwickler', 'Admin', 'Rolle angelegt'),
(1867, '2026-08-30 07:44:12', 18, 'Security Manager', 'Admin', 'Rolle angelegt'),
(1868, '2026-08-30 07:44:12', 18, 'Service Desk', 'Admin', 'Rolle angelegt'),
(1869, '2026-08-30 07:44:12', 18, '', 'ISMS', 'Setup-Assistent: 9 Rolle(n) angelegt'),
(1870, '2026-08-30 07:44:17', 18, '', 'ISMS', 'Setup-Assistent: 0 Rolle(n) angelegt'),
(1871, '2026-08-30 07:55:14', 23, '', 'ISMS', 'Login (SSO Google)'),
(1872, '2026-08-30 07:55:29', 23, '', 'ISMS', 'Setup-Assistent: Risikoappetit gesetzt (ausgewogen)'),
(1873, '2026-08-30 07:55:33', 23, '', 'ISMS', 'Setup-Assistent: Risikoschwellen gespeichert'),
(1874, '2026-08-30 07:55:59', 23, '', 'ISMS', 'Setup-Assistent: Risikoappetit gesetzt (ausgewogen)'),
(1875, '2026-08-30 07:56:09', 23, '', 'ISMS', 'Setup-Assistent: Risikoappetit gesetzt (ausgewogen)'),
(1876, '2026-08-30 07:59:13', 23, '', 'ISMS', 'Setup-Assistent: Risikoappetit gesetzt (ausgewogen)'),
(1877, '2026-08-30 08:10:09', 18, '', 'ISMS', 'Login (SSO Google)'),
(1878, '2026-08-30 08:20:06', 23, '', 'ISMS', 'Login (SSO Google)'),
(1879, '2026-08-30 08:20:47', 23, 'Unternehmensführung', 'Prozesslandkarte', 'Prozess angelegt'),
(1880, '2026-08-30 08:20:47', 23, 'Strategie und Planung', 'Prozesslandkarte', 'Prozess angelegt'),
(1881, '2026-08-30 08:20:47', 23, 'Informationssicherheitsmanagement', 'Prozesslandkarte', 'Prozess angelegt'),
(1882, '2026-08-30 08:20:47', 23, 'Risikomanagement', 'Prozesslandkarte', 'Prozess angelegt'),
(1883, '2026-08-30 08:20:47', 23, 'Compliance und Recht', 'Prozesslandkarte', 'Prozess angelegt'),
(1884, '2026-08-30 08:20:47', 23, 'Interne Audits', 'Prozesslandkarte', 'Prozess angelegt'),
(1885, '2026-08-30 08:20:47', 23, '', 'ISMS', 'Setup-Assistent: 6 Prozess(e) angelegt'),
(1886, '2026-08-30 08:20:53', 23, 'Vertrieb', 'Prozesslandkarte', 'Prozess angelegt'),
(1887, '2026-08-30 08:20:53', 23, 'Angebot und Auftrag', 'Prozesslandkarte', 'Prozess angelegt'),
(1888, '2026-08-30 08:20:53', 23, 'Entwicklung', 'Prozesslandkarte', 'Prozess angelegt'),
(1889, '2026-08-30 08:20:53', 23, 'Produktion / Leistungserbringung', 'Prozesslandkarte', 'Prozess angelegt'),
(1890, '2026-08-30 08:20:53', 23, 'Beschaffung', 'Prozesslandkarte', 'Prozess angelegt'),
(1891, '2026-08-30 08:20:53', 23, 'Auslieferung und Service', 'Prozesslandkarte', 'Prozess angelegt'),
(1892, '2026-08-30 08:20:53', 23, 'Kundenbetreuung', 'Prozesslandkarte', 'Prozess angelegt'),
(1893, '2026-08-30 08:20:53', 23, '', 'ISMS', 'Setup-Assistent: 7 Prozess(e) angelegt'),
(1894, '2026-08-30 08:21:02', 23, 'IT-Betrieb', 'Prozesslandkarte', 'Prozess angelegt'),
(1895, '2026-08-30 08:21:02', 23, 'Personal', 'Prozesslandkarte', 'Prozess angelegt'),
(1896, '2026-08-30 08:21:02', 23, 'Finanzen und Buchhaltung', 'Prozesslandkarte', 'Prozess angelegt'),
(1897, '2026-08-30 08:21:02', 23, 'Facility Management', 'Prozesslandkarte', 'Prozess angelegt'),
(1898, '2026-08-30 08:21:02', 23, 'Qualitätsmanagement', 'Prozesslandkarte', 'Prozess angelegt'),
(1899, '2026-08-30 08:21:02', 23, 'Schulung und Awareness', 'Prozesslandkarte', 'Prozess angelegt'),
(1900, '2026-08-30 08:21:02', 23, '', 'ISMS', 'Setup-Assistent: 6 Prozess(e) angelegt'),
(1901, '2026-08-30 08:27:22', 23, '', 'ISMS', 'Setup-Assistent: Unternehmensziele gespeichert'),
(1902, '2026-08-30 09:58:07', 18, '', 'ISMS', 'Login (SSO Google)'),
(1903, '2026-08-30 15:33:09', 18, 'BSI Grundschutz++', 'Normen', 'komplett gelöscht (650 Einträge)'),
(1904, '2026-08-30 15:33:19', 18, 'BSI IT-Grundschutz (Edition 2023)', 'Normen', 'komplett gelöscht (4170 Einträge)'),
(1905, '2026-08-30 17:33:06', 18, 'CRA', 'Normen', 'komplett gelöscht (20 Einträge)'),
(1906, '2026-08-30 17:33:12', 18, 'CISIS12', 'Normen', 'komplett gelöscht (65 Einträge)'),
(1907, '2026-08-30 17:33:18', 18, 'Cyber Essentials', 'Normen', 'komplett gelöscht (45 Einträge)'),
(1908, '2026-08-30 17:33:26', 18, 'VDA ISA', 'Normen', 'komplett gelöscht (53 Einträge)'),
(1909, '2026-08-30 17:33:30', 18, 'VdS-10000', 'Normen', 'komplett gelöscht (28 Einträge)'),
(1910, '2026-08-30 17:36:16', 23, '', 'ISMS', 'Login (SSO Google)'),
(1911, '2026-08-30 17:36:38', 18, '', 'ISMS', 'Login (SSO Google)'),
(1912, '2026-08-30 17:37:51', 18, 'DOK-00001', 'Dokumente', 'Lesepflicht geändert (14 Rollen)'),
(1913, '2026-08-30 17:51:59', 18, 'AUD-00002', 'Audit', 'Audit angelegt: GAP-Assessment'),
(1914, '2026-08-30 17:52:17', 18, 'AUD-00002', 'Audit', 'Prüfliste aufgebaut: 115 Anforderung(en) aus ISO/IEC 27001:2022'),
(1915, '2026-08-31 03:22:33', 23, '', 'ISMS', 'Login (SSO Google)'),
(1916, '2026-08-31 15:40:36', 23, '', 'ISMS', 'Login (SSO Google)'),
(1917, '2026-09-01 03:05:18', 23, '', 'ISMS', 'Login (SSO Google)'),
(1918, '2026-09-02 11:22:36', 18, '', 'ISMS', 'Login (SSO Google)'),
(1919, '2026-09-02 11:32:40', 23, '', 'ISMS', 'Login (SSO Google)'),
(1920, '2026-09-02 11:46:27', 18, '', 'ISMS', 'Login (SSO Google)'),
(1921, '2026-09-02 13:38:11', 18, 'DOK-00031', 'Dokumente', 'geändert'),
(1922, '2026-09-03 02:12:18', 18, 'AST-00017', 'Assets', 'Schutzbedarf von AST-00018 geerbt: Wert niedrig→normal'),
(1923, '2026-09-03 02:12:18', 18, 'AST-00008', 'Assets', 'Schutzbedarf von AST-00018 geerbt: Vertraulichkeit niedrig→normal, Integrität niedrig→normal, Authentizität niedrig→normal, Wert niedrig→normal'),
(1924, '2026-09-03 02:12:18', 18, 'AST-00001', 'Assets', 'Schutzbedarf von AST-00018 geerbt: Authentizität –→normal, Wert –→normal'),
(1925, '2026-09-03 18:02:18', 23, '', 'ISMS', 'Login (SSO Google)'),
(1926, '2026-09-03 18:53:15', 18, '', 'ISMS', 'Login (SSO Google)'),
(1927, '2026-09-04 00:18:01', 18, 'DOK-0037', 'Dokumente', 'angelegt (Risikobehandlungsplan)'),
(1928, '2026-09-04 00:23:54', 18, 'ABW-00001', 'Audit', 'Abweichung angelegt: test'),
(1929, '2026-09-04 00:24:13', 18, 'MAS-0165', 'Maßnahmen', 'angelegt'),
(1930, '2026-09-04 00:24:13', 18, 'ABW-00001', 'Audit', 'Maßnahme MAS-0165 angelegt und verknüpft'),
(1931, '2026-09-04 00:24:26', 18, 'MAS-0165', 'Maßnahmen', 'geändert'),
(1932, '2026-09-04 00:45:43', 23, '', 'ISMS', 'Login (SSO Google)'),
(1933, '2026-09-04 00:49:53', 23, 'DOK-00003', 'Dokumente', 'Lesepflicht geändert (1 Rollen)'),
(1934, '2026-09-04 00:49:53', 23, 'DOK-00004', 'Dokumente', 'Lesepflicht geändert (1 Rollen)'),
(1935, '2026-09-04 00:49:53', 23, 'DOK-00005', 'Dokumente', 'Lesepflicht geändert (1 Rollen)'),
(1936, '2026-09-04 00:49:53', 23, 'DOK-00006', 'Dokumente', 'Lesepflicht geändert (1 Rollen)'),
(1937, '2026-09-04 00:49:53', 23, 'DOK-00007', 'Dokumente', 'Lesepflicht geändert (1 Rollen)'),
(1938, '2026-09-04 00:49:53', 23, 'DOK-00008', 'Dokumente', 'Lesepflicht geändert (1 Rollen)'),
(1939, '2026-09-04 00:49:53', 23, 'DOK-00009', 'Dokumente', 'Lesepflicht geändert (1 Rollen)'),
(1940, '2026-09-04 00:49:53', 23, 'DOK-00012', 'Dokumente', 'Lesepflicht geändert (1 Rollen)'),
(1941, '2026-09-04 00:50:37', 23, 'DOK-00003', 'Dokumente', 'Lesepflicht geändert (2 Rollen)'),
(1942, '2026-09-04 00:50:47', 18, '', 'ISMS', 'Login (SSO Google)'),
(1943, '2026-09-04 00:51:21', 23, '', 'ISMS', 'Login (SSO Google)'),
(1944, '2026-09-04 00:55:50', 23, '', 'ISMS', 'Setup-Assistent: 0 Prozess(e) angelegt'),
(1945, '2026-09-04 00:56:02', 23, '', 'ISMS', 'Setup-Assistent: 0 Prozess(e) angelegt'),
(1946, '2026-09-04 06:02:33', 18, 'DOK-00038', 'Dokumente', 'angelegt'),
(1947, '2026-09-04 06:03:19', 18, 'DOK-00038', 'Dokumente', 'KI-Bearbeitung vorgeschlagen'),
(1948, '2026-09-04 06:03:35', 18, 'DOK-00038', 'Dokumente', 'KI-Bearbeitung übernommen'),
(1949, '2026-09-04 07:12:27', 18, 'CHG-00001', 'Changes', 'Change angelegt: Update proxmox'),
(1950, '2026-09-04 07:13:40', 18, 'CHG-00001', 'Changes', 'Change geändert: Update proxmox'),
(1951, '2026-09-04 13:19:04', 18, '', 'ISMS', 'Setup-Assistent: 0 Abteilung(en) angelegt'),
(1952, '2026-09-04 17:02:38', 18, '', 'ISMS', 'Setup-Assistent: KI-Einstellung ki_enabled gespeichert'),
(1953, '2026-09-04 17:02:40', 18, '', 'ISMS', 'Setup-Assistent: KI-Einstellung ki_provider gespeichert'),
(1954, '2026-09-04 17:02:42', 18, '', 'ISMS', 'Setup-Assistent: KI-Einstellung ki_model gespeichert'),
(1955, '2026-09-04 17:02:48', 18, '', 'ISMS', 'Setup-Assistent: KI-Einstellung ki_api_key gespeichert'),
(1956, '2026-09-04 17:02:49', 18, '', 'ISMS', 'Setup-Assistent: KI-Verbindungstest erfolgreich'),
(1957, '2026-09-04 17:03:02', 18, '', 'ISMS', 'Setup-Assistent: KI-Einstellung ki_api_key gespeichert'),
(1958, '2026-09-04 17:03:27', 18, '', 'ISMS', 'Setup-Assistent: KI-Einstellung ki_enabled gespeichert'),
(1959, '2026-09-04 17:03:30', 18, '', 'ISMS', 'Setup-Assistent: KI-Einstellung ki_provider gespeichert'),
(1960, '2026-09-04 17:03:34', 18, '', 'ISMS', 'Setup-Assistent: KI-Einstellung ki_model gespeichert'),
(1961, '2026-09-04 17:03:35', 18, '', 'ISMS', 'Setup-Assistent: KI-Einstellung ki_api_key gespeichert'),
(1962, '2026-09-04 17:03:37', 18, '', 'ISMS', 'Setup-Assistent: KI-Verbindungstest erfolgreich'),
(1963, '2026-09-04 17:04:13', 18, '', 'ISMS', 'Setup-Assistent: KI-Einstellung ki_api_key gespeichert'),
(1964, '2026-09-04 17:04:15', 18, '', 'ISMS', 'Setup-Assistent: KI-Verbindungstest erfolgreich'),
(1965, '2026-09-04 17:04:23', 18, '', 'ISMS', 'Setup-Assistent: KI-Einstellung ki_api_key gespeichert'),
(1966, '2026-09-04 17:05:40', 18, '', 'ISMS', 'Setup-Assistent: KI-Einstellung ki_enabled gespeichert'),
(1967, '2026-09-04 17:05:42', 18, '', 'ISMS', 'Setup-Assistent: KI-Einstellung ki_provider gespeichert'),
(1968, '2026-09-04 17:05:43', 18, '', 'ISMS', 'Setup-Assistent: KI-Einstellung ki_model gespeichert'),
(1969, '2026-09-04 17:05:45', 18, '', 'ISMS', 'Setup-Assistent: KI-Einstellung ki_api_key gespeichert'),
(1970, '2026-09-04 17:05:46', 18, '', 'ISMS', 'Setup-Assistent: KI-Verbindungstest erfolgreich'),
(1971, '2026-09-04 17:07:53', 18, '', 'ISMS', 'Setup-Assistent: KI-Einstellung ki_api_key gespeichert'),
(1972, '2026-09-04 17:07:54', 18, '', 'ISMS', 'Setup-Assistent: KI-Verbindungstest erfolgreich'),
(1973, '2026-09-04 17:07:57', 18, '', 'ISMS', 'Setup-Assistent: KI-Einstellung ki_api_key gespeichert'),
(1974, '2026-09-04 17:18:25', 18, '', 'ISMS', 'Setup-Assistent: 6 KI-Vorschlaege (Abteilungen)'),
(1975, '2026-09-04 17:19:09', 18, 'Kundenservice/Support', 'Admin', 'Abteilung angelegt'),
(1976, '2026-09-04 17:19:09', 18, 'Produktmanagement', 'Admin', 'Abteilung angelegt'),
(1977, '2026-09-04 17:19:09', 18, '', 'ISMS', 'Setup-Assistent: 2 Abteilung(en) angelegt'),
(1978, '2026-09-04 17:19:30', 18, '', 'ISMS', 'Setup-Assistent: 6 KI-Vorschlaege (Prozesse fuehrung)'),
(1979, '2026-09-04 17:19:47', 18, '', 'ISMS', 'Setup-Assistent: 9 KI-Vorschlaege (Prozesse kern)'),
(1980, '2026-09-04 17:19:59', 18, '', 'ISMS', 'Setup-Assistent: 9 KI-Vorschlaege (Rollen)'),
(1981, '2026-09-04 17:32:50', 18, '', 'ISMS', 'Setup-Assistent: 12 KI-Vorschlaege (Assets)'),
(1982, '2026-09-04 17:34:22', 18, '', 'ISMS', 'Setup-Assistent: 12 KI-Vorschlaege (Assets)'),
(1983, '2026-09-04 17:39:45', 18, '', 'ISMS', 'Setup-Assistent: 12 KI-Vorschlaege (Risiken)'),
(1984, '2026-09-04 17:48:28', 18, '', 'ISMS', 'Setup-Assistent: 12 KI-Vorschlaege (Massnahmen)'),
(1985, '2026-09-04 17:57:40', 18, '', 'ISMS', 'Setup-Assistent: 12 KI-Vorschlaege (Dokumente)'),
(1986, '2026-09-04 18:04:33', 18, '', 'ISMS', 'Setup-Assistent: 12 KI-Vorschlaege (Lieferanten)'),
(1987, '2026-09-05 07:24:40', 18, '', 'ISMS', 'Setup-Assistent: Unternehmensziele gespeichert'),
(1988, '2026-09-05 07:24:51', 18, '', 'ISMS', 'Setup-Assistent: Risikoappetit gesetzt (ausgewogen)'),
(1989, '2026-09-05 07:25:18', 18, '', 'ISMS', 'Setup-Assistent: Risikoappetit gesetzt (ausgewogen)'),
(1990, '2026-09-05 07:25:24', 18, '', 'ISMS', 'Setup-Assistent: 0 Abteilung(en) angelegt'),
(1991, '2026-09-05 07:26:06', 18, '', 'ISMS', 'Setup-Assistent: 7 KI-Vorschlaege (Abteilungen)'),
(1992, '2026-09-05 07:26:19', 18, '', 'ISMS', 'Setup-Assistent: 4 KI-Vorschlaege (Abteilungen)'),
(1993, '2026-09-05 07:26:35', 18, '', 'ISMS', 'Setup-Assistent: 6 KI-Vorschlaege (Abteilungen)'),
(1994, '2026-09-05 07:26:53', 18, 'IT', 'Admin', 'Abteilung angelegt'),
(1995, '2026-09-05 07:26:53', 18, 'Personal', 'Admin', 'Abteilung angelegt'),
(1996, '2026-09-05 07:26:53', 18, 'Einkauf', 'Admin', 'Abteilung angelegt'),
(1997, '2026-09-05 07:26:53', 18, 'Verwaltung', 'Admin', 'Abteilung angelegt'),
(1998, '2026-09-05 07:26:53', 18, 'Entwicklung', 'Admin', 'Abteilung angelegt'),
(1999, '2026-09-05 07:26:53', 18, 'Buchhaltung', 'Admin', 'Abteilung angelegt'),
(2000, '2026-09-05 07:26:53', 18, 'Marketing', 'Admin', 'Abteilung angelegt'),
(2001, '2026-09-05 07:26:53', 18, 'Kundenservice', 'Admin', 'Abteilung angelegt'),
(2002, '2026-09-05 07:26:53', 18, 'Qualitätsmanagement', 'Admin', 'Abteilung angelegt'),
(2003, '2026-09-05 07:26:53', 18, 'Consulting', 'Admin', 'Abteilung angelegt'),
(2004, '2026-09-05 07:26:53', 18, 'Projektmanagement', 'Admin', 'Abteilung angelegt'),
(2005, '2026-09-05 07:26:53', 18, '', 'ISMS', 'Setup-Assistent: 11 Abteilung(en) angelegt'),
(2006, '2026-09-05 07:27:04', 18, '', 'ISMS', 'Setup-Assistent: 0 Abteilung(en) angelegt'),
(2007, '2026-09-05 07:27:25', 18, '', 'ISMS', 'Setup-Assistent: 8 KI-Vorschlaege (Prozesse kern)'),
(2008, '2026-09-05 07:27:39', 18, 'Produktmanagement', 'Prozesslandkarte', 'Prozess angelegt'),
(2009, '2026-09-05 07:27:39', 18, '', 'ISMS', 'Setup-Assistent: 1 Prozess(e) angelegt'),
(2010, '2026-09-05 07:27:48', 18, '', 'ISMS', 'Setup-Assistent: 0 Prozess(e) angelegt'),
(2011, '2026-09-05 07:27:51', 18, '', 'ISMS', 'Setup-Assistent: 0 Prozess(e) angelegt'),
(2012, '2026-09-05 07:27:58', 18, '', 'ISMS', 'Setup-Assistent: 0 Prozess(e) angelegt'),
(2013, '2026-09-05 07:28:01', 18, '', 'ISMS', 'Setup-Assistent: 0 Prozess(e) angelegt'),
(2014, '2026-09-05 07:28:04', 18, '', 'ISMS', 'Setup-Assistent: 0 Prozess(e) angelegt'),
(2015, '2026-09-05 07:28:20', 18, '', 'ISMS', 'Setup-Assistent: 8 KI-Vorschlaege (Rollen)'),
(2016, '2026-09-05 07:28:31', 18, 'Informationssicherheitsbeauftragter (ISB)', 'Admin', 'Rolle angelegt'),
(2017, '2026-09-05 07:28:31', 18, '', 'ISMS', 'Setup-Assistent: 1 Rolle(n) angelegt'),
(2018, '2026-09-05 07:28:35', 18, '', 'ISMS', 'Setup-Assistent: 0 Rolle(n) angelegt'),
(2019, '2026-09-05 07:28:56', 18, '', 'ISMS', 'Setup-Assistent: 12 KI-Vorschlaege (Dokumente)'),
(2020, '2026-09-05 07:32:25', 18, '', 'Dokumente', 'Dokument angelegt: Informationssicherheitsleitlinie'),
(2021, '2026-09-05 07:32:25', 18, '', 'Dokumente', 'Dokument angelegt: Anwendungsbereich des ISMS (Scope)'),
(2022, '2026-09-05 07:32:25', 18, '', 'Dokumente', 'Dokument angelegt: Verfahren zum Risikomanagement'),
(2023, '2026-09-05 07:32:25', 18, '', 'Dokumente', 'Dokument angelegt: Statement of Applicability (SoA)'),
(2024, '2026-09-05 07:32:25', 18, '', 'Dokumente', 'Dokument angelegt: Richtlinie zur Zugriffssteuerung'),
(2025, '2026-09-05 07:32:25', 18, '', 'Dokumente', 'Dokument angelegt: Passwort- und Authentifizierungsrichtlinie'),
(2026, '2026-09-05 07:32:25', 18, '', 'Dokumente', 'Dokument angelegt: Richtlinie zur Nutzung mobiler Geräte'),
(2027, '2026-09-05 07:32:25', 18, '', 'Dokumente', 'Dokument angelegt: Verfahren zur Behandlung von Sicherheitsvorfällen'),
(2028, '2026-09-05 07:32:25', 18, '', 'Dokumente', 'Dokument angelegt: Verfahren für Datensicherung und Wiederherstellung'),
(2029, '2026-09-05 07:32:25', 18, '', 'Dokumente', 'Dokument angelegt: Notfall- und Wiederanlaufplan'),
(2030, '2026-09-05 07:32:25', 18, '', 'Dokumente', 'Dokument angelegt: Richtlinie für Lieferanten und Dienstleister'),
(2031, '2026-09-05 07:32:25', 18, '', 'Dokumente', 'Dokument angelegt: Verfahren für interne Audits'),
(2032, '2026-09-05 07:32:25', 18, '', 'Dokumente', 'Dokument angelegt: Verfahren für die Managementbewertung'),
(2033, '2026-09-05 07:32:25', 18, '', 'Dokumente', 'Dokument angelegt: Schulungs- und Awareness-Konzept'),
(2034, '2026-09-05 07:32:25', 18, '', 'Dokumente', 'Dokument angelegt: Verfahren zur Lenkung dokumentierter Informationen'),
(2035, '2026-09-05 07:32:25', 18, '', 'Dokumente', 'Dokument angelegt: Risikobehandlungsplan'),
(2036, '2026-09-05 07:32:25', 18, '', 'Dokumente', 'Dokument angelegt: Verzeichnis der Informationswerte (Asset-Inventar)'),
(2037, '2026-09-05 07:32:25', 18, '', 'Dokumente', 'Dokument angelegt: Richtlinie zur Klassifizierung von Informationen'),
(2038, '2026-09-05 07:32:25', 18, '', 'Dokumente', 'Dokument angelegt: Richtlinie zur sicheren Softwareentwicklung'),
(2039, '2026-09-05 07:32:25', 18, '', 'Dokumente', 'Dokument angelegt: Richtlinie zum Änderungsmanagement'),
(2040, '2026-09-05 07:32:25', 18, '', 'Dokumente', 'Dokument angelegt: Verfahren zur Überwachung und Protokollierung'),
(2041, '2026-09-05 07:32:25', 18, '', 'Dokumente', 'Dokument angelegt: Richtlinie zur Nutzung kryptographischer Maßnahmen'),
(2042, '2026-09-05 07:32:25', 18, '', 'Dokumente', 'Dokument angelegt: Richtlinie zur Netzwerksicherheit'),
(2043, '2026-09-05 07:32:25', 18, '', 'Dokumente', 'Dokument angelegt: Verzeichnis von Verarbeitungstätigkeiten'),
(2044, '2026-09-05 07:32:25', 18, '', 'Dokumente', 'Dokument angelegt: Auftragsverarbeitungsverträge (Mustervertrag)'),
(2045, '2026-09-05 07:32:25', 18, '', 'Dokumente', 'Dokument angelegt: Verfahren zur Meldung an Aufsichtsbehörden'),
(2046, '2026-09-05 07:32:25', 18, '', 'Dokumente', 'Dokument angelegt: Rollen- und Verantwortlichkeitsmatrix'),
(2047, '2026-09-05 07:32:25', 18, '', 'ISMS', 'Setup-Assistent: 27 Dokument(e) angelegt'),
(2048, '2026-09-05 07:32:32', 18, '', 'ISMS', 'Setup-Assistent: 12 KI-Vorschlaege (Assets)'),
(2049, '2026-09-05 07:32:52', 18, '', 'Assets', 'Asset angelegt: ISMS-Software Quellcode'),
(2050, '2026-09-05 07:32:52', 18, '', 'Assets', 'Asset angelegt: Kundendatenbank'),
(2051, '2026-09-05 07:32:52', 18, '', 'Assets', 'Asset angelegt: Entwicklungsserver'),
(2052, '2026-09-05 07:32:52', 18, '', 'Assets', 'Asset angelegt: Produktivserver SaaS-Plattform'),
(2053, '2026-09-05 07:32:52', 18, '', 'Assets', 'Asset angelegt: Cloud-Hosting-Umgebung'),
(2054, '2026-09-05 07:32:52', 18, '', 'Assets', 'Asset angelegt: Code-Repository'),
(2055, '2026-09-05 07:32:52', 18, '', 'Assets', 'Asset angelegt: Buchhaltungssystem'),
(2056, '2026-09-05 07:32:52', 18, '', 'Assets', 'Asset angelegt: E-Mail-System'),
(2057, '2026-09-05 07:32:52', 18, '', 'Assets', 'Asset angelegt: Videokonferenz-Dienst'),
(2058, '2026-09-05 07:32:52', 18, '', 'Assets', 'Asset angelegt: Kundendokumentation und Beratungsunterlagen'),
(2059, '2026-09-05 07:32:52', 18, '', 'Assets', 'Asset angelegt: Büroräume Hauptsitz'),
(2060, '2026-09-05 07:32:52', 18, '', 'Assets', 'Asset angelegt: Arbeitsgeräte Mitarbeiter'),
(2061, '2026-09-05 07:32:52', 18, '', 'ISMS', 'Setup-Assistent: 12 Asset(s) angelegt'),
(2062, '2026-09-05 07:33:03', 18, '', 'ISMS', 'Setup-Assistent: 12 KI-Vorschlaege (Lieferanten)'),
(2063, '2026-09-05 07:33:14', 18, '', 'Lieferanten', 'Lieferant angelegt: Cloud-Hosting-Anbieter'),
(2064, '2026-09-05 07:33:14', 18, '', 'Lieferanten', 'Lieferant angelegt: Code-Repository-Plattform'),
(2065, '2026-09-05 07:33:14', 18, '', 'Lieferanten', 'Lieferant angelegt: Videokonferenz-Anbieter'),
(2066, '2026-09-05 07:33:14', 18, '', 'Lieferanten', 'Lieferant angelegt: E-Mail-Hosting-Dienst'),
(2067, '2026-09-05 07:33:14', 18, '', 'Lieferanten', 'Lieferant angelegt: Steuerberater'),
(2068, '2026-09-05 07:33:14', 18, '', 'Lieferanten', 'Lieferant angelegt: Rechtsanwalt'),
(2069, '2026-09-05 07:33:14', 18, '', 'Lieferanten', 'Lieferant angelegt: Datenschutzbeauftragter extern'),
(2070, '2026-09-05 07:33:14', 18, '', 'Lieferanten', 'Lieferant angelegt: Cyber-Versicherung'),
(2071, '2026-09-05 07:33:14', 18, '', 'Lieferanten', 'Lieferant angelegt: Zahlungsdienstleister'),
(2072, '2026-09-05 07:33:14', 18, '', 'Lieferanten', 'Lieferant angelegt: Backup-Service-Anbieter'),
(2073, '2026-09-05 07:33:14', 18, '', 'Lieferanten', 'Lieferant angelegt: Penetrationtest-Dienstleister'),
(2074, '2026-09-05 07:33:14', 18, '', 'Lieferanten', 'Lieferant angelegt: SSL-Zertifikatsanbieter'),
(2075, '2026-09-05 07:33:14', 18, '', 'ISMS', 'Setup-Assistent: 12 Lieferant(en) angelegt'),
(2076, '2026-09-05 07:33:24', 18, '', 'ISMS', 'Setup-Assistent: 12 KI-Vorschlaege (Risiken)'),
(2077, '2026-09-05 07:33:43', 18, '', 'Risiko', 'Risiko angelegt: Unbefugter Zugriff auf Arbeitsgeräte durch Verlust oder Diebstahl mobiler Endgeräte'),
(2078, '2026-09-05 07:33:43', 18, '', 'Risiko', 'Risiko angelegt: Manipulation oder Fehlbuchungen im Buchhaltungssystem durch unzureichende Zugriffskontrollen'),
(2079, '2026-09-05 07:33:43', 18, '', 'Risiko', 'Risiko angelegt: Einbruch oder Wasserschaden in den Büroräumen am Hauptsitz'),
(2080, '2026-09-05 07:33:43', 18, '', 'Risiko', 'Risiko angelegt: Ausfall oder Datenverlust in der Cloud-Hosting-Umgebung durch Providerstörung'),
(2081, '2026-09-05 07:33:43', 18, '', 'Risiko', 'Risiko angelegt: Unautorisierte Codeänderungen oder Löschung im Code-Repository'),
(2082, '2026-09-05 07:33:43', 18, '', 'Risiko', 'Risiko angelegt: Kompromittierung des E-Mail-Systems durch Phishing-Angriffe auf Mitarbeiter'),
(2083, '2026-09-05 07:33:43', 18, '', 'Risiko', 'Risiko angelegt: Sicherheitslücken auf Entwicklungsservern ermöglichen Zugriff auf Produktivsysteme'),
(2084, '2026-09-05 07:33:43', 18, '', 'Risiko', 'Risiko angelegt: Diebstahl oder Leak des ISMS-Software Quellcodes gefährdet Wettbewerbsvorteil'),
(2085, '2026-09-05 07:33:43', 18, '', 'Risiko', 'Risiko angelegt: Datenschutzverletzung durch unbefugten Zugriff auf die Kundendatenbank'),
(2086, '2026-09-05 07:33:43', 18, '', 'Risiko', 'Risiko angelegt: Verlust vertraulicher Kundendokumentation und Beratungsunterlagen'),
(2087, '2026-09-05 07:33:43', 18, '', 'Risiko', 'Risiko angelegt: Ausfall der Produktivserver unterbricht SaaS-Plattform und schädigt Kundenvertrauen'),
(2088, '2026-09-05 07:33:43', 18, '', 'Risiko', 'Risiko angelegt: Abhören vertraulicher Gespräche durch unsichere Nutzung des Videokonferenz-Dienstes'),
(2089, '2026-09-05 07:33:43', 18, '', 'ISMS', 'Setup-Assistent: 12 Risiko/Risiken angelegt'),
(2090, '2026-09-05 07:33:52', 18, '', 'ISMS', 'Setup-Assistent: 12 KI-Vorschlaege (Massnahmen)'),
(2091, '2026-09-05 07:34:05', 18, '', 'Maßnahmen', 'angelegt: Passwortgeschützte Warteräume und Ende-zu-Ende-Verschlüsselung für Videokonferenzen'),
(2092, '2026-09-05 07:34:05', 18, '', 'Maßnahmen', 'angelegt: Hochverfügbarkeitscluster mit automatischem Failover für Produktivserver'),
(2093, '2026-09-05 07:34:05', 18, '', 'Maßnahmen', 'angelegt: Multi-Cloud-Backup-Strategie mit geografisch getrennten Rechenzentren'),
(2094, '2026-09-05 07:34:05', 18, '', 'Maßnahmen', 'angelegt: Rollenbasierte Zugriffskontrollen und Verschlüsselung der Kundendatenbank'),
(2095, '2026-09-05 07:34:05', 18, '', 'Maßnahmen', 'angelegt: Private Repository mit Branch-Protection und Code-Signing'),
(2096, '2026-09-05 07:34:05', 18, '', 'Maßnahmen', 'angelegt: Zutrittskontrollsystem und Wasserschutzsensoren für Büroräume'),
(2097, '2026-09-05 07:34:05', 18, '', 'Maßnahmen', 'angelegt: Security-Awareness-Training und E-Mail-Filterung mit Phishing-Erkennung'),
(2098, '2026-09-05 07:34:05', 18, '', 'Maßnahmen', 'angelegt: Vier-Augen-Prinzip und Protokollierung im Buchhaltungssystem'),
(2099, '2026-09-05 07:34:05', 18, '', 'Maßnahmen', 'angelegt: Netzwerksegmentierung zwischen Entwicklungs- und Produktivumgebung'),
(2100, '2026-09-05 07:34:05', 18, '', 'Maßnahmen', 'angelegt: Commit-Signierung und verpflichtende Code-Reviews im Repository'),
(2101, '2026-09-05 07:34:05', 18, '', 'Maßnahmen', 'angelegt: Mobile-Device-Management mit Fernlöschung und Festplattenverschlüsselung'),
(2102, '2026-09-05 07:34:05', 18, '', 'Maßnahmen', 'angelegt: Auftragsverarbeitungsvertrag mit Cloud-Provider inklusive SLA-Garantien'),
(2103, '2026-09-05 07:34:05', 18, '', 'ISMS', 'Setup-Assistent: 12 Massnahme(n) angelegt'),
(2104, '2026-09-05 07:36:28', 18, 'DOK-00028', 'Dokumente', 'angelegt'),
(2105, '2026-09-05 07:43:06', 18, 'DOK-00001', 'Dokumente', 'geändert'),
(2106, '2026-09-05 07:43:56', 18, 'DOK-00001', 'Dokumente', 'KI-Bearbeitung vorgeschlagen'),
(2107, '2026-09-05 07:44:00', 18, 'DOK-00001', 'Dokumente', 'KI-Bearbeitung übernommen'),
(2108, '2026-09-05 07:48:40', 18, 'DOK-00002', 'Dokumente', 'KI-Bearbeitung vorgeschlagen'),
(2109, '2026-09-05 07:49:12', 18, 'DOK-00002', 'Dokumente', 'KI-Bearbeitung übernommen'),
(2110, '2026-09-05 08:35:37', 23, '', 'ISMS', 'Login (SSO Google)'),
(2111, '2026-09-07 06:02:56', 18, '', 'ISMS', 'Login (SSO Google)');
INSERT INTO `activities` (`id`, `datumuhrzeit`, `user`, `nummer`, `bereich`, `was`) VALUES
(2112, '2026-09-07 10:25:26', 18, '', 'ISMS', 'Login (SSO Google)'),
(2113, '2026-09-07 13:36:20', 0, '', 'ISMS', 'Fehlanmeldung (Benutzer nicht gefunden): alexander.thiel1@gmail.com'),
(2114, '2026-09-07 13:37:37', 0, '', 'ISMS', 'Passwort vergessen: unbekannte E-Mail-Adresse: alexander.thiel1@gmail.com'),
(2115, '2026-09-07 13:39:07', 18, '29', 'Admin', 'Passwort neu gesetzt: Hock, Alexander'),
(2116, '2026-09-07 13:39:55', 0, '', 'ISMS', 'Fehlanmeldung (Benutzer nicht gefunden): alexander.thiel1@gmail.com'),
(2117, '2026-09-07 13:40:32', 29, '', 'ISMS', 'Login'),
(2118, '2026-09-07 13:48:31', 29, '', 'ISMS', 'Setup-Assistent: Unternehmensziele gespeichert'),
(2119, '2026-09-07 13:52:28', 29, '', 'ISMS', 'Setup-Assistent: Risikoappetit gesetzt (ausgewogen)'),
(2120, '2026-09-07 13:53:36', 29, '', 'ISMS', 'Setup-Assistent: Risikoappetit gesetzt (ausgewogen)'),
(2121, '2026-09-07 13:53:42', 29, 'Geschäftsleitung', 'Admin', 'Abteilung angelegt'),
(2122, '2026-09-07 13:53:44', 29, 'IT', 'Admin', 'Abteilung angelegt'),
(2123, '2026-09-07 13:53:44', 29, 'Personal', 'Admin', 'Abteilung angelegt'),
(2124, '2026-09-07 13:53:44', 29, 'Einkauf', 'Admin', 'Abteilung angelegt'),
(2125, '2026-09-07 13:53:44', 29, 'Verwaltung', 'Admin', 'Abteilung angelegt'),
(2126, '2026-09-07 13:53:44', 29, 'Entwicklung', 'Admin', 'Abteilung angelegt'),
(2127, '2026-09-07 13:53:44', 29, '', 'ISMS', 'Setup-Assistent: 5 Abteilung(en) angelegt'),
(2128, '2026-09-07 13:56:26', 29, '', 'ISMS', 'Setup-Assistent: 6 KI-Vorschlaege (Abteilungen)'),
(2129, '2026-09-07 13:59:44', 29, '', 'ISMS', 'Setup-Assistent: 0 Abteilung(en) angelegt'),
(2130, '2026-09-07 14:03:52', 29, '', 'ISMS', 'Setup-Assistent: 0 Abteilung(en) angelegt'),
(2131, '2026-09-07 14:04:07', 29, '', 'ISMS', 'Setup-Assistent: 6 KI-Vorschlaege (Prozesse fuehrung)'),
(2132, '2026-09-07 14:06:40', 29, 'Unternehmensführung', 'Prozesslandkarte', 'Prozess angelegt'),
(2133, '2026-09-07 14:06:40', 29, 'Strategie und Planung', 'Prozesslandkarte', 'Prozess angelegt'),
(2134, '2026-09-07 14:06:40', 29, 'Informationssicherheitsmanagement', 'Prozesslandkarte', 'Prozess angelegt'),
(2135, '2026-09-07 14:06:40', 29, 'Risikomanagement', 'Prozesslandkarte', 'Prozess angelegt'),
(2136, '2026-09-07 14:06:40', 29, 'Compliance und Recht', 'Prozesslandkarte', 'Prozess angelegt'),
(2137, '2026-09-07 14:06:40', 29, 'Interne Audits', 'Prozesslandkarte', 'Prozess angelegt'),
(2138, '2026-09-07 14:06:40', 29, 'Ressourcen- und Budgetplanung', 'Prozesslandkarte', 'Prozess angelegt'),
(2139, '2026-09-07 14:06:40', 29, 'Lieferanten- und Partnermanagement', 'Prozesslandkarte', 'Prozess angelegt'),
(2140, '2026-09-07 14:06:40', 29, 'Kontinuierliche Verbesserung', 'Prozesslandkarte', 'Prozess angelegt'),
(2141, '2026-09-07 14:06:40', 29, '', 'ISMS', 'Setup-Assistent: 9 Prozess(e) angelegt'),
(2142, '2026-09-07 14:08:59', 29, 'Vertrieb', 'Prozesslandkarte', 'Prozess angelegt'),
(2143, '2026-09-07 14:08:59', 29, 'Angebot und Auftrag', 'Prozesslandkarte', 'Prozess angelegt'),
(2144, '2026-09-07 14:08:59', 29, 'Entwicklung', 'Prozesslandkarte', 'Prozess angelegt'),
(2145, '2026-09-07 14:08:59', 29, 'Produktion / Leistungserbringung', 'Prozesslandkarte', 'Prozess angelegt'),
(2146, '2026-09-07 14:08:59', 29, 'Auslieferung und Service', 'Prozesslandkarte', 'Prozess angelegt'),
(2147, '2026-09-07 14:08:59', 29, 'Kundenbetreuung', 'Prozesslandkarte', 'Prozess angelegt'),
(2148, '2026-09-07 14:08:59', 29, '', 'ISMS', 'Setup-Assistent: 6 Prozess(e) angelegt'),
(2149, '2026-09-07 14:09:09', 29, '', 'ISMS', 'Setup-Assistent: 9 KI-Vorschlaege (Prozesse unterstuetzung)'),
(2150, '2026-09-07 14:12:54', 29, 'IT-Betrieb', 'Prozesslandkarte', 'Prozess angelegt'),
(2151, '2026-09-07 14:12:54', 29, 'Personal', 'Prozesslandkarte', 'Prozess angelegt'),
(2152, '2026-09-07 14:12:54', 29, 'Finanzen und Buchhaltung', 'Prozesslandkarte', 'Prozess angelegt'),
(2153, '2026-09-07 14:12:54', 29, 'Qualitätsmanagement', 'Prozesslandkarte', 'Prozess angelegt'),
(2154, '2026-09-07 14:12:54', 29, 'Schulung und Awareness', 'Prozesslandkarte', 'Prozess angelegt'),
(2155, '2026-09-07 14:12:54', 29, '', 'ISMS', 'Setup-Assistent: 5 Prozess(e) angelegt'),
(2156, '2026-09-07 14:13:39', 29, '', 'ISMS', 'Setup-Assistent: 8 KI-Vorschlaege (Rollen)'),
(2157, '2026-09-07 14:13:41', 29, '', 'ISMS', 'Setup-Assistent: 8 KI-Vorschlaege (Rollen)'),
(2158, '2026-09-07 14:15:18', 29, 'Geschäftsführung', 'Admin', 'Rolle angelegt'),
(2159, '2026-09-07 14:15:18', 29, 'Informationssicherheitsbeauftragter (ISB)', 'Admin', 'Rolle angelegt'),
(2160, '2026-09-07 14:15:18', 29, 'Datenschutzbeauftragter', 'Admin', 'Rolle angelegt'),
(2161, '2026-09-07 14:15:18', 29, 'Leitung IT', 'Admin', 'Rolle angelegt'),
(2162, '2026-09-07 14:15:18', 29, 'Verwaltung', 'Admin', 'Rolle angelegt'),
(2163, '2026-09-07 14:15:18', 29, 'Administrator', 'Admin', 'Rolle angelegt'),
(2164, '2026-09-07 14:15:18', 29, 'System Manager', 'Admin', 'Rolle angelegt'),
(2165, '2026-09-07 14:15:18', 29, 'Entwickler', 'Admin', 'Rolle angelegt'),
(2166, '2026-09-07 14:15:18', 29, 'Security Manager', 'Admin', 'Rolle angelegt'),
(2167, '2026-09-07 14:15:18', 29, 'Service Desk', 'Admin', 'Rolle angelegt'),
(2168, '2026-09-07 14:15:18', 29, '', 'ISMS', 'Setup-Assistent: 10 Rolle(n) angelegt'),
(2169, '2026-09-07 14:15:22', 29, '', 'ISMS', 'Setup-Assistent: 0 Rolle(n) angelegt'),
(2170, '2026-09-07 14:15:31', 29, '', 'ISMS', 'Setup-Assistent: 12 KI-Vorschlaege (Dokumente)'),
(2171, '2026-09-07 14:16:20', 29, '', 'Dokumente', 'Dokument angelegt: Informationssicherheitsleitlinie'),
(2172, '2026-09-07 14:16:20', 29, '', 'Dokumente', 'Dokument angelegt: Anwendungsbereich des ISMS (Scope)'),
(2173, '2026-09-07 14:16:20', 29, '', 'Dokumente', 'Dokument angelegt: Verfahren zum Risikomanagement'),
(2174, '2026-09-07 14:16:20', 29, '', 'Dokumente', 'Dokument angelegt: Statement of Applicability (SoA)'),
(2175, '2026-09-07 14:16:20', 29, '', 'Dokumente', 'Dokument angelegt: Richtlinie zur Zugriffssteuerung'),
(2176, '2026-09-07 14:16:20', 29, '', 'Dokumente', 'Dokument angelegt: Passwort- und Authentifizierungsrichtlinie'),
(2177, '2026-09-07 14:16:20', 29, '', 'Dokumente', 'Dokument angelegt: Richtlinie zur Nutzung mobiler Geräte'),
(2178, '2026-09-07 14:16:20', 29, '', 'Dokumente', 'Dokument angelegt: Verfahren zur Behandlung von Sicherheitsvorfällen'),
(2179, '2026-09-07 14:16:20', 29, '', 'Dokumente', 'Dokument angelegt: Verfahren für Datensicherung und Wiederherstellung'),
(2180, '2026-09-07 14:16:20', 29, '', 'Dokumente', 'Dokument angelegt: Notfall- und Wiederanlaufplan'),
(2181, '2026-09-07 14:16:20', 29, '', 'Dokumente', 'Dokument angelegt: Richtlinie für Lieferanten und Dienstleister'),
(2182, '2026-09-07 14:16:20', 29, '', 'Dokumente', 'Dokument angelegt: Verfahren für interne Audits'),
(2183, '2026-09-07 14:16:20', 29, '', 'Dokumente', 'Dokument angelegt: Verfahren für die Managementbewertung'),
(2184, '2026-09-07 14:16:20', 29, '', 'Dokumente', 'Dokument angelegt: Schulungs- und Awareness-Konzept'),
(2185, '2026-09-07 14:16:20', 29, '', 'Dokumente', 'Dokument angelegt: Verfahren zur Lenkung dokumentierter Informationen'),
(2186, '2026-09-07 14:16:20', 29, '', 'ISMS', 'Setup-Assistent: 15 Dokument(e) angelegt'),
(2187, '2026-09-07 14:16:31', 29, 'Leitung HR', 'Admin', 'Rolle angelegt'),
(2188, '2026-09-07 14:16:31', 29, 'Einkauf', 'Admin', 'Rolle angelegt'),
(2189, '2026-09-07 14:16:31', 29, '', 'ISMS', 'Setup-Assistent: 2 Rolle(n) angelegt'),
(2190, '2026-09-07 14:16:37', 29, '', 'ISMS', 'Setup-Assistent: 0 Rolle(n) angelegt'),
(2191, '2026-09-07 14:20:05', 29, '', 'ISMS', 'Setup-Assistent: 12 KI-Vorschlaege (Assets)'),
(2192, '2026-09-07 14:20:51', 29, '', 'Assets', 'Asset angelegt: ISMS-Software Quellcode'),
(2193, '2026-09-07 14:20:51', 29, '', 'Assets', 'Asset angelegt: Kundendatenbank'),
(2194, '2026-09-07 14:20:51', 29, '', 'Assets', 'Asset angelegt: Beratungsdokumente und Projektunterlagen'),
(2195, '2026-09-07 14:20:51', 29, '', 'Assets', 'Asset angelegt: Cloud-Infrastruktur für SaaS-Anwendung'),
(2196, '2026-09-07 14:20:51', 29, '', 'Assets', 'Asset angelegt: Entwicklungsumgebung'),
(2197, '2026-09-07 14:20:51', 29, '', 'Assets', 'Asset angelegt: Versionsverwaltungssystem'),
(2198, '2026-09-07 14:20:51', 29, '', 'Assets', 'Asset angelegt: Buchhaltungs- und Finanzsystem'),
(2199, '2026-09-07 14:20:51', 29, '', 'Assets', 'Asset angelegt: E-Mail-System'),
(2200, '2026-09-07 14:20:51', 29, '', 'Assets', 'Asset angelegt: Videokonferenz-Dienst'),
(2201, '2026-09-07 14:20:51', 29, '', 'Assets', 'Asset angelegt: Kundensupport-Ticketsystem'),
(2202, '2026-09-07 14:20:51', 29, '', 'Assets', 'Asset angelegt: Home-Office-Arbeitsplätze'),
(2203, '2026-09-07 14:20:51', 29, '', 'Assets', 'Asset angelegt: Backup-Speicher'),
(2204, '2026-09-07 14:20:51', 29, '', 'ISMS', 'Setup-Assistent: 12 Asset(s) angelegt'),
(2205, '2026-09-07 14:20:57', 29, '', 'ISMS', 'Setup-Assistent: 12 KI-Vorschlaege (Lieferanten)'),
(2206, '2026-09-07 14:21:21', 29, '', 'Lieferanten', 'Lieferant angelegt: Cloud-Hosting-Anbieter'),
(2207, '2026-09-07 14:21:21', 29, '', 'Lieferanten', 'Lieferant angelegt: Domain- und DNS-Anbieter'),
(2208, '2026-09-07 14:21:21', 29, '', 'Lieferanten', 'Lieferant angelegt: E-Mail-Hosting-Dienst'),
(2209, '2026-09-07 14:21:21', 29, '', 'Lieferanten', 'Lieferant angelegt: Videokonferenz-Anbieter'),
(2210, '2026-09-07 14:21:21', 29, '', 'Lieferanten', 'Lieferant angelegt: Backup- und Storage-Anbieter'),
(2211, '2026-09-07 14:21:21', 29, '', 'Lieferanten', 'Lieferant angelegt: Softwarelizenz-Anbieter'),
(2212, '2026-09-07 14:21:21', 29, '', 'Lieferanten', 'Lieferant angelegt: Zahlungsdienstleister'),
(2213, '2026-09-07 14:21:21', 29, '', 'Lieferanten', 'Lieferant angelegt: Steuerberater'),
(2214, '2026-09-07 14:21:21', 29, '', 'Lieferanten', 'Lieferant angelegt: Rechtsanwalt'),
(2215, '2026-09-07 14:21:21', 29, '', 'Lieferanten', 'Lieferant angelegt: Internetprovider'),
(2216, '2026-09-07 14:21:21', 29, '', 'Lieferanten', 'Lieferant angelegt: Mobilfunkanbieter'),
(2217, '2026-09-07 14:21:21', 29, '', 'Lieferanten', 'Lieferant angelegt: Hardware-Lieferant'),
(2218, '2026-09-07 14:21:21', 29, '', 'ISMS', 'Setup-Assistent: 12 Lieferant(en) angelegt'),
(2219, '2026-09-07 14:21:29', 29, '', 'ISMS', 'Setup-Assistent: 12 KI-Vorschlaege (Lieferanten)'),
(2220, '2026-09-07 14:22:01', 29, '', 'Lieferanten', 'Lieferant angelegt: Code-Signing-Zertifikatsstelle'),
(2221, '2026-09-07 14:22:01', 29, '', 'Lieferanten', 'Lieferant angelegt: Penetrationstest-Dienstleister'),
(2222, '2026-09-07 14:22:01', 29, '', 'Lieferanten', 'Lieferant angelegt: Datenschutzbeauftragter extern'),
(2223, '2026-09-07 14:22:01', 29, '', 'Lieferanten', 'Lieferant angelegt: IT-Haftpflichtversicherung'),
(2224, '2026-09-07 14:22:01', 29, '', 'Lieferanten', 'Lieferant angelegt: Coworking-Space-Anbieter'),
(2225, '2026-09-07 14:22:01', 29, '', 'Lieferanten', 'Lieferant angelegt: Webhosting-Anbieter'),
(2226, '2026-09-07 14:22:01', 29, '', 'Lieferanten', 'Lieferant angelegt: Marketing-Agentur'),
(2227, '2026-09-07 14:22:01', 29, '', 'Lieferanten', 'Lieferant angelegt: Recruiting-Plattform'),
(2228, '2026-09-07 14:22:01', 29, '', 'Lieferanten', 'Lieferant angelegt: Schulungs- und Zertifizierungsanbieter'),
(2229, '2026-09-07 14:22:01', 29, '', 'Lieferanten', 'Lieferant angelegt: Support-Ticket-Plattform'),
(2230, '2026-09-07 14:22:01', 29, '', 'Lieferanten', 'Lieferant angelegt: API-Gateway-Dienst'),
(2231, '2026-09-07 14:22:01', 29, '', 'Lieferanten', 'Lieferant angelegt: Dokumentenmanagement-Anbieter'),
(2232, '2026-09-07 14:22:01', 29, '', 'ISMS', 'Setup-Assistent: 12 Lieferant(en) angelegt'),
(2233, '2026-09-07 14:22:11', 29, '', 'ISMS', 'Setup-Assistent: 12 KI-Vorschlaege (Lieferanten)'),
(2234, '2026-09-07 14:23:10', 29, '', 'ISMS', 'Setup-Assistent: 12 KI-Vorschlaege (Risiken)'),
(2235, '2026-09-07 14:25:11', 29, '', 'ISMS', 'Setup-Assistent: 12 KI-Vorschlaege (Risiken)'),
(2236, '2026-09-07 14:27:01', 29, '', 'Risiko', 'Risiko angelegt: Verlust oder Beschädigung der Backup-Speicher durch fehlende Redundanz oder Hardwareausfall'),
(2237, '2026-09-07 14:27:01', 29, '', 'Risiko', 'Risiko angelegt: Unbefugter Zugriff auf Beratungsdokumente und Projektunterlagen durch mangelhafte Zugriffskontrollen'),
(2238, '2026-09-07 14:27:01', 29, '', 'Risiko', 'Risiko angelegt: Manipulation oder Fehlbuchungen im Buchhaltungs- und Finanzsystem durch unzureichende Berechtigungstrennung'),
(2239, '2026-09-07 14:27:01', 29, '', 'Risiko', 'Risiko angelegt: Ausfall der Cloud-Infrastruktur für SaaS-Anwendung durch Provider-Störung oder Fehlkonfiguration'),
(2240, '2026-09-07 14:27:01', 29, '', 'Risiko', 'Risiko angelegt: Kompromittierung des E-Mail-Systems durch Phishing-Angriffe auf Mitarbeiter'),
(2241, '2026-09-07 14:27:01', 29, '', 'Risiko', 'Risiko angelegt: Einschleusen von Schadcode in die Entwicklungsumgebung durch unsichere Abhängigkeiten'),
(2242, '2026-09-07 14:27:01', 29, '', 'Risiko', 'Risiko angelegt: Datenverlust an Home-Office-Arbeitsplätzen durch fehlende Verschlüsselung oder Diebstahl'),
(2243, '2026-09-07 14:27:01', 29, '', 'Risiko', 'Risiko angelegt: Diebstahl des ISMS-Software Quellcodes durch unzureichend geschützte Repositories'),
(2244, '2026-09-07 14:27:01', 29, '', 'Risiko', 'Risiko angelegt: Datenschutzverletzung in der Kundendatenbank durch unautorisierten Zugriff oder Datenleck'),
(2245, '2026-09-07 14:27:01', 29, '', 'Risiko', 'Risiko angelegt: Verlust von Supportanfragen im Kundensupport-Ticketsystem durch Systemausfall oder Fehlkonfiguration'),
(2246, '2026-09-07 14:27:01', 29, '', 'Risiko', 'Risiko angelegt: Ungewollte Codeänderungen im Versionsverwaltungssystem durch kompromittierte Zugangsdaten'),
(2247, '2026-09-07 14:27:01', 29, '', 'Risiko', 'Risiko angelegt: Abhören vertraulicher Gespräche über den Videokonferenz-Dienst durch unsichere Einstellungen'),
(2248, '2026-09-07 14:27:01', 29, '', 'ISMS', 'Setup-Assistent: 12 Risiko/Risiken angelegt'),
(2249, '2026-09-07 14:27:38', 29, '', 'Risiko', 'Risiko angelegt: Uneinigkeit der Geschäftsführung bei unternehmenswichtigen Entscheidungen'),
(2250, '2026-09-07 14:27:38', 29, '', 'ISMS', 'Setup-Assistent: 1 Risiko/Risiken angelegt'),
(2251, '2026-09-07 14:27:59', 29, '', 'ISMS', 'Setup-Assistent: 12 KI-Vorschlaege (Massnahmen)'),
(2252, '2026-09-07 14:44:40', 29, '', 'ISMS', 'Setup-Assistent: 12 KI-Vorschlaege (Massnahmen)'),
(2253, '2026-09-07 14:44:50', 29, '', 'Maßnahmen', 'angelegt: Ende-zu-Ende-Verschlüsselung für Videokonferenzen aktivieren'),
(2254, '2026-09-07 14:44:50', 29, '', 'Maßnahmen', 'angelegt: Wartungspasswörter und Meeting-Zugangscodes standardmäßig setzen'),
(2255, '2026-09-07 14:44:50', 29, '', 'Maßnahmen', 'angelegt: Georedundante Cloud-Infrastruktur bei zweitem Provider'),
(2256, '2026-09-07 14:44:50', 29, '', 'Maßnahmen', 'angelegt: SLA mit garantierten Verfügbarkeitszeiten und Pönalen'),
(2257, '2026-09-07 14:44:50', 29, '', 'Maßnahmen', 'angelegt: Rollenbasierte Zugriffskontrolle für Kundendatenbank'),
(2258, '2026-09-07 14:44:50', 29, '', 'Maßnahmen', 'angelegt: Verschlüsselung personenbezogener Daten at rest und in transit'),
(2259, '2026-09-07 14:44:50', 29, '', 'Maßnahmen', 'angelegt: Festplattenverschlüsselung auf allen Endgeräten'),
(2260, '2026-09-07 14:44:50', 29, '', 'Maßnahmen', 'angelegt: Mobile Device Management für Home-Office-Geräte'),
(2261, '2026-09-07 14:44:50', 29, '', 'Maßnahmen', 'angelegt: Zugriffsbeschränkung auf Repositories mit Multi-Faktor-Authentifizierung'),
(2262, '2026-09-07 14:44:50', 29, '', 'Maßnahmen', 'angelegt: Automatisierte Schwachstellenprüfung für Software-Abhängigkeiten'),
(2263, '2026-09-07 14:44:50', 29, '', 'Maßnahmen', 'angelegt: Phishing-Awareness-Schulungen für alle Mitarbeiter'),
(2264, '2026-09-07 14:44:50', 29, '', 'Maßnahmen', 'angelegt: Vier-Augen-Prinzip für Finanztransaktionen'),
(2265, '2026-09-07 14:44:50', 29, '', 'ISMS', 'Setup-Assistent: 12 Massnahme(n) angelegt'),
(2266, '2026-09-07 14:46:29', 29, 'DOK-00015', 'Dokumente', 'KI-Bearbeitung vorgeschlagen'),
(2267, '2026-09-07 14:49:32', 29, 'DOK-00015', 'Dokumente', 'KI-Bearbeitung übernommen'),
(2268, '2026-09-07 14:51:24', 29, 'DOK-00003', 'Dokumente', 'KI-Bearbeitung vorgeschlagen'),
(2269, '2026-09-07 14:54:11', 29, 'DOK-00003', 'Dokumente', 'KI-Bearbeitung übernommen'),
(2270, '2026-09-07 15:32:56', 18, '', 'ISMS', 'Setup-Assistent: 12 KI-Vorschlaege (Dokumente)'),
(2271, '2026-09-07 15:33:38', 18, '', 'ISMS', 'Setup-Assistent: 12 KI-Vorschlaege (Dokumente)'),
(2272, '2026-09-07 15:33:50', 18, '', 'ISMS', 'Setup-Assistent: 12 KI-Vorschlaege (Dokumente)'),
(2273, '2026-09-07 15:33:51', 18, '', 'ISMS', 'Setup-Assistent: 12 KI-Vorschlaege (Dokumente)'),
(2274, '2026-09-07 15:34:51', 18, '', 'ISMS', 'Setup-Assistent: 7 KI-Vorschlaege (Rollen)'),
(2275, '2026-09-07 15:35:26', 18, '', 'ISMS', 'Setup-Assistent: 0 Rolle(n) angelegt'),
(2276, '2026-09-07 15:35:47', 18, '', 'ISMS', 'Setup-Assistent: 9 KI-Vorschlaege (Rollen)'),
(2277, '2026-09-07 15:36:55', 18, '', 'ISMS', 'Setup-Assistent: 6 KI-Vorschlaege (Rollen)'),
(2278, '2026-09-07 15:37:06', 18, '', 'ISMS', 'Setup-Assistent: 3 KI-Vorschlaege (Abteilungen)'),
(2279, '2026-09-07 15:37:24', 18, '', 'ISMS', 'Setup-Assistent: 6 KI-Vorschlaege (Dokumente)'),
(2280, '2026-09-07 19:40:05', 18, '', 'ISMS', 'Setup-Assistent: 0 Prozess(e) angelegt'),
(2281, '2026-09-07 19:40:09', 18, 'Beschaffung', 'Prozesslandkarte', 'Prozess angelegt'),
(2282, '2026-09-07 19:40:09', 18, '', 'ISMS', 'Setup-Assistent: 1 Prozess(e) angelegt'),
(2283, '2026-09-07 19:40:15', 18, 'Facility Management', 'Prozesslandkarte', 'Prozess angelegt'),
(2284, '2026-09-07 19:40:15', 18, '', 'ISMS', 'Setup-Assistent: 1 Prozess(e) angelegt'),
(2285, '2026-09-07 19:40:35', 18, 'Vertrieb', 'Prozesslandkarte', 'Prozess verschoben (kern)'),
(2286, '2026-09-07 19:41:39', 18, '', 'ISMS', 'Setup-Assistent: 0 Prozess(e) angelegt'),
(2287, '2026-09-07 19:41:41', 18, '', 'ISMS', 'Setup-Assistent: 0 Prozess(e) angelegt'),
(2288, '2026-09-07 19:55:33', 18, '', 'ISMS', 'Setup-Assistent: 0 Prozess(e) angelegt'),
(2289, '2026-09-07 19:55:43', 18, '', 'ISMS', 'Setup-Assistent: 0 Prozess(e) angelegt'),
(2290, '2026-09-07 19:55:45', 18, '', 'ISMS', 'Setup-Assistent: 0 Prozess(e) angelegt'),
(2291, '2026-09-07 19:55:48', 18, '', 'ISMS', 'Setup-Assistent: Unternehmensziele gespeichert'),
(2292, '2026-09-07 19:55:53', 18, '', 'ISMS', 'Setup-Assistent: 0 Prozess(e) angelegt'),
(2293, '2026-09-07 19:55:57', 18, '', 'ISMS', 'Setup-Assistent: 0 Prozess(e) angelegt'),
(2294, '2026-09-07 19:59:16', 18, '', 'ISMS', 'Setup-Assistent: 0 Prozess(e) angelegt'),
(2295, '2026-09-07 19:59:30', 18, '', 'Assets', 'Asset angelegt: Compliance und Recht'),
(2296, '2026-09-07 19:59:30', 18, '', 'Assets', 'Asset angelegt: Informationssicherheitsmanagement'),
(2297, '2026-09-07 19:59:30', 18, '', 'Assets', 'Asset angelegt: Interne Audits'),
(2298, '2026-09-07 19:59:30', 18, '', 'Assets', 'Asset angelegt: Kontinuierliche Verbesserung'),
(2299, '2026-09-07 19:59:30', 18, '', 'Assets', 'Asset angelegt: Lieferanten- und Partnermanagement'),
(2300, '2026-09-07 19:59:30', 18, '', 'Assets', 'Asset angelegt: Ressourcen- und Budgetplanung'),
(2301, '2026-09-07 19:59:30', 18, '', 'Assets', 'Asset angelegt: Risikomanagement'),
(2302, '2026-09-07 19:59:30', 18, '', 'Assets', 'Asset angelegt: Strategie und Planung'),
(2303, '2026-09-07 19:59:30', 18, '', 'Assets', 'Asset angelegt: Unternehmensführung'),
(2304, '2026-09-07 19:59:30', 18, '', 'Assets', 'Asset angelegt: Angebot und Auftrag'),
(2305, '2026-09-07 19:59:30', 18, '', 'Assets', 'Asset angelegt: Auslieferung und Service'),
(2306, '2026-09-07 19:59:30', 18, '', 'Assets', 'Asset angelegt: Beschaffung'),
(2307, '2026-09-07 19:59:30', 18, '', 'Assets', 'Asset angelegt: Entwicklung'),
(2308, '2026-09-07 19:59:30', 18, '', 'Assets', 'Asset angelegt: Kundenbetreuung'),
(2309, '2026-09-07 19:59:30', 18, '', 'Assets', 'Asset angelegt: Produktion / Leistungserbringung'),
(2310, '2026-09-07 19:59:30', 18, '', 'Assets', 'Asset angelegt: Vertrieb'),
(2311, '2026-09-07 19:59:30', 18, '', 'Assets', 'Asset angelegt: Facility Management'),
(2312, '2026-09-07 19:59:30', 18, '', 'Assets', 'Asset angelegt: Finanzen und Buchhaltung'),
(2313, '2026-09-07 19:59:30', 18, '', 'Assets', 'Asset angelegt: IT-Betrieb'),
(2314, '2026-09-07 19:59:30', 18, '', 'Assets', 'Asset angelegt: Personal'),
(2315, '2026-09-07 19:59:30', 18, '', 'Assets', 'Asset angelegt: Qualitätsmanagement'),
(2316, '2026-09-07 19:59:30', 18, '', 'Assets', 'Asset angelegt: Schulung und Awareness'),
(2317, '2026-09-07 19:59:30', 18, '', 'ISMS', 'Setup-Assistent: 22 Prozess(e) als Asset uebernommen'),
(2318, '2026-09-07 20:40:44', 18, '', 'ISMS', 'Setup-Assistent: 0 Abteilung(en) angelegt'),
(2319, '2026-09-07 20:40:53', 18, '', 'ISMS', 'Setup-Assistent: 0 Abteilung(en) angelegt'),
(2320, '2026-09-07 20:40:57', 18, 'Geschäftsführung', 'Admin', 'Rolle angelegt'),
(2321, '2026-09-07 20:40:57', 18, 'Informationssicherheitsbeauftragter (ISB)', 'Admin', 'Rolle angelegt'),
(2322, '2026-09-07 20:40:57', 18, 'Datenschutzbeauftragter', 'Admin', 'Rolle angelegt'),
(2323, '2026-09-07 20:40:57', 18, 'Verantwortlicher IT', 'Admin', 'Rolle angelegt'),
(2324, '2026-09-07 20:40:57', 18, 'Verantwortlicher HR', 'Admin', 'Rolle angelegt'),
(2325, '2026-09-07 20:40:57', 18, 'Einkauf', 'Admin', 'Rolle angelegt'),
(2326, '2026-09-07 20:40:57', 18, 'Verwaltung', 'Admin', 'Rolle angelegt'),
(2327, '2026-09-07 20:40:57', 18, 'Administrator', 'Admin', 'Rolle angelegt'),
(2328, '2026-09-07 20:40:57', 18, 'System Manager', 'Admin', 'Rolle angelegt'),
(2329, '2026-09-07 20:40:57', 18, 'Entwickler', 'Admin', 'Rolle angelegt'),
(2330, '2026-09-07 20:40:57', 18, 'Security Manager', 'Admin', 'Rolle angelegt'),
(2331, '2026-09-07 20:40:57', 18, 'Service Desk', 'Admin', 'Rolle angelegt'),
(2332, '2026-09-07 20:40:57', 18, '', 'ISMS', 'Setup-Assistent: 12 Rolle(n) angelegt'),
(2333, '2026-09-07 20:42:05', 18, '', 'ISMS', 'Setup-Assistent: 0 Abteilung(en) angelegt'),
(2334, '2026-09-07 20:42:07', 18, '', 'ISMS', 'Setup-Assistent: 0 Abteilung(en) angelegt'),
(2335, '2026-09-07 20:42:12', 18, '', 'ISMS', 'Setup-Assistent: Schritt rollen uebersprungen'),
(2336, '2026-09-07 20:43:44', 18, '', 'ISMS', 'Setup-Assistent: 0 Abteilung(en) angelegt'),
(2337, '2026-09-07 20:43:46', 18, '', 'ISMS', 'Setup-Assistent: 0 Abteilung(en) angelegt'),
(2338, '2026-09-07 20:43:55', 18, '', 'Assets', 'Asset angelegt: Geschäftsleitung'),
(2339, '2026-09-07 20:43:55', 18, '', 'Assets', 'Asset angelegt: Einkauf'),
(2340, '2026-09-07 20:43:55', 18, '', 'Assets', 'Asset angelegt: IT'),
(2341, '2026-09-07 20:43:55', 18, '', 'Assets', 'Asset angelegt: Verwaltung'),
(2342, '2026-09-07 20:43:55', 18, '', 'ISMS', 'Setup-Assistent: 4 × Abteilung als Asset uebernommen'),
(2343, '2026-09-07 20:44:06', 18, '', 'ISMS', 'Setup-Assistent: 0 Rolle(n) angelegt'),
(2344, '2026-09-07 20:47:16', 18, 'AST-00038', 'Assets', 'geändert'),
(2345, '2026-09-07 20:47:40', 18, 'AST-00037', 'Assets', 'geändert'),
(2346, '2026-09-07 20:47:58', 18, 'AST-00036', 'Assets', 'geändert'),
(2347, '2026-09-07 20:48:09', 18, 'AST-00035', 'Assets', 'geändert'),
(2348, '2026-09-08 07:16:34', 18, 'RSK-00012', 'Risiko', 'KI-Vorschlag erzeugt'),
(2349, '2026-09-08 08:11:29', 18, 'DOK-00001', 'Dokumente', 'KI-Aufbereitung eines Word-Imports'),
(2350, '2026-09-08 08:12:35', 18, 'DOK-00001', 'Dokumente', 'KI-Aufbereitung eines Word-Imports'),
(2351, '2026-09-08 08:24:00', 18, 'DOK-00001', 'Dokumente', 'angelegt'),
(2352, '2026-09-08 08:24:40', 18, 'DOK-00001', 'Dokumente', 'geändert'),
(2353, '2026-09-08 08:26:51', 18, 'DOK-00001', 'Dokumente', 'KI-Bearbeitung vorgeschlagen'),
(2354, '2026-09-08 12:15:40', 29, '', 'ISMS', 'Login'),
(2355, '2026-09-08 14:15:57', 18, 'RSK-00013', 'Risiko', 'KI-Vorschlag erzeugt'),
(2356, '2026-09-08 14:19:43', 18, '', 'ISMS', 'Setup-Assistent: 3 KI-Vorschlaege (Rollen)'),
(2357, '2026-09-08 14:46:37', 18, '', 'ISMS', 'Setup-Assistent: 6 KI-Vorschlaege (Dokumente)'),
(2358, '2026-09-09 15:25:05', 18, '', 'ISMS', 'Login (SSO Google)'),
(2359, '2026-09-15 06:33:14', 18, '', 'ISMS', 'Login (SSO Google)'),
(2360, '2026-09-16 12:50:29', 18, '', 'ISMS', 'Login (SSO Google)'),
(2361, '2026-09-16 12:51:38', 18, '176', 'Dokument', 'zu Prüfen'),
(2362, '2026-09-16 12:51:42', 18, '176', 'Dokument', 'geprüft'),
(2363, '2026-09-16 12:51:45', 18, '176', 'Dokument', 'freigegeben'),
(2364, '2026-09-16 12:53:15', 18, 'DOK-00002', 'Dokumente', 'angelegt'),
(2365, '2026-09-16 12:53:34', 18, '177', 'Dokument', 'zu Prüfen'),
(2366, '2026-09-16 12:53:38', 18, '177', 'Dokument', 'geprüft'),
(2367, '2026-09-16 12:53:41', 18, '177', 'Dokument', 'freigegeben'),
(2368, '2026-09-16 13:48:52', 18, 'AST-00008', 'Assets', 'geändert'),
(2369, '2026-09-16 17:18:42', 18, 'AST-00039', 'Assets', 'angelegt'),
(2370, '2026-09-16 17:19:13', 18, 'AST-00039', 'Assets', 'geändert'),
(2371, '2026-09-17 17:55:06', 29, '', 'ISMS', 'Login'),
(2372, '2026-09-17 17:57:53', 18, '', 'ISMS', 'Login (SSO Google)'),
(2373, '2026-09-19 06:04:24', 18, '', 'ISMS', 'Login (SSO Google)'),
(2374, '2026-09-19 06:11:24', 18, '', 'ISMS', 'Login (SSO Google)'),
(2375, '2026-09-19 06:12:14', 18, '', 'ISMS', 'Login (SSO Google)'),
(2376, '2026-09-20 11:46:38', 18, '', 'ISMS', 'Login (SSO Google)'),
(2377, '2026-09-22 06:18:15', 18, '', 'ISMS', 'Login (SSO Google)'),
(2378, '2026-09-22 06:28:43', 18, '', 'ISMS', 'Login (SSO Google)'),
(2379, '2026-09-22 06:33:13', 18, 'AUD-00003', 'Audit', 'Audit angelegt: NIS GAP-Assessment'),
(2380, '2026-09-22 06:33:28', 18, 'AUD-00003', 'Audit', 'Prüfliste aufgebaut: 35 Anforderung(en) aus NIS2'),
(2381, '2026-09-22 06:49:18', 18, 'AUD-00004', 'Audit', 'Audit angelegt: GAP-Assessment KI'),
(2382, '2026-09-22 06:49:25', 18, 'AUD-00004', 'Audit', 'Prüfliste aufgebaut: 35 Anforderung(en) aus NIS2'),
(2383, '2026-09-22 06:59:16', 18, 'AUD-00004', 'Audit', 'Audit geändert: GAP-Assessment KI'),
(2384, '2026-09-22 07:01:57', 18, 'AUD-00004', 'Audit', 'KI-Beschreibungen: 35 Prüfpunkt(e)'),
(2385, '2026-09-22 07:08:11', 18, 'AUD-00003', 'Audit', 'Audit geändert: NIS GAP-Assessment'),
(2386, '2026-09-22 07:09:21', 18, '', 'ISMS', 'Login (SSO Google)'),
(2387, '2026-09-22 07:33:05', 18, 'AUD-00004', 'Audit', 'Audit gelöscht: GAP-Assessment KI (0 Abweichungen)'),
(2388, '2026-09-22 07:33:50', 18, 'AUD-00003', 'Audit', 'Audit geändert: NIS2 GAP-Assessment'),
(2389, '2026-09-22 07:34:37', 18, 'AUD-00003', 'Audit', 'KI-Beschreibungen: 10 Prüfpunkt(e)'),
(2390, '2026-09-22 09:08:22', 18, 'CISIS12', 'Normen', 'komplett gelöscht (65 Einträge)'),
(2391, '2026-09-22 09:08:44', 18, 'DOK-00002', 'Dokumente', 'Dokument gelöscht (Admin, Status 6): Testrichtlinie'),
(2392, '2026-09-22 09:09:12', 18, 'DOK-00002', 'Dokumente', 'angelegt'),
(2393, '2026-09-22 09:10:38', 18, 'DOK-00002', 'Dokumente', 'KI-Bearbeitung vorgeschlagen'),
(2394, '2026-09-22 09:10:48', 18, 'DOK-00002', 'Dokumente', 'KI-Bearbeitung übernommen'),
(2395, '2026-09-22 09:17:19', 18, 'DOK-00001', 'Dokumente', 'Dokument gelöscht (Admin, Status 6): Cloud Exit Strategie'),
(2396, '2026-09-22 09:17:39', 18, 'DOK-00003', 'Dokumente', 'angelegt'),
(2397, '2026-09-22 09:18:42', 18, 'DOK-00003', 'Dokumente', 'KI-Bearbeitung vorgeschlagen'),
(2398, '2026-09-22 09:18:56', 18, 'DOK-00003', 'Dokumente', 'KI-Bearbeitung übernommen'),
(2399, '2026-09-22 10:57:24', 29, '', 'ISMS', 'Login'),
(2400, '2026-09-22 10:58:10', 29, 'AUD-00004', 'Audit', 'Audit angelegt: GapAss26'),
(2401, '2026-09-22 10:58:43', 29, 'AUD-00004', 'Audit', 'Prüfliste aufgebaut: 115 Anforderung(en) aus ISO/IEC 27001:2022'),
(2402, '2026-09-22 10:58:58', 29, 'ABW-00002', 'Audit', 'Abweichung aus Prüfpunkt angelegt: 4.1 – Organisatorischer Kontext'),
(2403, '2026-09-22 11:00:17', 29, 'AUD-00004', 'Audit', 'KI-Beschreibungen: 10 Prüfpunkt(e)'),
(2404, '2026-09-22 11:01:21', 29, 'AUD-00004', 'Audit', 'KI-Beschreibungen: 1 Prüfpunkt(e)'),
(2405, '2026-09-22 11:02:34', 29, 'AUD-00004', 'Audit', 'KI-Beschreibungen: 8 Prüfpunkt(e)'),
(2406, '2026-09-22 11:41:22', 18, 'AUD-00002', 'Audit', 'KI-Beschreibungen: 115 Prüfpunkt(e)'),
(2407, '2026-09-22 15:58:17', 29, 'AUD-00005', 'Audit', 'Audit angelegt: GapAss262'),
(2408, '2026-09-22 15:58:55', 29, 'AUD-00005', 'Audit', 'Prüfliste aufgebaut: 93 Anforderung(en) aus ISO/IEC 27001:2022'),
(2409, '2026-09-22 16:02:51', 29, 'AUD-00005', 'Audit', 'KI-Beschreibungen: 93 Prüfpunkt(e)'),
(2410, '2026-09-22 16:05:10', 29, 'AUD-00005', 'Audit', 'Prüfliste bewertet: 93 Prüfpunkt(e)'),
(2411, '2026-09-22 16:23:16', 18, 'AUD-00001', 'Audit', 'Audit geändert: internes Audit 2026'),
(2412, '2026-09-22 16:27:55', 18, 'AST-00012', 'Assets', 'geändert'),
(2413, '2026-09-22 16:49:20', 18, 'AST-00034', 'Assets', 'geändert'),
(2414, '2026-09-22 16:49:43', 18, 'AST-00031', 'Assets', 'geändert'),
(2415, '2026-09-22 16:50:46', 18, 'AST-00037', 'Assets', 'geändert'),
(2416, '2026-09-22 16:50:50', 18, 'AST-00031', 'Assets', 'Schutzbedarf von AST-00037 geerbt: Vertraulichkeit niedrig→normal, Integrität niedrig→normal, Verfügbarkeit niedrig→hoch, Wert niedrig→normal'),
(2417, '2026-09-22 16:50:50', 18, 'AST-00014', 'Assets', 'Schutzbedarf von AST-00037 geerbt: Vertraulichkeit –→normal, Integrität –→normal, Verfügbarkeit –→hoch, Authentizität –→niedrig, Wert –→normal'),
(2418, '2026-09-22 16:51:08', 18, 'AST-00037', 'Assets', 'geändert'),
(2419, '2026-09-22 16:51:12', 18, 'AST-00031', 'Assets', 'Schutzbedarf von AST-00037 geerbt: Wert niedrig→normal'),
(2420, '2026-09-22 16:51:12', 18, 'AST-00014', 'Assets', 'Schutzbedarf von AST-00037 geerbt: Wert niedrig→normal'),
(2421, '2026-09-22 16:51:23', 18, 'AST-00008', 'Assets', 'Schutzbedarf von AST-00031 geerbt: Vertraulichkeit niedrig→normal, Integrität niedrig→normal, Verfügbarkeit niedrig→hoch, Authentizität niedrig→normal, Wert niedrig→normal'),
(2422, '2026-09-22 17:32:14', 18, '', 'ISMS', 'Setup-Assistent: SMTP-Einstellungen gespeichert'),
(2423, '2026-09-22 17:32:25', 18, '', 'ISMS', 'Setup-Assistent: SMTP-Einstellungen gespeichert'),
(2424, '2026-09-22 17:32:27', 18, '', 'ISMS', 'Setup-Assistent: SMTP-Einstellungen gespeichert'),
(2425, '2026-09-22 17:32:36', 18, '', 'ISMS', 'Setup-Assistent: SMTP-Einstellungen gespeichert'),
(2426, '2026-09-22 17:32:38', 18, '', 'ISMS', 'Setup-Assistent: SMTP-Einstellungen gespeichert'),
(2427, '2026-09-22 17:32:41', 18, '', 'ISMS', 'Setup-Assistent: SMTP-Einstellungen gespeichert'),
(2428, '2026-09-22 17:32:44', 18, '', 'ISMS', 'Setup-Assistent: SMTP-Einstellungen gespeichert'),
(2429, '2026-09-22 17:32:54', 18, '', 'ISMS', 'Setup-Assistent: SMTP-Einstellungen gespeichert'),
(2430, '2026-09-22 17:33:04', 18, '', 'ISMS', 'Setup-Assistent: KI-Einstellung ki_enabled gespeichert'),
(2431, '2026-09-22 17:33:06', 18, '', 'ISMS', 'Setup-Assistent: KI-Einstellung ki_provider gespeichert'),
(2432, '2026-09-22 17:33:07', 18, '', 'ISMS', 'Setup-Assistent: KI-Einstellung ki_model gespeichert'),
(2433, '2026-09-22 17:33:08', 18, '', 'ISMS', 'Setup-Assistent: KI-Einstellung ki_api_key gespeichert'),
(2434, '2026-09-22 17:33:57', 18, '', 'ISMS', 'Setup-Assistent: 2 KI-Vorschlaege (Prozesse fuehrung)'),
(2435, '2026-09-22 17:34:36', 18, '', 'ISMS', 'Setup-Assistent: 0 Prozess(e) angelegt'),
(2436, '2026-09-22 17:36:19', 18, '', 'ISMS', 'Setup-Assistent: 0 Prozess(e) angelegt'),
(2437, '2026-09-22 17:36:23', 18, '', 'ISMS', 'Setup-Assistent: 0 Prozess(e) angelegt'),
(2438, '2026-09-23 13:25:16', 29, '', 'ISMS', 'Login'),
(2439, '2026-09-24 11:55:42', 18, '', 'ISMS', 'Login (SSO Google)'),
(2440, '2026-09-24 12:58:25', 0, '', 'ISMS', 'Login'),
(2441, '2026-09-24 13:11:18', 18, '', 'ISMS', 'Login (SSO Google)'),
(2442, '2026-09-24 17:14:55', 29, '', 'ISMS', 'Login'),
(2443, '2026-09-25 03:02:04', 18, '', 'ISMS', 'Login (SSO Google)'),
(2444, '2026-09-25 07:57:18', 18, 'MAS-0002', 'Maßnahmen', 'angelegt'),
(2445, '2026-09-25 07:57:43', 18, 'MAS-0013', 'Maßnahmen', 'geändert'),
(2446, '2026-09-25 07:59:57', 18, 'CHG-00002', 'Changes', 'Change angelegt: Phishing-Awareness-Schulungen für alle Mitarbeiter'),
(2447, '2026-09-25 08:05:24', 18, 'DOK-00002', 'Dokumente', 'geändert'),
(2448, '2026-09-25 09:48:41', 18, 'DOK-00002', 'Dokumente', 'geändert'),
(2449, '2026-09-25 12:40:24', 18, 'AUD-00001', 'Audit', 'Auditbericht als PDF exportiert'),
(2450, '2026-09-25 14:31:09', 1, '', 'ISMS', 'Login'),
(2451, '2026-09-25 14:31:25', 1, '', 'admin', 'Module gespeichert (27 aktiv)'),
(2452, '2026-09-25 14:31:29', 18, '', 'ISMS', 'Login (SSO Google)'),
(2453, '2026-09-25 14:35:13', 18, 'INC-00004', 'Incidents', 'angelegt'),
(2454, '2026-09-25 14:35:48', 18, 'INC-00004', 'Incidents', 'geändert'),
(2455, '2026-09-25 14:36:47', 18, 'INC-00004', 'Incidents', 'Meldung NIS2 erfasst: Erstmeldung (Frühwarnung) an BSI – Meldestelle (Meldeportal)'),
(2456, '2026-09-25 16:37:24', 1, '', 'ISMS', 'Login'),
(2457, '2026-09-25 16:37:53', 18, '', 'ISMS', 'Login (SSO Google)'),
(2458, '2026-09-26 18:00:15', 1, '', 'ISMS', 'Login'),
(2459, '2026-09-27 18:02:26', 18, '', 'ISMS', 'Login (SSO Google)'),
(2460, '2026-09-29 06:04:43', 18, '', 'ISMS', 'Login (SSO Google)'),
(2461, '2026-09-30 18:03:20', 29, '', 'ISMS', 'Login'),
(2462, '2026-09-30 18:05:19', 18, '', 'ISMS', 'Login (SSO Google)'),
(2463, '2026-09-30 18:06:59', 0, '', 'ISMS', 'Fehlanmeldung (Benutzer nicht gefunden): alex@wolfisms.de'),
(2464, '2026-09-30 18:07:12', 0, '', 'ISMS', 'Fehlanmeldung (Benutzer nicht gefunden): alex@wolfisms.de'),
(2465, '2026-09-30 18:08:06', 0, '', 'ISMS', 'Fehlanmeldung (Benutzer nicht gefunden): alex@wolfisms.de'),
(2466, '2026-09-30 18:08:22', 29, '', 'ISMS', 'Login'),
(2467, '2026-09-30 18:09:22', 29, '', 'ISMS', 'Login'),
(2468, '2026-09-30 18:20:36', 29, '181', 'Dokument', 'zu Prüfen'),
(2469, '2026-10-01 13:12:53', 29, '', 'ISMS', 'Login'),
(2470, '2026-10-01 14:58:41', 18, 'RSK-00001', 'Risiken', 'geändert'),
(2471, '2026-10-01 14:59:07', 18, 'RSK-00008', 'Risiken', 'geändert'),
(2472, '2026-10-01 14:59:50', 18, 'RSK-00007', 'Risiken', 'geändert'),
(2473, '2026-10-01 15:44:09', 29, '', 'ISMS', 'Login'),
(2474, '2026-10-01 16:14:37', 18, 'DOK-00004', 'Dokumente', 'angelegt'),
(2475, '2026-10-01 16:15:41', 18, 'DOK-00004', 'Dokumente', 'KI-Bearbeitung vorgeschlagen'),
(2476, '2026-10-01 16:15:57', 18, 'DOK-00004', 'Dokumente', 'KI-Bearbeitung übernommen'),
(2477, '2026-10-01 16:22:20', 18, 'RSK-0014', 'Risiken', 'angelegt'),
(2478, '2026-10-01 16:23:20', 18, 'RSK-0014', 'Risiko', 'KI-Vorschlag erzeugt'),
(2479, '2026-10-01 16:26:52', 18, 'MAS-00014', 'Maßnahmen', 'per KI angelegt'),
(2480, '2026-10-01 16:26:52', 18, 'MAS-00015', 'Maßnahmen', 'per KI angelegt'),
(2481, '2026-10-01 16:26:52', 18, 'MAS-00016', 'Maßnahmen', 'per KI angelegt'),
(2482, '2026-10-01 16:26:52', 18, 'RSK-0014', 'Risiko', '6 Maßnahme(n) per KI verknüpft'),
(2483, '2026-10-01 16:26:52', 18, 'RSK-0014', 'Risiko', '5 Bedrohung(en) per KI verknüpft'),
(2484, '2026-10-01 16:26:52', 18, 'RSK-0014', 'Risiko', '6 Schwachstelle(n) per KI verknüpft'),
(2485, '2026-10-01 16:26:52', 18, 'RSK-0014', 'Risiko', '5 Asset(s) per KI verknüpft'),
(2486, '2026-10-01 16:26:52', 18, 'RSK-0014', 'Risiko', '1 Dokument(e) per KI verknüpft'),
(2487, '2026-10-01 16:26:52', 18, 'RSK-0014', 'Risiko', '8 Framework(s) per KI verknüpft'),
(2488, '2026-10-01 21:09:23', 29, '', 'ISMS', 'Login'),
(2489, '2026-10-02 06:21:22', 18, '', 'ISMS', 'Login (SSO Google)'),
(2490, '2026-10-03 05:23:57', 18, '', 'ISMS', 'Login (SSO Google)'),
(2491, '2026-10-03 05:35:44', 18, 'AST-00012', 'Assets', 'KI-Risikovorschlag erzeugt'),
(2492, '2026-10-03 05:36:05', 18, 'RSK-00001', 'Risiko', 'per KI mit Asset AST-00012 verknüpft'),
(2493, '2026-10-03 05:36:05', 18, 'RSK-00015', 'Risiko', 'per KI zu Asset AST-00012 angelegt'),
(2494, '2026-10-03 05:36:05', 18, 'RSK-00016', 'Risiko', 'per KI zu Asset AST-00012 angelegt'),
(2495, '2026-10-03 05:36:05', 18, 'RSK-00017', 'Risiko', 'per KI zu Asset AST-00012 angelegt'),
(2496, '2026-10-03 05:46:37', 18, 'AST-00012', 'Assets', 'KI-Schutzbedarfsvorschlag erzeugt'),
(2497, '2026-10-03 05:46:51', 18, 'AST-00012', 'Assets', 'Schutzbedarf per KI: Vertraulichkeit niedrig→hoch, Integrität niedrig→hoch, Verfügbarkeit niedrig→hoch, Authentizität niedrig→hoch'),
(2498, '2026-10-03 05:47:27', 18, 'AST-00012', 'Assets', 'geändert'),
(2499, '2026-10-03 05:48:11', 18, 'AST-00011', 'Assets', 'KI-Risikovorschlag erzeugt'),
(2500, '2026-10-03 05:48:26', 18, 'RSK-00007', 'Risiko', 'per KI mit Asset AST-00011 verknüpft'),
(2501, '2026-10-03 05:48:26', 18, 'RSK-00005', 'Risiko', 'per KI mit Asset AST-00011 verknüpft'),
(2502, '2026-10-03 05:48:26', 18, 'RSK-00012', 'Risiko', 'per KI mit Asset AST-00011 verknüpft'),
(2503, '2026-10-03 05:48:26', 18, 'RSK-00002', 'Risiko', 'per KI mit Asset AST-00011 verknüpft'),
(2504, '2026-10-03 05:48:26', 18, 'RSK-00018', 'Risiko', 'per KI zu Asset AST-00011 angelegt'),
(2505, '2026-10-03 05:48:26', 18, 'RSK-00019', 'Risiko', 'per KI zu Asset AST-00011 angelegt'),
(2506, '2026-10-03 05:48:26', 18, 'RSK-00020', 'Risiko', 'per KI zu Asset AST-00011 angelegt'),
(2507, '2026-10-03 05:48:26', 18, 'RSK-00021', 'Risiko', 'per KI zu Asset AST-00011 angelegt'),
(2508, '2026-10-03 05:48:26', 18, 'RSK-00022', 'Risiko', 'per KI zu Asset AST-00011 angelegt'),
(2509, '2026-10-03 05:48:26', 18, 'RSK-00023', 'Risiko', 'per KI zu Asset AST-00011 angelegt'),
(2510, '2026-10-03 05:48:36', 18, 'AST-00011', 'Assets', 'KI-Schutzbedarfsvorschlag erzeugt'),
(2511, '2026-10-03 05:48:44', 18, 'AST-00011', 'Assets', 'Schutzbedarf per KI: Vertraulichkeit –→hoch, Integrität –→hoch, Verfügbarkeit –→normal, Authentizität –→hoch'),
(2512, '2026-10-03 05:52:01', 18, 'AST-00011', 'Assets', 'KI-Schutzbedarfsvorschlag erzeugt'),
(2513, '2026-10-03 05:55:09', 18, 'AST-00037', 'Assets', 'KI-Risikovorschlag erzeugt'),
(2514, '2026-10-03 05:55:24', 18, 'RSK-00004', 'Risiko', 'per KI mit Asset AST-00037 verknüpft'),
(2515, '2026-10-03 05:55:24', 18, 'RSK-00022', 'Risiko', 'per KI mit Asset AST-00037 verknüpft'),
(2516, '2026-10-03 05:55:24', 18, 'RSK-00001', 'Risiko', 'per KI mit Asset AST-00037 verknüpft'),
(2517, '2026-10-03 05:55:24', 18, 'RSK-00015', 'Risiko', 'per KI mit Asset AST-00037 verknüpft'),
(2518, '2026-10-03 05:55:24', 18, 'RSK-00005', 'Risiko', 'per KI mit Asset AST-00037 verknüpft'),
(2519, '2026-10-03 05:55:24', 18, 'RSK-00020', 'Risiko', 'per KI mit Asset AST-00037 verknüpft'),
(2520, '2026-10-03 05:55:24', 18, 'RSK-00024', 'Risiko', 'per KI zu Asset AST-00037 angelegt'),
(2521, '2026-10-03 05:55:24', 18, 'RSK-00025', 'Risiko', 'per KI zu Asset AST-00037 angelegt'),
(2522, '2026-10-03 05:55:24', 18, 'RSK-00026', 'Risiko', 'per KI zu Asset AST-00037 angelegt'),
(2523, '2026-10-03 05:55:24', 18, 'RSK-00027', 'Risiko', 'per KI zu Asset AST-00037 angelegt'),
(2524, '2026-10-03 05:55:24', 18, 'RSK-00028', 'Risiko', 'per KI zu Asset AST-00037 angelegt'),
(2525, '2026-10-03 05:55:35', 18, 'AST-00037', 'Assets', 'KI-Schutzbedarfsvorschlag erzeugt'),
(2526, '2026-10-06 06:18:23', 18, '', 'ISMS', 'Login (SSO Google)'),
(2527, '2026-10-06 07:36:08', 18, 'Schulung-1', 'Personal', 'angelegt: Jahresschulung'),
(2528, '2026-10-06 07:36:15', 18, 'Schulung-1', 'Personal', '9 Teilnehmer zugewiesen: Jahresschulung'),
(2529, '2026-10-06 07:36:31', 18, 'Schulung-1', 'Personal', 'Teilnehmer entfernt: Admin, Admin'),
(2530, '2026-10-06 09:03:47', 18, '', 'ISMS', 'Login (SSO Google)'),
(2531, '2026-10-06 16:15:27', 29, '', 'ISMS', 'Login'),
(2532, '2026-10-06 16:16:56', 29, 'SOA-1', 'Dokumente', 'SoA v0.0 angelegt'),
(2533, '2026-10-06 16:17:06', 29, 'SOA-1', 'Dokumente', 'SoA v1.1 Entwurf aktualisiert'),
(2534, '2026-10-06 16:18:27', 29, 'SOA-1', 'Dokumente', 'SoA v1.2 Entwurf aktualisiert'),
(2535, '2026-10-06 16:38:37', 29, 'AST-00033', 'Assets', 'KI-Schutzbedarfsvorschlag erzeugt'),
(2536, '2026-10-06 16:38:58', 29, 'AST-00033', 'Assets', 'Schutzbedarf per KI: Vertraulichkeit –→normal, Integrität –→hoch, Verfügbarkeit –→normal, Authentizität –→hoch'),
(2537, '2026-10-06 16:39:39', 29, 'AST-00033', 'Assets', 'KI-Risikovorschlag erzeugt'),
(2538, '2026-10-06 17:09:30', 29, 'AST-00033', 'Assets', 'KI-Risikovorschlag erzeugt'),
(2539, '2026-10-06 17:11:35', 29, 'RSK-00002', 'Risiko', 'per KI mit Asset AST-00033 verknüpft'),
(2540, '2026-10-06 17:11:35', 29, 'RSK-00020', 'Risiko', 'per KI mit Asset AST-00033 verknüpft'),
(2541, '2026-10-06 17:11:35', 29, 'RSK-00024', 'Risiko', 'per KI mit Asset AST-00033 verknüpft'),
(2542, '2026-10-06 17:11:35', 29, 'RSK-00025', 'Risiko', 'per KI mit Asset AST-00033 verknüpft'),
(2543, '2026-10-06 17:11:35', 29, 'RSK-00027', 'Risiko', 'per KI mit Asset AST-00033 verknüpft'),
(2544, '2026-10-06 17:11:35', 29, 'RSK-00029', 'Risiko', 'per KI zu Asset AST-00033 angelegt'),
(2545, '2026-10-06 17:11:35', 29, 'RSK-00030', 'Risiko', 'per KI zu Asset AST-00033 angelegt'),
(2546, '2026-10-06 17:11:35', 29, 'RSK-00031', 'Risiko', 'per KI zu Asset AST-00033 angelegt'),
(2547, '2026-10-06 17:11:35', 29, 'RSK-00032', 'Risiko', 'per KI zu Asset AST-00033 angelegt'),
(2548, '2026-10-06 17:11:35', 29, 'RSK-00033', 'Risiko', 'per KI zu Asset AST-00033 angelegt'),
(2549, '2026-10-06 17:24:25', 29, 'DOK-00005', 'Dokumente', 'angelegt'),
(2550, '2026-10-06 17:26:12', 29, 'DOK-00005', 'Dokumente', 'KI-Bearbeitung vorgeschlagen'),
(2551, '2026-10-06 17:26:30', 29, 'DOK-00005', 'Dokumente', 'KI-Bearbeitung übernommen'),
(2552, '2026-10-06 17:48:47', 29, 'AST-00040', 'Assets', 'angelegt'),
(2553, '2026-10-06 17:49:35', 29, '', 'Schwachstellen', 'KI-Schwachstellenanalyse über 1 Asset(s) mit Internetrecherche: 3 Fund(e)'),
(2554, '2026-10-06 17:54:04', 29, 'WEA-00004', 'Schwachstellen', 'Schwachstelle per KI angelegt: CVE-2025-32463 – Sudo chroot Privilege Escalation (chwoot)'),
(2555, '2026-10-06 17:54:04', 29, 'WEA-00005', 'Schwachstellen', 'Schwachstelle per KI angelegt: CVE-2026-3888 – snapd Local Privilege Escalation via systemd-tmpfiles Race Condition'),
(2556, '2026-10-06 17:54:04', 29, 'WEA-00006', 'Schwachstellen', 'Schwachstelle per KI angelegt: CVE-2024-36347 – EntrySign - AMD Zen Microcode Signature Verification Bypass'),
(2557, '2026-10-06 17:56:03', 29, '29', 'Users', 'Abwesenheit 2026-10-05 bis 2026-10-07, Vertreter 6'),
(2558, '2026-10-06 18:00:02', 29, 'CHG-00003', 'Changes', 'Change angelegt: Richtlinie anpassen'),
(2559, '2026-10-06 18:02:59', 29, 'CHG-00003', 'Changes', 'Status Entwurf → Zurückgezogen'),
(2560, '2026-10-06 18:03:03', 29, 'CHG-00003', 'Changes', 'Status Zurückgezogen → Entwurf'),
(2561, '2026-10-06 18:03:29', 29, 'CHG-00003', 'Changes', 'Change geändert: Richtlinie anpassen'),
(2562, '2026-10-06 18:03:34', 29, 'CHG-00003', 'Changes', 'Status Entwurf → Eingereicht'),
(2563, '2026-10-06 18:03:53', 29, 'CHG-00003', 'Changes', 'Status Eingereicht → Zurückgezogen'),
(2564, '2026-10-07 10:42:10', 29, '', 'ISMS', 'Login'),
(2565, '2026-10-07 21:18:21', 29, '', 'ISMS', 'Login'),
(2566, '2026-10-08 22:48:26', 29, '', 'ISMS', 'Login'),
(2567, '2026-10-09 07:13:07', 18, '', 'ISMS', 'Login (SSO Google)'),
(2568, '2026-10-09 08:22:35', 18, 'LIF-00001', 'Lieferanten', 'geändert'),
(2569, '2026-10-09 14:51:10', 29, '', 'ISMS', 'Login'),
(2570, '2026-10-09 21:51:09', 18, '', 'ISMS', 'Login (SSO Google)'),
(2571, '2026-10-11 05:39:36', 18, '', 'ISMS', 'Login (SSO Google)'),
(2572, '2026-10-11 06:17:40', 18, '', 'ISMS', 'Setup-Assistent: 0 Prozess(e) angelegt'),
(2573, '2026-10-11 06:17:43', 18, '', 'ISMS', 'Setup-Assistent: 0 Prozess(e) angelegt'),
(2574, '2026-10-11 06:17:49', 18, '', 'ISMS', 'Setup-Assistent: 0 Prozess(e) angelegt'),
(2575, '2026-10-11 06:30:27', 18, '', 'ISMS', 'Setup-Assistent: 0 Prozess(e) angelegt'),
(2576, '2026-10-11 06:30:30', 18, '', 'ISMS', 'Setup-Assistent: 0 Prozess(e) angelegt'),
(2577, '2026-10-11 06:30:34', 18, '', 'ISMS', 'Setup-Assistent: 0 Prozess(e) angelegt'),
(2578, '2026-10-11 06:32:41', 1, '', 'ISMS', 'Login'),
(2579, '2026-10-11 06:33:39', 18, '', 'ISMS', 'Login (SSO Google)'),
(2580, '2026-10-11 06:40:53', 1, '', 'ISMS', 'Login'),
(2581, '2026-10-11 06:41:40', 18, '', 'ISMS', 'Login (SSO Google)'),
(2582, '2026-10-11 06:52:57', 18, '', 'ISMS', 'Setup-Assistent: Unternehmensbeschreibung ausgewertet'),
(2583, '2026-10-11 07:23:45', 18, 'DOK-00002', 'Dokumente', 'KI-Verknüpfungsvorschlag erzeugt'),
(2584, '2026-10-11 07:24:06', 18, 'DOK-00002', 'Dokumente', 'per KI verknüpft: 10 Control(s), 4 Dokument(e), 6 Maßnahme(n)'),
(2585, '2026-10-11 07:24:57', 1, '', 'ISMS', 'Login'),
(2586, '2026-10-11 07:25:20', 18, '', 'ISMS', 'Login (SSO Google)'),
(2587, '2026-10-11 07:25:36', 0, '', 'ISMS', 'Login'),
(2588, '2026-10-11 07:26:17', 18, '', 'ISMS', 'Login (SSO Google)'),
(2589, '2026-10-11 07:26:50', 18, 'DOK-00002', 'Dokumente', 'KI-Verknüpfungsvorschlag erzeugt'),
(2590, '2026-10-11 07:32:47', 18, 'AST-00040', 'Assets', 'KI-Risikovorschlag erzeugt'),
(2591, '2026-10-11 07:33:07', 18, 'RSK-00026', 'Risiko', 'per KI mit Asset AST-00040 verknüpft'),
(2592, '2026-10-11 07:33:07', 18, 'RSK-00027', 'Risiko', 'per KI mit Asset AST-00040 verknüpft'),
(2593, '2026-10-11 07:33:07', 18, 'RSK-00024', 'Risiko', 'per KI mit Asset AST-00040 verknüpft'),
(2594, '2026-10-11 07:33:07', 18, 'RSK-00025', 'Risiko', 'per KI mit Asset AST-00040 verknüpft'),
(2595, '2026-10-11 07:33:07', 18, 'RSK-00028', 'Risiko', 'per KI mit Asset AST-00040 verknüpft'),
(2596, '2026-10-11 07:33:07', 18, 'RSK-00034', 'Risiko', 'per KI zu Asset AST-00040 angelegt'),
(2597, '2026-10-11 07:33:07', 18, 'RSK-00035', 'Risiko', 'per KI zu Asset AST-00040 angelegt'),
(2598, '2026-10-11 07:33:07', 18, 'RSK-00036', 'Risiko', 'per KI zu Asset AST-00040 angelegt'),
(2599, '2026-10-11 07:33:07', 18, 'RSK-00037', 'Risiko', 'per KI zu Asset AST-00040 angelegt'),
(2600, '2026-10-11 07:33:07', 18, 'RSK-00038', 'Risiko', 'per KI zu Asset AST-00040 angelegt'),
(2601, '2026-10-11 07:33:07', 18, 'RSK-00039', 'Risiko', 'per KI zu Asset AST-00040 angelegt'),
(2602, '2026-10-11 07:37:11', 0, '', 'ISMS', 'Login'),
(2603, '2026-10-11 07:40:24', 18, '', 'ISMS', 'Login (SSO Google)'),
(2604, '2026-10-11 10:31:41', 0, '', 'ISMS', 'Login'),
(2605, '2026-10-11 10:32:12', 18, '', 'ISMS', 'Login (SSO Google)'),
(2606, '2026-10-11 10:44:39', 0, '', 'ISMS', 'Login'),
(2607, '2026-10-11 10:45:50', 1, '', 'ISMS', 'Login'),
(2608, '2026-10-11 10:53:19', 18, '', 'ISMS', 'Login (SSO Google)'),
(2609, '2026-10-11 10:53:45', 0, '', 'ISMS', 'Login'),
(2610, '2026-10-11 10:53:57', 18, '', 'ISMS', 'Login (SSO Google)'),
(2611, '2026-10-11 17:16:50', 18, 'RSK-00039', 'Risiko', 'KI-Vorschlag erzeugt'),
(2612, '2026-10-11 17:42:53', 18, 'RSK-00039', 'Risiko', 'KI-Vorschlag erzeugt'),
(2613, '2026-10-11 17:43:57', 18, 'RSK-00039', 'Risiko', 'KI-Vorschlag erzeugt'),
(2614, '2026-10-11 17:44:19', 18, 'RSK-00039', 'Risiko', '2 Freitextfeld(er) per KI überarbeitet'),
(2615, '2026-10-11 17:45:13', 18, 'RSK-00039', 'Risiken', 'geändert'),
(2616, '2026-10-12 15:29:53', 29, '', 'ISMS', 'Login'),
(2617, '2026-10-12 15:30:58', 29, '', 'ISMS', 'Setup-Assistent: Unternehmensbeschreibung ausgewertet'),
(2618, '2026-10-12 15:32:33', 29, '', 'ISMS', 'Setup-Assistent: Unternehmensbeschreibung ausgewertet'),
(2619, '2026-10-12 15:33:05', 29, '', 'ISMS', 'Setup-Assistent: Schritt ki_unternehmen uebersprungen'),
(2620, '2026-10-13 06:00:43', 18, '', 'ISMS', 'Login (SSO Google)'),
(2621, '2026-10-13 06:15:14', 18, '183', 'Dokument', 'zu Prüfen'),
(2622, '2026-10-13 06:15:19', 18, '183', 'Dokument', 'geprüft'),
(2623, '2026-10-13 06:15:21', 18, '183', 'Dokument', 'freigegeben'),
(2624, '2026-10-13 06:15:33', 18, 'DOK-00002', 'Dokumente', 'Lesepflicht geändert (12 Rollen)'),
(2625, '2026-10-13 06:45:25', 1, '', 'ISMS', 'Login'),
(2626, '2026-10-13 07:18:22', 1, 'AST-00040', 'Assets', 'KI-Schutzbedarfsvorschlag erzeugt'),
(2627, '2026-10-13 07:18:42', 1, 'AST-00040', 'Assets', 'Schutzbedarf per KI: Integrität normal→hoch, Authentizität normal→hoch'),
(2628, '2026-10-13 07:34:06', 1, 'AST-00040', 'Assets', 'KI-Schutzbedarfsvorschlag erzeugt'),
(2629, '2026-10-13 07:34:19', 1, 'AST-00040', 'Assets', 'Schutzbedarf per KI: Begründung als Bemerkung: Vertraulichkeit, Integrität, Verfügbarkeit, Authentizität'),
(2630, '2026-10-13 08:10:25', 18, '', 'ISMS', 'Login (SSO Google)'),
(2631, '2026-10-13 09:05:28', 1, '', 'ISMS', 'Login'),
(2632, '2026-10-13 10:23:44', 29, '', 'ISMS', 'Login'),
(2633, '2026-10-13 10:26:09', 29, '', 'ISMS', 'Setup-Assistent: Schritt ki_unternehmen uebersprungen'),
(2634, '2026-10-13 11:09:52', 18, '', 'ISMS', 'Setup-Assistent: Unternehmensbeschreibung ausgewertet'),
(2635, '2026-10-13 11:10:16', 18, '', 'ISMS', 'Setup-Assistent: Fortschritt master_ki zurueckgesetzt'),
(2636, '2026-10-13 11:30:06', 18, '', 'ISMS', 'Setup-Assistent: Unternehmensbeschreibung ausgewertet'),
(2637, '2026-10-13 11:30:21', 18, '', 'ISMS', 'Setup-Assistent: Fortschritt master_ki zurueckgesetzt'),
(2638, '2026-10-13 11:54:05', 0, '', 'ISMS', 'Login'),
(2639, '2026-10-13 11:58:08', 18, '', 'ISMS', 'Login (SSO Google)'),
(2640, '2026-10-13 13:01:01', 18, 'AST-00040', 'Assets', 'geändert'),
(2641, '2026-10-13 13:01:11', 18, 'AST-00040', 'Assets', 'KI-Schutzbedarfsvorschlag erzeugt'),
(2642, '2026-10-13 13:01:16', 18, 'AST-00040', 'Assets', 'Schutzbedarf per KI: Verfügbarkeit niedrig→hoch; Begründung als Bemerkung: Verfügbarkeit'),
(2643, '2026-10-13 13:01:45', 18, 'AST-00040', 'Assets', 'geändert'),
(2644, '2026-10-13 13:02:25', 18, 'AST-00040', 'Assets', 'geändert'),
(2645, '2026-10-13 13:10:48', 18, 'LIF-00024', 'Lieferanten', 'geändert'),
(2646, '2026-10-13 14:53:55', 0, '', 'ISMS', 'Login'),
(2647, '2026-10-13 15:53:11', 18, '', 'ISMS', 'Login (SSO Google)'),
(2648, '2026-10-14 02:52:40', 18, '', 'ISMS', 'Login (SSO Google)'),
(2649, '2026-10-14 03:19:06', 18, '', 'ISMS', 'Setup-Assistent: Fortschritt master_ki zurueckgesetzt'),
(2650, '2026-10-14 03:57:35', 29, '', 'ISMS', 'Login'),
(2651, '2026-10-14 03:57:48', 29, '', 'ISMS', 'Login'),
(2652, '2026-10-14 05:56:01', 18, '', 'ISMS', 'Setup-Assistent: Fortschritt master_ki zurueckgesetzt'),
(2653, '2026-10-14 08:59:54', 29, '', 'ISMS', 'Login'),
(2654, '2026-10-14 09:38:26', 29, 'RSK-00025', 'Risiko', 'KI-Vorschlag erzeugt'),
(2655, '2026-10-14 09:43:51', 29, 'RSK-00025', 'Risiko', '2 Freitextfeld(er) per KI überarbeitet'),
(2656, '2026-10-14 09:43:51', 29, 'MAS-00017', 'Maßnahmen', 'per KI angelegt'),
(2657, '2026-10-14 09:43:51', 29, 'MAS-00018', 'Maßnahmen', 'per KI angelegt'),
(2658, '2026-10-14 09:43:51', 29, 'MAS-00019', 'Maßnahmen', 'per KI angelegt'),
(2659, '2026-10-14 09:43:51', 29, 'MAS-00020', 'Maßnahmen', 'per KI angelegt'),
(2660, '2026-10-14 09:43:51', 29, 'RSK-00025', 'Risiko', '4 Maßnahme(n) per KI verknüpft'),
(2661, '2026-10-14 09:43:51', 29, 'RSK-00025', 'Risiko', '3 Bedrohung(en) per KI verknüpft'),
(2662, '2026-10-14 09:43:51', 29, 'RSK-00025', 'Risiko', '6 Schwachstelle(n) per KI verknüpft'),
(2663, '2026-10-14 09:43:51', 29, 'RSK-00025', 'Risiko', '3 Asset(s) per KI verknüpft');
INSERT INTO `activities` (`id`, `datumuhrzeit`, `user`, `nummer`, `bereich`, `was`) VALUES
(2664, '2026-10-14 09:43:51', 29, 'RSK-00025', 'Risiko', '1 Dokument(e) per KI verknüpft'),
(2665, '2026-10-14 09:43:51', 29, 'RSK-00025', 'Risiko', '6 Control(s) per KI verknüpft'),
(2666, '2026-10-14 09:50:41', 29, '', 'ISMS', 'Setup-Assistent (KI-Dialog): Block normen uebernommen'),
(2667, '2026-10-14 09:56:30', 29, 'DOK-00006', 'Dokumente', 'angelegt'),
(2668, '2026-10-14 09:58:11', 29, 'DOK-00006', 'Dokumente', 'KI-Bearbeitung vorgeschlagen'),
(2669, '2026-10-14 09:58:18', 29, 'DOK-00006', 'Dokumente', 'KI-Bearbeitung übernommen'),
(2670, '2026-10-14 10:02:47', 29, 'AUD-00006', 'Audit', 'Audit angelegt: Assessnebt'),
(2671, '2026-10-14 10:03:15', 29, 'AUD-00006', 'Audit', 'Prüfliste aufgebaut: 93 Anforderung(en) aus ISO/IEC 27001:2022'),
(2672, '2026-10-14 10:05:09', 29, 'AUD-00006', 'Audit', 'Audit geändert: Assessnebt'),
(2673, '2026-10-14 10:15:03', 29, '', 'Schwachstellen', 'KI-Schwachstellenanalyse über 1 Asset(s) mit Internetrecherche: 3 Fund(e)'),
(2674, '2026-10-15 19:49:04', 1, '', 'ISMS', 'Fehlanmeldung (falsches Passwort): wolfgang@schuster.ws'),
(2675, '2026-10-15 19:49:15', 1, '', 'ISMS', 'Login'),
(2676, '2026-10-15 19:51:29', 1, '', 'ISMS', 'Login'),
(2677, '2026-10-15 19:51:30', 1, '', 'ISMS', 'Login'),
(2678, '2026-10-15 19:51:56', 1, '', 'ISMS', 'Login'),
(2679, '2026-10-15 19:51:57', 1, '', 'ISMS', 'Login'),
(2680, '2026-10-16 14:20:53', 18, 'SOA-0002', 'Dokumente', 'angelegt (Risikobehandlungsplan)'),
(2681, '2026-10-16 14:34:05', 18, 'RBP-0002', 'Dokumente', 'geändert'),
(2682, '2026-10-17 05:59:45', 18, 'AST-00041', 'Assets', 'angelegt'),
(2683, '2026-10-17 06:12:36', 18, 'CHG-00003', 'Changes', 'Status Zurückgezogen → Entwurf'),
(2684, '2026-10-17 07:00:31', 18, 'AST-00042', 'Assets', 'angelegt'),
(2685, '2026-10-17 07:04:15', 18, 'PRJ-00002', 'Projekte', 'geändert'),
(2686, '2026-10-18 06:20:50', 18, 'DOK-00005', 'Dokumente', 'KI-Übersetzung vorgeschlagen'),
(2687, '2026-10-18 06:21:02', 18, 'DOK-00005', 'Dokumente', 'KI-Übersetzung übernommen'),
(2688, '2026-10-18 14:43:10', 1, '', 'ISMS', 'Login'),
(2689, '2026-10-18 14:43:53', 18, '', 'ISMS', 'Login (SSO Google)'),
(2690, '2026-10-18 16:38:57', 1, '', 'ISMS', 'Login'),
(2691, '2026-10-18 16:38:59', 1, '', 'ISMS', 'Login'),
(2692, '2026-10-18 16:44:58', 1, '', 'ISMS', 'Login'),
(2693, '2026-10-18 19:00:46', 1, '', 'ISMS', 'Login'),
(2694, '2026-10-18 19:01:03', 0, '', 'ISMS', 'Login'),
(2695, '2026-10-19 12:36:10', 18, 'RBP-0002', 'Dokumente', 'KI-Übersetzung vorgeschlagen'),
(2696, '2026-10-19 12:36:19', 18, 'RBP-0002', 'Dokumente', 'KI-Übersetzung übernommen'),
(2697, '2026-10-19 12:44:37', 18, 'CHG-00001', 'Changes', 'Status Entwurf → Eingereicht'),
(2698, '2026-10-19 12:44:48', 18, 'CHG-00001', 'Changes', 'Freigabe zugestimmt'),
(2699, '2026-10-19 17:59:44', 1, '', 'ISMS', 'Login'),
(2700, '2026-10-19 18:01:43', 1, 'RSK-00033', 'Risiko', 'KI-Vorschlag erzeugt'),
(2701, '2026-10-19 18:20:46', 18, '', 'ISMS', 'Login (SSO Google)'),
(2702, '2026-10-20 07:46:58', 18, 'API-Test', 'Admin', 'API-Key angelegt'),
(2703, '2026-10-20 08:07:29', 29, '', 'ISMS', 'Login'),
(2704, '2026-10-20 08:34:29', 18, '', 'ISMS', 'Login (SSO Google)'),
(2705, '2026-10-21 14:28:42', 1, '', 'ISMS', 'Login'),
(2706, '2026-10-21 14:29:22', 0, '', 'ISMS', 'Login'),
(2707, '2026-10-21 14:32:48', 30, '', 'ISMS', 'Login'),
(2708, '2026-10-21 14:46:12', 0, '', 'ISMS', 'Login'),
(2709, '2026-10-21 14:48:35', 1, '', 'ISMS', 'Login'),
(2710, '2026-10-22 09:43:02', 18, '', 'ISMS', 'Login (SSO Google)'),
(2711, '2026-10-22 10:10:18', 29, '', 'ISMS', 'Login'),
(2712, '2026-10-23 11:34:23', 1, '', 'ISMS', 'Login'),
(2713, '2026-10-23 14:04:01', 18, '', 'ISMS', 'Setup-Assistent: Fortschritt master_ki zurueckgesetzt'),
(2714, '2026-10-23 14:10:26', 29, '', 'ISMS', 'Login'),
(2715, '2026-10-23 15:10:57', 29, '', 'ISMS', 'Login'),
(2716, '2026-10-24 07:29:32', 18, 'DOK-00005', 'Dokumente', 'KI-Verknüpfungsvorschlag erzeugt'),
(2717, '2026-10-24 07:30:20', 18, 'DOK-00005', 'Dokumente', 'KI-Verknüpfungsvorschlag erzeugt'),
(2718, '2026-10-24 07:30:31', 18, 'DOK-00005', 'Dokumente', 'per KI verknüpft: 10 Control(s)'),
(2719, '2026-10-25 06:18:41', 18, 'DOK-00006', 'Dokumente', 'KI-Bearbeitung vorgeschlagen'),
(2720, '2026-10-25 06:19:01', 18, 'DOK-00006', 'Dokumente', 'KI-Bearbeitung übernommen'),
(2721, '2026-10-25 06:48:28', 18, 'AUD-00006', 'Audit', 'Audit geändert: Assessment'),
(2722, '2026-10-25 07:12:23', 1, '', 'ISMS', 'Login'),
(2723, '2026-10-25 10:57:17', 1, '', 'ISMS', 'Login'),
(2724, '2026-10-25 10:59:10', 1, '', 'ISMS', 'Login'),
(2725, '2026-10-25 11:01:36', 1, '', 'ISMS', 'SSO-Einstellungen geändert (Quelle: Datenbank)'),
(2726, '2026-10-25 11:01:43', 18, '', 'ISMS', 'Login (SSO Google)'),
(2727, '2026-10-25 11:03:52', 18, '', 'ISMS', 'Login (SSO Google)'),
(2728, '2026-10-25 11:38:03', 18, '', 'ISMS', 'Setup-Assistent: Daten master_ki geloescht: Ziele und Scope (Texte) (1), Risikoappetit (1), Kontextprofil (KI) (3), KI-Beratergespräch (Dialogstand) (1)'),
(2729, '2026-10-26 15:03:15', 18, '', 'ISMS', 'Login (SSO Google)'),
(2730, '2026-10-26 17:42:16', 18, 'AST-00042', 'Assets', 'geändert'),
(2731, '2026-10-26 20:33:31', 29, '', 'ISMS', 'Login'),
(2732, '2026-10-26 21:29:04', 29, 'AST-00043', 'Assets', 'angelegt (KI-Assistent)'),
(2733, '2026-10-26 21:29:52', 29, 'AST-00043', 'Assets', 'KI-Assistent: Lieferanten verknüpft (1)'),
(2734, '2026-10-26 21:31:41', 29, 'RSK-00004', 'Risiko', 'per KI mit Asset AST-00043 verknüpft'),
(2735, '2026-10-26 21:31:41', 29, 'RSK-00024', 'Risiko', 'per KI mit Asset AST-00043 verknüpft'),
(2736, '2026-10-26 21:31:41', 29, 'RSK-00026', 'Risiko', 'per KI mit Asset AST-00043 verknüpft'),
(2737, '2026-10-26 21:31:41', 29, 'RSK-00027', 'Risiko', 'per KI mit Asset AST-00043 verknüpft'),
(2738, '2026-10-26 21:31:41', 29, 'RSK-00025', 'Risiko', 'per KI mit Asset AST-00043 verknüpft'),
(2739, '2026-10-26 21:31:41', 29, 'RSK-00037', 'Risiko', 'per KI mit Asset AST-00043 verknüpft'),
(2740, '2026-10-26 21:31:41', 29, 'RSK-00028', 'Risiko', 'per KI mit Asset AST-00043 verknüpft'),
(2741, '2026-10-26 21:31:41', 29, 'RSK-00040', 'Risiko', 'per KI zu Asset AST-00043 angelegt'),
(2742, '2026-10-26 21:31:41', 29, 'RSK-00041', 'Risiko', 'per KI zu Asset AST-00043 angelegt'),
(2743, '2026-10-26 21:31:41', 29, 'RSK-00042', 'Risiko', 'per KI zu Asset AST-00043 angelegt'),
(2744, '2026-10-26 21:31:41', 29, 'RSK-00043', 'Risiko', 'per KI zu Asset AST-00043 angelegt'),
(2745, '2026-10-26 21:31:41', 29, 'RSK-00044', 'Risiko', 'per KI zu Asset AST-00043 angelegt'),
(2746, '2026-10-26 21:31:41', 29, 'RSK-00045', 'Risiko', 'per KI zu Asset AST-00043 angelegt'),
(2747, '2026-10-26 21:31:41', 29, 'RSK-00046', 'Risiko', 'per KI zu Asset AST-00043 angelegt'),
(2748, '2026-10-26 21:31:41', 29, 'RSK-00047', 'Risiko', 'per KI zu Asset AST-00043 angelegt'),
(2749, '2026-10-26 21:32:52', 29, 'AST-00043', 'Assets', 'KI-Assistent: Maßnahmen (über die Risiken) verknüpft (20)'),
(2750, '2026-10-26 21:33:07', 29, 'AST-00043', 'Assets', 'KI-Assistent: Schwachstellen verknüpft (3)'),
(2751, '2026-10-26 21:33:25', 29, 'AST-00043', 'Assets', 'KI-Assistent: Controls verknüpft (9)'),
(2752, '2026-10-27 02:40:00', 18, '', 'ISMS', 'Login (SSO Google)'),
(2753, '2026-10-27 02:49:32', 18, 'AST-00001', 'Assets', 'geändert'),
(2754, '2026-10-27 02:54:35', 18, 'AST-00044', 'Assets', 'angelegt (KI-Assistent)'),
(2755, '2026-10-27 02:55:12', 18, '', 'Assets', 'Asset angelegt: macOS'),
(2756, '2026-10-27 02:55:12', 18, '', 'Assets', 'Asset angelegt: FileVault-Festplattenverschlüsselung'),
(2757, '2026-10-27 02:55:12', 18, 'AST-00044', 'Assets', 'KI-Assistent: Untergeordnete Assets (OBASHI) verknüpft (5)'),
(2758, '2026-10-27 02:55:55', 18, 'LIF-00025', 'Lieferanten', 'angelegt (KI-Assistent)'),
(2759, '2026-10-27 02:55:55', 18, 'AST-00044', 'Assets', 'KI-Assistent: Lieferanten verknüpft (2)'),
(2760, '2026-10-27 02:57:13', 18, 'RSK-00007', 'Risiko', 'per KI mit Asset AST-00044 verknüpft'),
(2761, '2026-10-27 02:57:13', 18, 'RSK-00018', 'Risiko', 'per KI mit Asset AST-00044 verknüpft'),
(2762, '2026-10-27 02:57:13', 18, 'RSK-00019', 'Risiko', 'per KI mit Asset AST-00044 verknüpft'),
(2763, '2026-10-27 02:57:13', 18, 'RSK-00021', 'Risiko', 'per KI mit Asset AST-00044 verknüpft'),
(2764, '2026-10-27 02:57:13', 18, 'RSK-00022', 'Risiko', 'per KI mit Asset AST-00044 verknüpft'),
(2765, '2026-10-27 02:57:13', 18, 'RSK-00020', 'Risiko', 'per KI mit Asset AST-00044 verknüpft'),
(2766, '2026-10-27 02:57:13', 18, 'RSK-00005', 'Risiko', 'per KI mit Asset AST-00044 verknüpft'),
(2767, '2026-10-27 02:57:13', 18, 'RSK-00048', 'Risiko', 'per KI zu Asset AST-00044 angelegt'),
(2768, '2026-10-27 02:57:13', 18, 'RSK-00049', 'Risiko', 'per KI zu Asset AST-00044 angelegt'),
(2769, '2026-10-27 02:57:13', 18, 'RSK-00050', 'Risiko', 'per KI zu Asset AST-00044 angelegt'),
(2770, '2026-10-27 02:57:13', 18, 'RSK-00051', 'Risiko', 'per KI zu Asset AST-00044 angelegt'),
(2771, '2026-10-27 02:57:13', 18, 'RSK-00052', 'Risiko', 'per KI zu Asset AST-00044 angelegt'),
(2772, '2026-10-27 02:57:13', 18, 'RSK-00053', 'Risiko', 'per KI zu Asset AST-00044 angelegt'),
(2773, '2026-10-27 02:57:51', 18, 'AST-00044', 'Assets', 'KI-Assistent: Maßnahmen (über die Risiken) verknüpft (20)'),
(2774, '2026-10-27 02:58:00', 18, 'AST-00044', 'Assets', 'KI-Assistent: Controls verknüpft (8)'),
(2775, '2026-10-27 02:58:13', 18, 'AST-00044', 'Assets', 'KI-Assistent: Incidents verknüpft (2)'),
(2776, '2026-10-27 03:00:53', 18, 'AST-00045', 'Assets', 'geändert (KI-Assistent)'),
(2777, '2026-10-27 03:12:25', 18, 'RSK-00051', 'Risiken', 'geändert (KI-Assistent)'),
(2778, '2026-10-27 03:12:52', 18, 'RSK-00051', 'Risiken', 'KI-Assistent: Bedrohungen verknüpft (3)'),
(2779, '2026-10-27 03:12:59', 18, 'RSK-00051', 'Risiken', 'KI-Assistent: Schwachstellen (Katalog) verknüpft (3)'),
(2780, '2026-10-27 03:13:33', 18, 'MAS-00021', 'Maßnahmen', 'angelegt (KI-Assistent)'),
(2781, '2026-10-27 03:13:33', 18, 'MAS-00022', 'Maßnahmen', 'angelegt (KI-Assistent)'),
(2782, '2026-10-27 03:13:33', 18, 'MAS-00023', 'Maßnahmen', 'angelegt (KI-Assistent)'),
(2783, '2026-10-27 03:13:33', 18, 'MAS-00024', 'Maßnahmen', 'angelegt (KI-Assistent)'),
(2784, '2026-10-27 03:13:33', 18, 'MAS-00025', 'Maßnahmen', 'angelegt (KI-Assistent)'),
(2785, '2026-10-27 03:13:33', 18, 'RSK-00051', 'Risiken', 'KI-Assistent: Maßnahmen verknüpft (8)'),
(2786, '2026-10-27 03:13:38', 18, 'RSK-00051', 'Risiken', 'KI-Assistent: Lieferanten verknüpft (2)'),
(2787, '2026-10-27 03:13:41', 18, 'RSK-00051', 'Risiken', 'KI-Assistent: Controls verknüpft (4)'),
(2788, '2026-10-27 03:13:43', 18, 'RSK-00051', 'Risiken', 'KI-Assistent: Dokumente verknüpft (1)'),
(2789, '2026-10-27 03:14:02', 18, 'RSK-00051', 'Risiken', 'Restrisiko bewertet (KI-Assistent)'),
(2790, '2026-10-27 06:37:57', 1, '', 'ISMS', 'Login'),
(2791, '2026-10-27 11:36:31', 29, 'LIF-00025', 'Lieferanten', 'geändert'),
(2792, '2026-10-27 11:37:26', 29, 'LIF-00025', 'Lieferanten', 'Fragebogen-PDF bereitgestellt'),
(2793, '2026-10-27 11:39:29', 29, '89', 'Lieferanten', 'Fragebogen gelöscht'),
(2794, '2026-10-27 11:39:37', 29, 'LIF-00025', 'Lieferanten', 'Fragebogen-Erfassung begonnen'),
(2795, '2026-10-27 17:17:25', 29, '', 'ISMS', 'Login'),
(2796, '2026-10-28 02:00:22', 18, '', 'ISMS', 'Login (SSO Google)'),
(2797, '2026-10-28 12:15:19', 29, '', 'ISMS', 'Login'),
(2798, '2026-10-28 12:25:38', 29, 'AST-00047', 'Assets', 'angelegt (KI-Assistent)'),
(2799, '2026-10-28 12:26:55', 29, '', 'Assets', 'Asset angelegt: Mobile-Device-Management (MDM)'),
(2800, '2026-10-28 12:26:55', 29, '', 'Assets', 'Asset angelegt: Mobilfunkanschluss Geschäftsführung'),
(2801, '2026-10-28 12:26:55', 29, 'AST-00047', 'Assets', 'KI-Assistent: Untergeordnete Assets (OBASHI) verknüpft (4)'),
(2802, '2026-10-28 12:30:35', 29, 'AST-00047', 'Assets', 'KI-Assistent: Lieferanten verknüpft (3)'),
(2803, '2026-10-28 12:32:17', 29, 'RSK-00019', 'Risiko', 'per KI mit Asset AST-00047 verknüpft'),
(2804, '2026-10-28 12:32:17', 29, 'RSK-00050', 'Risiko', 'per KI mit Asset AST-00047 verknüpft'),
(2805, '2026-10-28 12:32:17', 29, 'RSK-00054', 'Risiko', 'per KI zu Asset AST-00047 angelegt'),
(2806, '2026-10-28 12:32:17', 29, 'RSK-00055', 'Risiko', 'per KI zu Asset AST-00047 angelegt'),
(2807, '2026-10-28 12:32:17', 29, 'RSK-00056', 'Risiko', 'per KI zu Asset AST-00047 angelegt'),
(2808, '2026-10-28 12:32:17', 29, 'RSK-00057', 'Risiko', 'per KI zu Asset AST-00047 angelegt'),
(2809, '2026-10-28 12:32:17', 29, 'RSK-00058', 'Risiko', 'per KI zu Asset AST-00047 angelegt'),
(2810, '2026-10-28 12:32:17', 29, 'RSK-00059', 'Risiko', 'per KI zu Asset AST-00047 angelegt'),
(2811, '2026-10-28 12:32:57', 29, 'AST-00047', 'Assets', 'KI-Assistent: Maßnahmen (über die Risiken) verknüpft (16)'),
(2812, '2026-10-28 12:33:12', 29, 'AST-00047', 'Assets', 'KI-Assistent: Controls verknüpft (9)'),
(2813, '2026-10-29 02:11:50', 18, '', 'ISMS', 'Login (SSO Google)');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `api_keys`
--

CREATE TABLE `api_keys` (
  `id` int(10) UNSIGNED NOT NULL,
  `key_hash` varchar(64) NOT NULL,
  `beschreibung` varchar(255) DEFAULT NULL,
  `aktiv` tinyint(1) NOT NULL DEFAULT 1,
  `erstellt` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `Assets`
--

CREATE TABLE `Assets` (
  `id` int(11) UNSIGNED NOT NULL,
  `Nummer` varchar(16) DEFAULT NULL,
  `Name` varchar(64) DEFAULT NULL,
  `Beschreibung` text DEFAULT NULL,
  `Besitzer` int(11) UNSIGNED DEFAULT NULL,
  `Abteilung` varchar(64) DEFAULT NULL,
  `Typ` varchar(64) DEFAULT NULL,
  `Kategorie` varchar(64) DEFAULT NULL,
  `Status` varchar(64) DEFAULT NULL,
  `Kritik` varchar(64) DEFAULT NULL,
  `Person` tinyint(1) DEFAULT 0,
  `Klassifizierung` varchar(64) DEFAULT NULL,
  `Ersteller` int(11) UNSIGNED DEFAULT 0,
  `Erstelldatum` date NOT NULL DEFAULT current_timestamp(),
  `Änderer` int(11) UNSIGNED DEFAULT 0,
  `Änderdatum` date DEFAULT current_timestamp(),
  `Datum` date DEFAULT current_timestamp(),
  `Reviewer` int(10) UNSIGNED DEFAULT 0,
  `review` date NOT NULL DEFAULT current_timestamp(),
  `archiviert` tinyint(1) NOT NULL DEFAULT 0,
  `Vertraulichkeit` varchar(255) DEFAULT NULL,
  `Integrität` varchar(255) DEFAULT NULL,
  `Verfügbarkeit` varchar(255) DEFAULT NULL,
  `tochter` varchar(255) DEFAULT NULL,
  `asset_typ` varchar(100) DEFAULT NULL,
  `betroffene_personen` varchar(500) DEFAULT NULL,
  `art_pbd` varchar(500) DEFAULT NULL,
  `datenhaltung` varchar(100) DEFAULT NULL,
  `besondere_pbd` tinyint(1) DEFAULT 0,
  `Wert` varchar(255) DEFAULT NULL,
  `Authentizität` varchar(255) DEFAULT NULL,
  `Name_en` text DEFAULT NULL,
  `Beschreibung_en` text DEFAULT NULL,
  `abteilung_id` int(11) DEFAULT NULL,
  `normen` varchar(256) DEFAULT NULL COMMENT 'Kommagetrennte IDs verknüpfter Normen (aus Tabelle Normen)',
  `sync` tinyint(1) DEFAULT NULL,
  `synctime` datetime DEFAULT NULL,
  `Version` varchar(64) DEFAULT NULL,
  `vererbung_aus` tinyint(1) NOT NULL DEFAULT 0,
  `vererbung_grund` text DEFAULT NULL,
  `rto_stunden` int(11) DEFAULT NULL,
  `rpo_stunden` int(11) DEFAULT NULL,
  `maz_stunden` int(11) DEFAULT NULL,
  `bem_vertraulichkeit` text DEFAULT NULL,
  `bem_integritaet` text DEFAULT NULL,
  `bem_verfuegbarkeit` text DEFAULT NULL,
  `bem_authentizitaet` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `asset_art_pbd`
--

CREATE TABLE `asset_art_pbd` (
  `id` int(11) NOT NULL,
  `art` varchar(150) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `asset_art_pbd`
--

INSERT INTO `asset_art_pbd` (`id`, `art`) VALUES
(4, 'Abrechnungsdaten'),
(2, 'Kontaktdaten'),
(1, 'Stammdaten'),
(3, 'Vertragsdaten');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `asset_betroffene_personen`
--

CREATE TABLE `asset_betroffene_personen` (
  `id` int(11) NOT NULL,
  `bezeichnung` varchar(150) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `asset_betroffene_personen`
--

INSERT INTO `asset_betroffene_personen` (`id`, `bezeichnung`) VALUES
(4, 'Bewerber'),
(5, 'externe Partner'),
(2, 'Kunden'),
(3, 'Lieferanten'),
(1, 'Mitarbeitende');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `asset_datenhaltung`
--

CREATE TABLE `asset_datenhaltung` (
  `id` int(11) NOT NULL,
  `datenhaltung` varchar(150) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `asset_datenhaltung`
--

INSERT INTO `asset_datenhaltung` (`id`, `datenhaltung`) VALUES
(2, 'Cloud EU'),
(3, 'Cloud Nicht-EU'),
(4, 'Hybrid'),
(1, 'On-Prem');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `asset_kategorie`
--

CREATE TABLE `asset_kategorie` (
  `id` int(10) UNSIGNED NOT NULL,
  `Kategorie` varchar(128) NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `asset_kategorie`
--

INSERT INTO `asset_kategorie` (`id`, `Kategorie`) VALUES
(1, 'Daten - Informationswerte'),
(16, 'O – Ownership (Eigentümerschaft)'),
(17, 'B – Business Process (Geschäftsprozess)'),
(18, 'A – Application (Anwendung)'),
(19, 'S – System'),
(20, 'H – Hardware'),
(21, 'I – Infrastructure (Infrastruktur)');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `asset_status`
--

CREATE TABLE `asset_status` (
  `id` int(10) UNSIGNED NOT NULL,
  `status` varchar(128) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `asset_status`
--

INSERT INTO `asset_status` (`id`, `status`) VALUES
(1, 'aktiv'),
(2, 'inaktiv'),
(3, 'in Beschaffung'),
(4, 'in Entsorgung'),
(5, 'entsorgt');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `asset_typ`
--

CREATE TABLE `asset_typ` (
  `id` int(11) NOT NULL,
  `typ` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `asset_typ`
--

INSERT INTO `asset_typ` (`id`, `typ`) VALUES
(1, 'Anwendung'),
(2, 'Datenbank'),
(4, 'Plattform'),
(3, 'Service');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `Audit`
--

CREATE TABLE `Audit` (
  `id` int(10) UNSIGNED NOT NULL,
  `Kapitel` varchar(255) DEFAULT NULL,
  `Frage` varchar(255) DEFAULT NULL,
  `pflicht` tinyint(1) NOT NULL,
  `gewichtung` int(11) NOT NULL,
  `status` varchar(64) NOT NULL,
  `datum` date NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `Audit`
--

INSERT INTO `Audit` (`id`, `Kapitel`, `Frage`, `pflicht`, `gewichtung`, `status`, `datum`) VALUES
(1, 'ISMS-Grundlagen und Governance', 'Geltungsbereich (Scope) klar definiert, abgegrenzt und dokumentiert', 1, 1, 'erfüllt', '2026-01-24'),
(2, 'ISMS-Grundlagen und Governance', 'Kontext der Organisation (interne und externe Themen) dokumentiert', 1, 1, 'erfüllt', '2026-01-24'),
(3, 'ISMS-Grundlagen und Governance', 'Interessierte Parteien inkl. Anforderungen identifiziert', 1, 1, 'erfüllt', '2026-01-24'),
(4, 'ISMS-Grundlagen und Governance', 'ISMS-Ziele definiert, messbar und überwacht', 1, 1, 'teilw.', '2026-01-24'),
(5, 'ISMS-Grundlagen und Governance', 'ISMS-Dokumentationsstruktur nachvollziehbar', 1, 1, 'teilw.', '2026-01-24'),
(6, 'ISMS-Grundlagen und Governance', 'Rollen und Verantwortlichkeiten (ISMS-Beauftragter etc.) festgelegt', 1, 1, 'offen', '2026-01-24'),
(7, 'ISMS-Grundlagen und Governance', 'Management-Commitment dokumentiert (Policy, Reviews)', 1, 1, 'offen', '2026-01-24'),
(8, 'Informationssicherheitsleitlinie (Policy)', 'Genehmigte Informationssicherheitsleitlinie vorhanden', 1, 1, 'erfüllt', '2026-01-24'),
(9, 'Informationssicherheitsleitlinie (Policy)', 'Versioniert, freigegeben und kommuniziert', 1, 1, 'erfüllt', '2026-01-24'),
(10, 'Informationssicherheitsleitlinie (Policy)', 'Für Mitarbeiter zugänglich', 1, 1, 'erfüllt', '2026-01-24'),
(11, 'Informationssicherheitsleitlinie (Policy)', 'Inhalte konsistent zu Zielen, Risiken und Maßnahmen', 1, 1, 'erfüllt', '2026-01-24'),
(12, 'Informationssicherheitsleitlinie (Policy)', 'Regelmäßige Überprüfung nachweisbar', 1, 1, 'erfüllt', '2026-01-24'),
(13, 'Asset-Management', 'Vollständiges Asset-Verzeichnis (IT, OT, Informationen, Services)', 1, 1, 'teilw.', '2026-01-24'),
(14, 'Asset-Management', 'Asset-Eigentümer festgelegt', 1, 1, 'teilw.', '2026-01-24'),
(15, 'Asset-Management', 'Klassifizierung (z. B. Schutzbedarf / CIA) dokumentiert', 1, 1, 'teilw.', '2026-01-24'),
(16, 'Asset-Management', 'Kritische Abhängigkeiten erfasst', 1, 1, 'teilw.', '2026-01-24'),
(17, 'Risikomanagement', 'Risikomanagement-Methode dokumentiert', 1, 1, 'erfüllt', '2026-01-24'),
(18, 'Risikomanagement', 'Schutzbedarf / CIA-Bewertung nachvollziehbar', 1, 1, 'erfüllt', '2026-01-24'),
(19, 'Risikomanagement', 'Risiken identifiziert (vollständig & realistisch)', 1, 1, 'teilw.', '2026-01-24'),
(20, 'Risikomanagement', 'Risikobewertung konsistent angewendet', 1, 1, 'erfüllt', '2026-01-24'),
(21, 'Risikomanagement', 'Risikobehandlungsplan vorhanden', 1, 1, 'teilw.', '2026-01-24'),
(22, 'Risikomanagement', 'Restrisiken akzeptiert (Management-Freigabe)', 1, 1, 'nicht erfüllt', '2026-01-24'),
(23, 'Risikomanagement', 'Regelmäßige Neubewertung nachweisbar', 1, 1, 'erfüllt', '2026-01-24'),
(24, 'Statement of Applicability (SoA)', 'Alle Annex-A-Controls berücksichtigt', 1, 1, 'erfüllt', '2026-01-24'),
(25, 'Statement of Applicability (SoA)', 'Umsetzung je Control beschrieben', 1, 1, 'teilw.', '2026-01-24'),
(26, 'Statement of Applicability (SoA)', 'Verknüpfung zu Maßnahmen / Dokumenten vorhanden', 1, 1, 'nicht erfüllt', '2026-01-24'),
(27, 'Statement of Applicability (SoA)', 'Version & Freigabe dokumentiert', 1, 1, 'erfüllt', '2026-01-24'),
(28, 'Richtlinien und Konzepte (Policies)', 'Zugriffs- und Berechtigungskonzept', 1, 1, 'erfüllt', '2026-01-24'),
(29, 'Richtlinien und Konzepte (Policies)', 'Passwort- / Authentifizierungskonzept', 1, 1, 'erfüllt', '2026-01-24'),
(30, 'Richtlinien und Konzepte (Policies)', 'Backup- und Wiederherstellungskonzept', 1, 1, 'erfüllt', '2026-01-24'),
(31, 'Richtlinien und Konzepte (Policies)', 'Logging- und Monitoring-Konzept', 1, 1, 'teilw.', '2026-01-24'),
(32, 'Richtlinien und Konzepte (Policies)', 'Incident-Management-Richtlinie', 1, 1, 'teilw.', '2026-01-24'),
(33, 'Richtlinien und Konzepte (Policies)', 'Lieferanten- / Dienstleisterrichtlinie', 1, 1, 'erfüllt', '2026-01-24'),
(34, 'Richtlinien und Konzepte (Policies)', 'Schulungs- und Awareness-Konzept', 1, 1, 'erfüllt', '2026-01-24'),
(35, 'Richtlinien und Konzepte (Policies)', 'Alle Richtlinien: versioniert, freigegeben, aktuell, bekanntgemacht', 1, 5, 'erfüllt', '2026-01-24'),
(36, 'Operative Umsetzung (Wirksamkeit!)', 'Benutzer- und Rollenverwaltung technisch umgesetzt', 1, 1, 'erfüllt', '2026-01-24'),
(37, 'Operative Umsetzung (Wirksamkeit!)', 'Least-Privilege nachweisbar', 1, 1, 'teilw.', '2026-01-24'),
(38, 'Operative Umsetzung (Wirksamkeit!)', 'Logging aktiv und ausgewertet', 1, 1, 'erfüllt', '2026-01-24'),
(39, 'Operative Umsetzung (Wirksamkeit!)', 'Backups getestet (Restore-Nachweise!)', 1, 1, 'erfüllt', '2026-01-24'),
(40, 'Operative Umsetzung (Wirksamkeit!)', 'Patch- und Update-Prozess dokumentiert', 1, 1, 'erfüllt', '2026-01-24'),
(41, 'Operative Umsetzung (Wirksamkeit!)', 'Schutzmaßnahmen nicht nur beschrieben, sondern aktiv', 1, 1, 'erfüllt', '2026-01-24'),
(42, 'Incident- und Ereignismanagement', 'Definition von Sicherheitsvorfällen', 1, 1, 'teilw.', '2026-01-24'),
(43, 'Incident- und Ereignismanagement', 'Meldewege und Eskalation geregelt', 1, 1, 'teilw.', '2026-01-24'),
(44, 'Incident- und Ereignismanagement', 'Incident-Register vorhanden', 1, 1, 'erfüllt', '2026-01-24'),
(45, 'Incident- und Ereignismanagement', 'Bearbeitung und Lessons Learned dokumentiert', 1, 1, 'teilw.', '2026-01-24'),
(46, 'Incident- und Ereignismanagement', 'Testfälle oder reale Incidents vorhanden', 1, 1, 'erfüllt', '2026-01-24'),
(47, 'Incident- und Ereignismanagement', 'Verbindung zu Risiken und Maßnahmen', 1, 1, 'erfüllt', '2026-01-24'),
(48, 'Lieferanten- und Dienstleistermanagement', 'Relevante Lieferanten identifiziert', 1, 1, 'erfüllt', '2026-01-24'),
(49, 'Lieferanten- und Dienstleistermanagement', 'Sicherheitsanforderungen definiert', 1, 1, 'erfüllt', '2026-01-24'),
(50, 'Lieferanten- und Dienstleistermanagement', 'Risiko-Bewertung je Lieferant', 1, 1, 'erfüllt', '2026-01-24'),
(51, 'Lieferanten- und Dienstleistermanagement', 'Verträge / AVV / SLAs vorhanden', 1, 1, 'erfüllt', '2026-01-24'),
(52, 'Lieferanten- und Dienstleistermanagement', 'Regelmäßige Überprüfung dokumentiert', 1, 1, 'erfüllt', '2026-01-24'),
(53, 'Schulung und Awareness', 'Schulungskonzept dokumentiert', 1, 1, 'teilw.', '2026-01-24'),
(54, 'Schulung und Awareness', 'Pflichtschulungen definiert', 1, 1, 'erfüllt', '2026-01-24'),
(55, 'Schulung und Awareness', 'Teilnahme nachweisbar', 1, 1, 'erfüllt', '2026-01-24'),
(56, 'Schulung und Awareness', 'Neue Mitarbeiter geschult', 1, 1, 'erfüllt', '2026-01-24'),
(57, 'Schulung und Awareness', 'Regelmäßige Wiederholungen', 1, 1, 'erfüllt', '2026-01-24'),
(58, 'Schulung und Awareness', 'Awareness-Maßnahmen dokumentiert', 1, 1, 'erfüllt', '2026-01-24'),
(59, 'Überwachung, Messung und KPIs', 'ISMS-Kennzahlen definiert', 1, 1, 'nicht erfüllt', '2026-01-24'),
(60, 'Überwachung, Messung und KPIs', 'Messungen regelmäßig durchgeführt', 1, 1, 'teilw.', '2026-01-24'),
(61, 'Überwachung, Messung und KPIs', 'Abweichungen dokumentiert', 1, 1, 'nicht erfüllt', '2026-01-24'),
(62, 'Überwachung, Messung und KPIs', 'Maßnahmen abgeleitet', 1, 1, 'teilw.', '2026-01-24'),
(63, 'Überwachung, Messung und KPIs', 'Trends erkennbar', 1, 1, 'nicht erfüllt', '2026-01-24'),
(64, 'Interne Audits', 'Audit-Programm vorhanden', 1, 1, 'erfüllt', '2026-01-24'),
(65, 'Interne Audits', 'Auditor unabhängig', 1, 1, 'erfüllt', '2026-01-24'),
(66, 'Interne Audits', 'Auditberichte dokumentiert', 1, 1, 'erfüllt', '2026-01-24'),
(67, 'Interne Audits', 'Abweichungen klassifiziert', 1, 1, 'erfüllt', '2026-01-24'),
(68, 'Interne Audits', 'Korrekturmaßnahmen umgesetzt', 1, 1, 'erfüllt', '2026-01-24'),
(69, 'Interne Audits', 'Wirksamkeitsprüfung erfolgt', 1, 1, 'erfüllt', '2026-01-24'),
(70, 'Management-Review', 'Regelmäßig durchgeführt', 1, 1, 'nicht erfüllt', '2026-01-24'),
(71, 'Management-Review', 'Alle Pflichtinputs enthalten', 1, 1, 'nicht erfüllt', '2026-01-24'),
(72, 'Management-Review', 'Entscheidungen & Maßnahmen dokumentiert', 1, 1, 'nicht erfüllt', '2026-01-24'),
(73, 'Management-Review', 'Ressourcenfreigaben erkennbar', 1, 1, 'nicht erfüllt', '2026-01-24'),
(74, 'Management-Review', 'Follow-up nachweisbar', 1, 1, 'nicht erfüllt', '2026-01-24'),
(75, 'Korrektur- und Verbesserungsmaßnahmen', 'Abweichungen dokumentiert', 1, 1, 'teilw.', '2026-01-24'),
(76, 'Korrektur- und Verbesserungsmaßnahmen', 'Ursachenanalyse durchgeführt', 1, 1, 'erfüllt', '2026-01-24'),
(77, 'Korrektur- und Verbesserungsmaßnahmen', 'Maßnahmen definiert', 1, 1, 'erfüllt', '2026-01-24'),
(78, 'Korrektur- und Verbesserungsmaßnahmen', 'Verantwortliche benannt', 1, 1, 'erfüllt', '2026-01-24'),
(79, 'Korrektur- und Verbesserungsmaßnahmen', 'Fristen gesetzt', 1, 1, 'erfüllt', '2026-01-24'),
(80, 'Korrektur- und Verbesserungsmaßnahmen', 'Wirksamkeit geprüft', 0, 1, 'erfüllt', '2026-01-24'),
(81, 'Dokumenten- und Nachweismanagement', 'Dokumentenlenkung geregelt', 1, 1, 'erfüllt', '2026-01-24'),
(82, 'Dokumenten- und Nachweismanagement', 'Versionierung konsistent', 1, 1, 'erfüllt', '2026-01-24'),
(83, 'Dokumenten- und Nachweismanagement', 'Freigaben nachvollziehbar', 1, 1, 'erfüllt', '2026-01-24'),
(84, 'Dokumenten- und Nachweismanagement', 'Veraltete Dokumente gesperrt', 1, 1, 'erfüllt', '2026-01-24'),
(85, 'Dokumenten- und Nachweismanagement', 'Nachweise schnell auffindbar', 1, 1, 'erfüllt', '2026-01-24');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `AuditCE`
--

CREATE TABLE `AuditCE` (
  `id` int(11) NOT NULL,
  `Kapitel` varchar(255) NOT NULL,
  `Frage` text NOT NULL,
  `pflicht` tinyint(1) DEFAULT 0,
  `gewichtung` int(11) DEFAULT 1,
  `status` varchar(50) DEFAULT 'offen',
  `datum` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `AuditCE`
--

INSERT INTO `AuditCE` (`id`, `Kapitel`, `Frage`, `pflicht`, `gewichtung`, `status`, `datum`) VALUES
(1, 'Firewalls', 'Eine Firewall oder ein vergleichbares Netzwerk-Boundary-Device ist an allen Internet-Zugangspunkten vorhanden.', 1, 5, 'erfüllt', '2026-05-09'),
(2, 'Firewalls', 'Die Standard-Passwörter aller Firewalls wurden geändert.', 1, 5, 'erfüllt', '2026-05-09'),
(3, 'Firewalls', 'Ungenutzte und nicht benötigte Dienste und Ports sind gesperrt.', 1, 4, 'erfüllt', '2026-05-09'),
(4, 'Firewalls', 'Eingehender Datenverkehr wird auf bekannte, notwendige Quellen beschränkt.', 1, 4, 'erfüllt', '2026-05-09'),
(5, 'Firewalls', 'Die Firewall-Regeln werden regelmäßig überprüft und dokumentiert.', 0, 3, 'teilw.', '2026-05-09'),
(6, 'Sichere Konfiguration', 'Standard-Passwörter und -Konten werden auf allen Geräten und Diensten geändert oder deaktiviert.', 1, 5, 'erfüllt', '2026-05-09'),
(7, 'Sichere Konfiguration', 'Nicht benötigte Software, Konten und Dienste werden entfernt oder deaktiviert.', 1, 4, 'erfüllt', '2026-05-09'),
(8, 'Sichere Konfiguration', 'Auto-Run-Funktionen für Wechseldatenträger sind deaktiviert.', 0, 3, 'erfüllt', '2026-05-09'),
(9, 'Sichere Konfiguration', 'Systemeinstellungen werden dokumentiert und regelmäßig überprüft.', 0, 3, 'teilw.', '2026-05-09'),
(10, 'Zugriffskontrolle', 'Benutzerkonten werden nur für autorisierte Personen angelegt und bei Ausscheiden sofort deaktiviert.', 1, 5, 'erfüllt', '2026-05-09'),
(11, 'Zugriffskontrolle', 'Administrative Rechte sind auf das notwendige Minimum beschränkt (Least Privilege).', 1, 5, 'erfüllt', '2026-05-09'),
(12, 'Zugriffskontrolle', 'Administrative Aufgaben werden nicht über Standard-Benutzerkonten durchgeführt.', 1, 4, 'erfüllt', '2026-05-09'),
(13, 'Zugriffskontrolle', 'Multi-Faktor-Authentifizierung (MFA) ist für privilegierte Konten aktiviert.', 1, 5, 'erfüllt', '2026-05-09'),
(14, 'Zugriffskontrolle', 'Passwortrichtlinien erzwingen sichere Passwörter (Länge, Komplexität oder Passphrasen).', 1, 4, 'erfüllt', '2026-05-09'),
(15, 'Schutz vor Schadsoftware', 'Auf allen Endgeräten ist eine aktuelle Malware-Schutz-Lösung installiert und aktiv.', 1, 5, 'erfüllt', '2026-05-09'),
(16, 'Schutz vor Schadsoftware', 'Malware-Signaturen / Schutzdefinitionen werden täglich oder automatisch aktualisiert.', 1, 5, 'erfüllt', '2026-05-09'),
(17, 'Schutz vor Schadsoftware', 'Regelmäßige automatische Scans sind konfiguriert.', 1, 4, 'erfüllt', '2026-05-09'),
(18, 'Schutz vor Schadsoftware', 'Ausführung von Schadsoftware aus E-Mail-Anhängen und Webdownloads wird blockiert.', 1, 4, 'erfüllt', '2026-05-09'),
(19, 'Schutz vor Schadsoftware', 'Application Whitelisting oder vergleichbare Kontrollmechanismen sind implementiert.', 0, 3, 'nicht erfüllt', '2026-05-09'),
(20, 'Patch-Management', 'Betriebssysteme und Firmware aller Geräte werden innerhalb von 14 Tagen nach Veröffentlichung kritischer Patches aktualisiert.', 1, 5, 'erfüllt', '2026-05-09'),
(21, 'Patch-Management', 'Anwendungssoftware wird innerhalb von 14 Tagen nach Veröffentlichung kritischer Patches aktualisiert.', 1, 5, 'erfüllt', '2026-05-09'),
(22, 'Patch-Management', 'Software, die vom Hersteller nicht mehr unterstützt wird (End-of-Life), ist nicht im Einsatz.', 1, 5, 'erfüllt', '2026-05-09'),
(23, 'Patch-Management', 'Ein Inventar aller eingesetzten Hard- und Software inkl. Versionsstand ist gepflegt.', 1, 4, 'erfüllt', '2026-05-09'),
(24, 'Patch-Management', 'Patches werden vor dem Einspielen in einer Testumgebung geprüft.', 0, 2, 'teilw.', '2026-05-09');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `AuditDSGVO`
--

CREATE TABLE `AuditDSGVO` (
  `id` int(11) NOT NULL,
  `Kapitel` varchar(200) NOT NULL,
  `Frage` text NOT NULL,
  `pflicht` tinyint(1) DEFAULT 0,
  `gewichtung` int(11) DEFAULT 3,
  `status` varchar(30) DEFAULT 'offen',
  `datum` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `AuditDSGVO`
--

INSERT INTO `AuditDSGVO` (`id`, `Kapitel`, `Frage`, `pflicht`, `gewichtung`, `status`, `datum`) VALUES
(1, 'Art. 5 – Grundsätze der Verarbeitung', 'Personenbezogene Daten werden nur für festgelegte, eindeutige und legitime Zwecke erhoben (Zweckbindung).', 1, 5, 'offen', NULL),
(2, 'Art. 5 – Grundsätze der Verarbeitung', 'Die Verarbeitung ist auf das notwendige Maß beschränkt (Datensparsamkeit).', 1, 5, 'offen', NULL),
(3, 'Art. 5 – Grundsätze der Verarbeitung', 'Daten werden nur so lange gespeichert wie notwendig (Speicherbegrenzung).', 1, 5, 'offen', NULL),
(4, 'Art. 5 – Grundsätze der Verarbeitung', 'Die Verarbeitung erfolgt rechtmäßig, transparent und nach Treu und Glauben.', 1, 5, 'offen', NULL),
(5, 'Art. 5 – Grundsätze der Verarbeitung', 'Sachliche Richtigkeit der Daten wird sichergestellt und Daten werden ggf. berichtigt.', 1, 4, 'offen', NULL),
(6, 'Art. 6/9 – Rechtsgrundlagen', 'Für jede Verarbeitungstätigkeit liegt eine dokumentierte Rechtsgrundlage vor.', 1, 5, 'offen', NULL),
(7, 'Art. 6/9 – Rechtsgrundlagen', 'Einwilligungen sind freiwillig, informiert und nachweisbar eingeholt.', 1, 5, 'offen', NULL),
(8, 'Art. 6/9 – Rechtsgrundlagen', 'Besondere Kategorien personenbezogener Daten (Art. 9) werden nur mit expliziter Rechtsgrundlage verarbeitet.', 1, 5, 'offen', NULL),
(9, 'Art. 12–14 – Informationspflichten', 'Betroffene werden bei Datenerhebung transparent über die Verarbeitung informiert (Datenschutzhinweise).', 1, 5, 'offen', NULL),
(10, 'Art. 12–14 – Informationspflichten', 'Datenschutzerklärungen sind aktuell, vollständig und leicht zugänglich.', 1, 4, 'offen', NULL),
(11, 'Art. 12–14 – Informationspflichten', 'Informationen werden in klarer und verständlicher Sprache bereitgestellt.', 1, 3, 'offen', NULL),
(12, 'Art. 15–22 – Betroffenenrechte', 'Prozesse zur Bearbeitung von Auskunftsanfragen (Art. 15) sind etabliert und innerhalb der Fristen umsetzbar.', 1, 5, 'offen', NULL),
(13, 'Art. 15–22 – Betroffenenrechte', 'Berichtigung (Art. 16), Löschung (Art. 17) und Einschränkung (Art. 18) können fristgerecht umgesetzt werden.', 1, 5, 'offen', NULL),
(14, 'Art. 15–22 – Betroffenenrechte', 'Widerspruchs- (Art. 21) und Widerrufsrechte (Art. 7 Abs. 3) werden ohne unangemessene Verzögerung bearbeitet.', 1, 4, 'offen', NULL),
(15, 'Art. 15–22 – Betroffenenrechte', 'Recht auf Datenübertragbarkeit (Art. 20) ist technisch umsetzbar.', 0, 3, 'offen', NULL),
(16, 'Art. 24/25 – Verantwortlichkeit & Privacy by Design', 'Privacy by Design und Privacy by Default sind in Entwicklungs- und Beschaffungsprozessen verankert.', 1, 5, 'offen', NULL),
(17, 'Art. 24/25 – Verantwortlichkeit & Privacy by Design', 'Technische und organisatorische Maßnahmen (TOMs) sind dokumentiert und aktuell.', 1, 5, 'offen', NULL),
(18, 'Art. 24/25 – Verantwortlichkeit & Privacy by Design', 'Datenschutz-Folgenabschätzungen (DSFA, Art. 35) werden bei risikoreichen Verarbeitungen durchgeführt.', 1, 5, 'offen', NULL),
(19, 'Art. 26–28 – Auftragsverarbeitung', 'Mit allen Auftragsverarbeitern sind schriftliche AVV nach Art. 28 DSGVO abgeschlossen.', 1, 5, 'offen', NULL),
(20, 'Art. 26–28 – Auftragsverarbeitung', 'Auftragsverarbeiter werden regelmäßig auf Einhaltung der DSGVO-Anforderungen überprüft.', 1, 4, 'offen', NULL),
(21, 'Art. 26–28 – Auftragsverarbeitung', 'Drittlandübermittlungen (Art. 44 ff.) erfolgen nur mit geeigneten Garantien (z.B. SCC, Angemessenheitsbeschluss).', 1, 5, 'offen', NULL),
(22, 'Art. 30 – Verzeichnis der Verarbeitungstätigkeiten (VVT)', 'Ein aktuelles Verzeichnis aller Verarbeitungstätigkeiten (VVT) ist vorhanden.', 1, 5, 'offen', NULL),
(23, 'Art. 30 – Verzeichnis der Verarbeitungstätigkeiten (VVT)', 'Das VVT enthält alle Pflichtangaben gemäß Art. 30 DSGVO.', 1, 5, 'offen', NULL),
(24, 'Art. 30 – Verzeichnis der Verarbeitungstätigkeiten (VVT)', 'Das VVT wird bei neuen oder geänderten Verarbeitungen aktualisiert.', 1, 4, 'offen', NULL),
(25, 'Art. 32 – Technische & Organisatorische Maßnahmen (TOMs)', 'Zugangs-, Zugriffs- und Weitergabekontrolle sind implementiert und dokumentiert.', 1, 5, 'offen', NULL),
(26, 'Art. 32 – Technische & Organisatorische Maßnahmen (TOMs)', 'Daten werden bei Übertragung und Speicherung verschlüsselt (Verschlüsselungskonzept vorhanden).', 1, 5, 'offen', NULL),
(27, 'Art. 32 – Technische & Organisatorische Maßnahmen (TOMs)', 'Pseudonymisierung und Anonymisierung werden eingesetzt, wo technisch möglich.', 0, 3, 'offen', NULL),
(28, 'Art. 32 – Technische & Organisatorische Maßnahmen (TOMs)', 'Verfügbarkeit und Belastbarkeit der Systeme werden durch Backups und BCM sichergestellt.', 1, 4, 'offen', NULL),
(29, 'Art. 32 – Technische & Organisatorische Maßnahmen (TOMs)', 'TOMs werden regelmäßig überprüft und bei Bedarf angepasst.', 1, 4, 'offen', NULL),
(30, 'Art. 33/34 – Meldepflichten bei Datenpannen', 'Ein Prozess zur Erkennung, Dokumentation und Meldung von Datenpannen ist etabliert.', 1, 5, 'offen', NULL),
(31, 'Art. 33/34 – Meldepflichten bei Datenpannen', 'Datenpannen werden binnen 72 Stunden der zuständigen Aufsichtsbehörde gemeldet (Art. 33).', 1, 5, 'offen', NULL),
(32, 'Art. 33/34 – Meldepflichten bei Datenpannen', 'Betroffene Personen werden bei hohem Risiko unverzüglich benachrichtigt (Art. 34).', 1, 5, 'offen', NULL),
(33, 'Art. 33/34 – Meldepflichten bei Datenpannen', 'Datenpannen werden intern dokumentiert (Panning-Register).', 1, 4, 'offen', NULL),
(34, 'Art. 37–39 – Datenschutzbeauftragter (DSB)', 'Es wurde geprüft, ob ein DSB benannt werden muss; das Ergebnis ist dokumentiert.', 1, 5, 'offen', NULL),
(35, 'Art. 37–39 – Datenschutzbeauftragter (DSB)', 'Wenn erforderlich: ein DSB ist benannt, bei der Behörde registriert und seine Kontaktdaten sind veröffentlicht.', 1, 5, 'offen', NULL),
(36, 'Art. 37–39 – Datenschutzbeauftragter (DSB)', 'Der DSB wird frühzeitig in alle datenschutzrelevanten Vorgänge eingebunden.', 1, 4, 'offen', NULL),
(37, 'Schulung & Datenschutzbewusstsein', 'Mitarbeitende werden regelmäßig zum Datenschutz geschult und sensibilisiert.', 1, 4, 'offen', NULL),
(38, 'Schulung & Datenschutzbewusstsein', 'Schulungsnachweise werden dokumentiert.', 0, 3, 'offen', NULL),
(39, 'Schulung & Datenschutzbewusstsein', 'Neue Mitarbeitende werden bei Eintritt über Datenschutzpflichten informiert.', 1, 4, 'offen', NULL);

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `AuditNIS2`
--

CREATE TABLE `AuditNIS2` (
  `id` int(11) NOT NULL,
  `Kapitel` varchar(200) NOT NULL,
  `Frage` text NOT NULL,
  `pflicht` tinyint(1) DEFAULT 0,
  `gewichtung` int(11) DEFAULT 3,
  `status` varchar(30) DEFAULT 'offen',
  `datum` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `AuditNIS2`
--

INSERT INTO `AuditNIS2` (`id`, `Kapitel`, `Frage`, `pflicht`, `gewichtung`, `status`, `datum`) VALUES
(1, 'Art. 21 – Risikoanalyse & Sicherheitspolitik', 'Es existiert eine dokumentierte Informationssicherheitsrichtlinie (IS-Policy).', 1, 5, 'offen', NULL),
(2, 'Art. 21 – Risikoanalyse & Sicherheitspolitik', 'Es wird regelmäßig (mind. jährlich) eine Risikoanalyse für Netz- und Informationssysteme durchgeführt.', 1, 5, 'offen', NULL),
(3, 'Art. 21 – Risikoanalyse & Sicherheitspolitik', 'Die Risikoanalyse wird dokumentiert und die Ergebnisse werden der Geschäftsleitung vorgelegt.', 1, 4, 'offen', NULL),
(4, 'Art. 21 – Risikoanalyse & Sicherheitspolitik', 'Sicherheitsziele sind messbar definiert und werden regelmäßig überprüft.', 0, 3, 'offen', NULL),
(5, 'Art. 21 – Vorfallbewältigung', 'Ein dokumentiertes Incident-Response-Verfahren ist vorhanden und bekannt.', 1, 5, 'offen', NULL),
(6, 'Art. 21 – Vorfallbewältigung', 'Sicherheitsvorfälle werden klassifiziert (erheblich / nicht erheblich) und protokolliert.', 1, 5, 'offen', NULL),
(7, 'Art. 21 – Vorfallbewältigung', 'Meldepflichten gegenüber der zuständigen Behörde (BSI/ENISA) sind bekannt und eingehalten (Frühwarnung 24h, Meldung 72h, Abschlussbericht).', 1, 5, 'offen', NULL),
(8, 'Art. 21 – Vorfallbewältigung', 'Sicherheitsvorfälle werden nach Abschluss ausgewertet (Post-Incident Review).', 0, 3, 'offen', NULL),
(9, 'Art. 21 – Business Continuity & BCM', 'Ein Business-Continuity-Plan (BCP) für kritische Dienste ist vorhanden.', 1, 5, 'offen', NULL),
(10, 'Art. 21 – Business Continuity & BCM', 'Backup-Verfahren für kritische Systeme sind implementiert und werden regelmäßig getestet.', 1, 5, 'offen', NULL),
(11, 'Art. 21 – Business Continuity & BCM', 'Wiederanlaufpläne (DRP) sind dokumentiert und erprobt.', 1, 4, 'offen', NULL),
(12, 'Art. 21 – Business Continuity & BCM', 'Notfallübungen (Tabletop/Simulationen) werden mind. jährlich durchgeführt.', 0, 3, 'offen', NULL),
(13, 'Art. 21 – Lieferkettensicherheit', 'Lieferanten und Dienstleister werden hinsichtlich ihrer Sicherheitsmaßnahmen bewertet.', 1, 5, 'offen', NULL),
(14, 'Art. 21 – Lieferkettensicherheit', 'Sicherheitsanforderungen sind vertraglich mit Dritten vereinbart.', 1, 4, 'offen', NULL),
(15, 'Art. 21 – Lieferkettensicherheit', 'Kritische Abhängigkeiten in der Lieferkette sind identifiziert und dokumentiert.', 1, 4, 'offen', NULL),
(16, 'Art. 21 – Lieferkettensicherheit', 'Regelmäßige Überprüfung der Lieferantensicherheit (Audits, Fragebögen) findet statt.', 0, 3, 'offen', NULL),
(17, 'Art. 21 – Sicherheit in Entwicklung & Beschaffung', 'Security-by-Design ist in den Entwicklungsprozess integriert.', 1, 4, 'offen', NULL),
(18, 'Art. 21 – Sicherheit in Entwicklung & Beschaffung', 'Sichere Konfigurationsstandards (Hardening) werden für Systeme angewendet.', 1, 4, 'offen', NULL),
(19, 'Art. 21 – Sicherheit in Entwicklung & Beschaffung', 'Schwachstellen-Management und Patch-Management-Prozesse sind etabliert.', 1, 5, 'offen', NULL),
(20, 'Art. 21 – Sicherheit in Entwicklung & Beschaffung', 'Penetrationstests oder Sicherheitsaudits von Anwendungen werden regelmäßig durchgeführt.', 0, 3, 'offen', NULL),
(21, 'Art. 21 – Wirksamkeitsbewertung', 'Die Wirksamkeit der Sicherheitsmaßnahmen wird regelmäßig gemessen und bewertet.', 1, 4, 'offen', NULL),
(22, 'Art. 21 – Wirksamkeitsbewertung', 'Interne Audits oder Reviews der Sicherheitsmaßnahmen werden durchgeführt.', 1, 4, 'offen', NULL),
(23, 'Art. 21 – Wirksamkeitsbewertung', 'KPIs/Metriken für Informationssicherheit sind definiert.', 0, 3, 'offen', NULL),
(24, 'Art. 21 – Cyberhygiene & Schulungen', 'Regelmäßige Sicherheitsschulungen und Awareness-Programme für Mitarbeitende sind etabliert.', 1, 5, 'offen', NULL),
(25, 'Art. 21 – Cyberhygiene & Schulungen', 'Grundlegende Cyberhygiene-Maßnahmen (Passwortrichtlinien, Updates, Clean-Desk etc.) sind umgesetzt.', 1, 4, 'offen', NULL),
(26, 'Art. 21 – Cyberhygiene & Schulungen', 'Schulungsnachweise werden dokumentiert.', 0, 3, 'offen', NULL),
(27, 'Art. 21 – Cyberhygiene & Schulungen', 'Phishing-Simulationen oder ähnliche Tests werden regelmäßig durchgeführt.', 0, 3, 'offen', NULL),
(28, 'Art. 21 – Kryptographie & Verschlüsselung', 'Eine Kryptographierichtlinie ist vorhanden und aktuell.', 1, 4, 'offen', NULL),
(29, 'Art. 21 – Kryptographie & Verschlüsselung', 'Verschlüsselung wird für sensitive Daten (at rest und in transit) eingesetzt.', 1, 5, 'offen', NULL),
(30, 'Art. 21 – Kryptographie & Verschlüsselung', 'Schlüsselverwaltungsprozesse sind dokumentiert und implementiert.', 1, 4, 'offen', NULL),
(31, 'Art. 21 – Personalsicherheit & Zugangskontrolle', 'Zugriffsrechte werden nach dem Least-Privilege-Prinzip vergeben.', 1, 5, 'offen', NULL),
(32, 'Art. 21 – Personalsicherheit & Zugangskontrolle', 'Berechtigungen werden bei Austritt oder Rollenwechsel umgehend entzogen.', 1, 5, 'offen', NULL),
(33, 'Art. 21 – Personalsicherheit & Zugangskontrolle', 'Privilegierte Konten (Admin-Accounts) sind inventarisiert und besonders geschützt.', 1, 4, 'offen', NULL),
(34, 'Art. 21 – Personalsicherheit & Zugangskontrolle', 'Multi-Faktor-Authentifizierung (MFA) ist für kritische Systeme und Remote-Zugriff umgesetzt.', 1, 5, 'offen', NULL),
(35, 'Art. 21 – Personalsicherheit & Zugangskontrolle', 'Hintergrundüberprüfungen für Stellen mit sensiblem Systemzugang werden durchgeführt.', 0, 3, 'offen', NULL),
(36, 'Art. 21 – Asset-Management', 'Ein aktuelles Inventar aller kritischen Netz- und Informationssysteme ist vorhanden.', 1, 5, 'offen', NULL),
(37, 'Art. 21 – Asset-Management', 'Assets werden klassifiziert (Kritikalität, Schutzbedarf).', 1, 4, 'offen', NULL),
(38, 'Art. 21 – Asset-Management', 'Verantwortliche (Owner) für kritische Assets sind benannt.', 1, 3, 'offen', NULL),
(39, 'Art. 21 – Physische Sicherheit', 'Physische Zugangskontrollen für IT-Infrastruktur (Rechenzentrum, Server) sind implementiert.', 1, 4, 'offen', NULL),
(40, 'Art. 21 – Physische Sicherheit', 'Schutz vor Umweltbedrohungen (Brand, Wasser, Strom) ist gewährleistet.', 1, 4, 'offen', NULL),
(41, 'Art. 21 – Physische Sicherheit', 'Physische Sicherheitsmaßnahmen werden regelmäßig überprüft.', 0, 3, 'offen', NULL),
(42, 'Art. 21 – Netzwerksicherheit', 'Netzwerksegmentierung ist umgesetzt (z.B. DMZ, VLANs).', 1, 5, 'offen', NULL),
(43, 'Art. 21 – Netzwerksicherheit', 'Netzwerkverkehr wird überwacht und protokolliert (IDS/IPS, SIEM).', 1, 4, 'offen', NULL),
(44, 'Art. 21 – Netzwerksicherheit', 'Remote-Zugriffe sind abgesichert (VPN, Zero Trust).', 1, 5, 'offen', NULL),
(45, 'Art. 21 – Netzwerksicherheit', 'Firewalls und Perimeter-Schutz sind konfiguriert und aktuell.', 1, 4, 'offen', NULL),
(46, 'Art. 20 – Governance & Leitungsverantwortung', 'Die Leitungsebene hat die Cybersicherheitsmaßnahmen formell gebilligt.', 1, 5, 'offen', NULL),
(47, 'Art. 20 – Governance & Leitungsverantwortung', 'Ein Verantwortlicher für Informationssicherheit (CISO/ISB) ist benannt.', 1, 5, 'offen', NULL),
(48, 'Art. 20 – Governance & Leitungsverantwortung', 'Die Leitungsebene wird regelmäßig über den Sicherheitsstatus informiert.', 1, 4, 'offen', NULL),
(49, 'Art. 20 – Governance & Leitungsverantwortung', 'Leitungspersonen haben nachweislich an Schulungen zu Cybersicherheit teilgenommen.', 1, 4, 'offen', NULL),
(50, 'Art. 23 – Meldepflichten bei erheblichen Vorfällen', 'Prozesse zur Identifikation erheblicher Sicherheitsvorfälle sind vorhanden.', 1, 5, 'offen', NULL),
(51, 'Art. 23 – Meldepflichten bei erheblichen Vorfällen', 'Kontaktdaten und Meldeweg zur zuständigen Behörde (z.B. BSI) sind bekannt und dokumentiert.', 1, 5, 'offen', NULL),
(52, 'Art. 23 – Meldepflichten bei erheblichen Vorfällen', 'Frühwarnung (24h), Meldung (72h) und Abschlussbericht (1 Monat) können fristgerecht erfolgen.', 1, 5, 'offen', NULL),
(53, 'Art. 23 – Meldepflichten bei erheblichen Vorfällen', 'Kommunikationspläne für Behörden und ggf. Öffentlichkeit (Art. 23 Abs. 3) sind vorbereitet.', 0, 3, 'offen', NULL);

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `AuditTISAX`
--

CREATE TABLE `AuditTISAX` (
  `id` int(11) NOT NULL,
  `Kapitel` varchar(200) NOT NULL,
  `Frage` text NOT NULL,
  `pflicht` tinyint(1) DEFAULT 0,
  `gewichtung` int(11) DEFAULT 3,
  `status` varchar(30) DEFAULT 'offen',
  `datum` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `AuditTISAX`
--

INSERT INTO `AuditTISAX` (`id`, `Kapitel`, `Frage`, `pflicht`, `gewichtung`, `status`, `datum`) VALUES
(1, '1. Informationssicherheitsmanagement', 'Eine Informationssicherheitsleitlinie ist von der Geschäftsleitung verabschiedet und kommuniziert.', 1, 5, 'offen', NULL),
(2, '1. Informationssicherheitsmanagement', 'Ein Informationssicherheitsmanagementsystem (ISMS) ist implementiert und wird aufrechterhalten.', 1, 5, 'offen', NULL),
(3, '1. Informationssicherheitsmanagement', 'Ein CISO oder verantwortlicher IS-Beauftragter ist benannt.', 1, 5, 'offen', NULL),
(4, '1. Informationssicherheitsmanagement', 'Das ISMS wird regelmäßig überprüft und kontinuierlich verbessert (KVP).', 1, 4, 'offen', NULL),
(5, '1. Informationssicherheitsmanagement', 'Management-Reviews zur Informationssicherheit finden mindestens jährlich statt.', 1, 4, 'offen', NULL),
(6, '2. Risikomanagement', 'Ein dokumentierter Risikomanagementprozess für Informationssicherheit ist etabliert.', 1, 5, 'offen', NULL),
(7, '2. Risikomanagement', 'Informationssicherheitsrisiken werden regelmäßig identifiziert, bewertet und behandelt.', 1, 5, 'offen', NULL),
(8, '2. Risikomanagement', 'Risikobehandlungspläne werden verfolgt und deren Wirksamkeit überprüft.', 1, 4, 'offen', NULL),
(9, '2. Risikomanagement', 'Restrisiken sind von der Geschäftsleitung akzeptiert und dokumentiert.', 1, 4, 'offen', NULL),
(10, '3. Asset-Management & Schutzbedarfsfeststellung', 'Alle informationsverarbeitenden Assets sind inventarisiert (Asset-Register).', 1, 5, 'offen', NULL),
(11, '3. Asset-Management & Schutzbedarfsfeststellung', 'Schutzbedarf von Informationen und Systemen ist nach Vertraulichkeit, Integrität, Verfügbarkeit festgestellt.', 1, 5, 'offen', NULL),
(12, '3. Asset-Management & Schutzbedarfsfeststellung', 'Schutzbedarfskategorien sind definiert und werden bei der Auswahl von Maßnahmen berücksichtigt.', 1, 4, 'offen', NULL),
(13, '3. Asset-Management & Schutzbedarfsfeststellung', 'Informationen von OEM-Kunden (z.B. Konstruktionsdaten) sind klassifiziert und besonders geschützt.', 1, 5, 'offen', NULL),
(14, '4. Physische Sicherheit', 'Serverräume und Bereiche mit schutzbedürftigen Informationen sind gegen unbefugten Zutritt gesichert.', 1, 5, 'offen', NULL),
(15, '4. Physische Sicherheit', 'Zutrittskontrollsystem ist implementiert; Zutrittsrechte werden regelmäßig überprüft.', 1, 5, 'offen', NULL),
(16, '4. Physische Sicherheit', 'Besucher werden registriert und begleitet.', 1, 4, 'offen', NULL),
(17, '4. Physische Sicherheit', 'Schutz gegen Feuer, Wasser und sonstige Umwelteinflüsse ist vorhanden.', 1, 4, 'offen', NULL),
(18, '4. Physische Sicherheit', 'Prototypen und schutzbedürftige physische Objekte sind gesichert (Prototypenschutz).', 1, 5, 'offen', NULL),
(19, '5. Personal & Schulungen', 'Mitarbeitende werden vor Aufnahme der Tätigkeit auf Zuverlässigkeit geprüft (Hintergrundüberprüfung, soweit rechtlich zulässig).', 1, 4, 'offen', NULL),
(20, '5. Personal & Schulungen', 'Mitarbeitende werden regelmäßig zur Informationssicherheit und Vertraulichkeit geschult.', 1, 5, 'offen', NULL),
(21, '5. Personal & Schulungen', 'Geheimhaltungsvereinbarungen (NDA) sind mit Mitarbeitenden und relevanten Dritten abgeschlossen.', 1, 5, 'offen', NULL),
(22, '5. Personal & Schulungen', 'Beim Ausscheiden werden Zugriffsrechte entzogen und Assets zurückgegeben.', 1, 5, 'offen', NULL),
(23, '6. Zugriffsmanagement', 'Zugriffsrechte werden nach dem Least-Privilege-Prinzip vergeben und regelmäßig überprüft.', 1, 5, 'offen', NULL),
(24, '6. Zugriffsmanagement', 'Administrative Zugänge sind besonders gesichert (MFA, Protokollierung).', 1, 5, 'offen', NULL),
(25, '6. Zugriffsmanagement', 'Remote-Zugriffe erfolgen ausschließlich über verschlüsselte und authentifizierte Verbindungen.', 1, 5, 'offen', NULL),
(26, '6. Zugriffsmanagement', 'Passwortrichtlinien mit Mindestanforderungen sind definiert und durchgesetzt.', 1, 4, 'offen', NULL),
(27, '7. Kryptographie', 'Eine Kryptographierichtlinie mit aktuellen Algorithmen und Schlüssellängen ist vorhanden.', 1, 4, 'offen', NULL),
(28, '7. Kryptographie', 'Schutzbedürftige Daten werden bei Übertragung und Speicherung verschlüsselt.', 1, 5, 'offen', NULL),
(29, '7. Kryptographie', 'Zertifikats- und Schlüsselverwaltung ist geregelt (Gültigkeiten, Erneuerung, Widerruf).', 1, 4, 'offen', NULL),
(30, '8. IT- & Netzwerksicherheit', 'Netzwerke sind segmentiert; schutzbedürftige Systeme sind in separaten Zonen.', 1, 5, 'offen', NULL),
(31, '8. IT- & Netzwerksicherheit', 'Schadsoftware-Schutz ist auf allen relevanten Endpunkten implementiert und aktuell.', 1, 5, 'offen', NULL),
(32, '8. IT- & Netzwerksicherheit', 'Patch- und Schwachstellenmanagement ist etabliert; kritische Patches werden zeitnah eingespielt.', 1, 5, 'offen', NULL),
(33, '8. IT- & Netzwerksicherheit', 'Netzwerkzugriffe werden protokolliert und überwacht.', 1, 4, 'offen', NULL),
(34, '8. IT- & Netzwerksicherheit', 'WLAN-Netze sind sicher konfiguriert und von Produktionsnetzen getrennt.', 1, 4, 'offen', NULL),
(35, '9. Lieferanten & Dienstleister', 'Informationssicherheitsanforderungen sind vertraglich mit Lieferanten und Dienstleistern vereinbart.', 1, 5, 'offen', NULL),
(36, '9. Lieferanten & Dienstleister', 'Lieferanten werden hinsichtlich Informationssicherheit bewertet (z.B. TISAX-Nachweis oder Audit).', 1, 5, 'offen', NULL),
(37, '9. Lieferanten & Dienstleister', 'Zugriffe von Dritten auf interne Systeme und Daten werden kontrolliert und protokolliert.', 1, 4, 'offen', NULL),
(38, '9. Lieferanten & Dienstleister', 'Die Weitergabe schutzbedürftiger Kundeninformationen an Dritte ist geregelt und genehmigt.', 1, 5, 'offen', NULL),
(39, '10. Vorfallmanagement', 'Ein Incident-Response-Prozess für Informationssicherheitsvorfälle ist dokumentiert und erprobt.', 1, 5, 'offen', NULL),
(40, '10. Vorfallmanagement', 'Sicherheitsvorfälle werden klassifiziert, dokumentiert und analysiert.', 1, 5, 'offen', NULL),
(41, '10. Vorfallmanagement', 'OEM-Kunden werden bei sicherheitsrelevanten Vorfällen mit Auswirkung auf deren Daten informiert.', 1, 5, 'offen', NULL),
(42, '10. Vorfallmanagement', 'Post-Incident-Reviews führen zu dokumentierten Verbesserungsmaßnahmen.', 0, 3, 'offen', NULL),
(43, '11. Business Continuity Management', 'Ein Business-Continuity-Plan (BCP) für kritische Prozesse und Systeme ist vorhanden.', 1, 5, 'offen', NULL),
(44, '11. Business Continuity Management', 'Backups werden regelmäßig erstellt, verschlüsselt gespeichert und auf Wiederherstellbarkeit getestet.', 1, 5, 'offen', NULL),
(45, '11. Business Continuity Management', 'BCM-Tests und Notfallübungen werden mindestens jährlich durchgeführt.', 1, 4, 'offen', NULL),
(46, '11. Business Continuity Management', 'RTO und RPO sind für kritische Systeme definiert und werden eingehalten.', 1, 4, 'offen', NULL),
(47, '12. Compliance & Audit', 'Interne Audits zur Informationssicherheit werden regelmäßig durchgeführt.', 1, 5, 'offen', NULL),
(48, '12. Compliance & Audit', 'TISAX-Anforderungen sind bekannt; ein TISAX-Assessment ist geplant oder durchgeführt.', 1, 5, 'offen', NULL),
(49, '12. Compliance & Audit', 'Maßnahmen aus Audits und Assessments werden nachverfolgt und abgearbeitet.', 1, 4, 'offen', NULL),
(50, '12. Compliance & Audit', 'Rechtliche und vertragliche Anforderungen zur Informationssicherheit (inkl. OEM-Vorgaben) sind bekannt und eingehalten.', 1, 5, 'offen', NULL);

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `AuditVdS`
--

CREATE TABLE `AuditVdS` (
  `id` int(11) NOT NULL,
  `Kapitel` varchar(255) NOT NULL,
  `Frage` text NOT NULL,
  `pflicht` tinyint(1) DEFAULT 0,
  `gewichtung` int(11) DEFAULT 1,
  `status` varchar(50) DEFAULT 'offen',
  `datum` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `AuditVdS`
--

INSERT INTO `AuditVdS` (`id`, `Kapitel`, `Frage`, `pflicht`, `gewichtung`, `status`, `datum`) VALUES
(1, '1. Organisation & Managementsystem', 'Eine Informationssicherheits-Leitlinie (IS-Policy) ist dokumentiert, von der Geschäftsführung verabschiedet und kommuniziert.', 1, 5, 'offen', NULL),
(2, '1. Organisation & Managementsystem', 'Verantwortlichkeiten für Informationssicherheit sind schriftlich geregelt (IS-Beauftragter oder gleichwertige Funktion).', 1, 5, 'offen', NULL),
(3, '1. Organisation & Managementsystem', 'Informationssicherheit ist in Geschäftsprozesse und Projekte integriert.', 1, 4, 'offen', NULL),
(4, '1. Organisation & Managementsystem', 'Regelmäßige Management-Reviews zur Informationssicherheit finden statt (mind. jährlich).', 1, 4, 'offen', NULL),
(5, '1. Organisation & Managementsystem', 'Ein Verbesserungsprozess (KVP) für die Informationssicherheit ist etabliert.', 0, 3, 'offen', NULL),
(6, '2. Risikomanagement', 'Ein dokumentiertes Risikoanalyseverfahren für Informationssicherheit ist vorhanden.', 1, 5, 'offen', NULL),
(7, '2. Risikomanagement', 'Risiken werden regelmäßig (mind. jährlich) identifiziert, bewertet und behandelt.', 1, 5, 'offen', NULL),
(8, '2. Risikomanagement', 'Risikoakzeptanzkriterien sind definiert und dokumentiert.', 1, 4, 'offen', NULL),
(9, '2. Risikomanagement', 'Ergebnisse der Risikobehandlung werden verfolgt und dokumentiert.', 1, 4, 'offen', NULL),
(10, '2. Risikomanagement', 'Risiken für Lieferketten und Drittparteien werden berücksichtigt.', 0, 3, 'offen', NULL),
(11, '3. Personal & Sensibilisierung', 'Mitarbeiter werden bei Einstellung und regelmäßig zu Informationssicherheit geschult.', 1, 5, 'offen', NULL),
(12, '3. Personal & Sensibilisierung', 'Sicherheitsrichtlinien werden von Mitarbeitern nachweislich zur Kenntnis genommen.', 1, 4, 'offen', NULL),
(13, '3. Personal & Sensibilisierung', 'Beim Ausscheiden von Mitarbeitern werden Zugänge umgehend entzogen und Assets zurückgefordert.', 1, 5, 'offen', NULL),
(14, '3. Personal & Sensibilisierung', 'Für sicherheitsrelevante Rollen existieren spezifische Schulungsmaßnahmen.', 0, 3, 'offen', NULL),
(15, '4. Asset-Management', 'Ein aktuelles Inventar aller informationsverarbeitenden Assets (Hard- und Software) wird gepflegt.', 1, 5, 'offen', NULL),
(16, '4. Asset-Management', 'Alle Assets sind einem Verantwortlichen (Owner) zugeordnet.', 1, 4, 'offen', NULL),
(17, '4. Asset-Management', 'Informationen sind nach Schutzbedarf klassifiziert.', 1, 4, 'offen', NULL),
(18, '4. Asset-Management', 'Regelungen zur Handhabung von Wechseldatenträgern und mobilen Geräten sind vorhanden.', 1, 4, 'offen', NULL),
(19, '4. Asset-Management', 'Eine geregelte Entsorgung von Datenträgern (Datenlöschung/-vernichtung) ist dokumentiert.', 1, 4, 'offen', NULL),
(20, '5. Zugriffskontrolle & Identitätsmanagement', 'Zugriffsrechte werden nach dem Least-Privilege-Prinzip vergeben und regelmäßig überprüft.', 1, 5, 'offen', NULL),
(21, '5. Zugriffskontrolle & Identitätsmanagement', 'Administrative Berechtigungen sind auf das notwendige Minimum beschränkt.', 1, 5, 'offen', NULL),
(22, '5. Zugriffskontrolle & Identitätsmanagement', 'Ein Passwort-/Authentifizierungskonzept mit Mindestanforderungen ist dokumentiert und umgesetzt.', 1, 5, 'offen', NULL),
(23, '5. Zugriffskontrolle & Identitätsmanagement', 'Multi-Faktor-Authentifizierung ist für Remote-Zugriffe und privilegierte Konten eingesetzt.', 1, 5, 'offen', NULL),
(24, '5. Zugriffskontrolle & Identitätsmanagement', 'Benutzerkonten werden bei Ausscheiden oder Rollenwechsel unverzüglich angepasst.', 1, 4, 'offen', NULL),
(25, '6. Kryptografie', 'Eine Kryptografierichtlinie mit Vorgaben zu Algorithmen und Schlüssellängen ist vorhanden.', 1, 4, 'offen', NULL),
(26, '6. Kryptografie', 'Sensitive Daten werden bei Übertragung und Speicherung verschlüsselt.', 1, 5, 'offen', NULL),
(27, '6. Kryptografie', 'Zertifikats- und Schlüsselverwaltung ist geregelt (Lebenszyklusmanagement).', 1, 4, 'offen', NULL),
(28, '7. Physische Sicherheit', 'Serverräume und IT-Infrastruktur sind gegen unbefugten Zutritt gesichert.', 1, 5, 'offen', NULL),
(29, '7. Physische Sicherheit', 'Zutrittskontrolle zu sensitiven Bereichen ist dokumentiert und wird protokolliert.', 1, 4, 'offen', NULL),
(30, '7. Physische Sicherheit', 'Schutzmaßnahmen gegen Feuer, Wasser und Umwelteinflüsse sind vorhanden.', 1, 4, 'offen', NULL),
(31, '7. Physische Sicherheit', 'Clean-Desk-Richtlinie und Schutz vor Sichtbarkeit sensibler Informationen sind umgesetzt.', 0, 3, 'offen', NULL),
(32, '8. Betriebssicherheit', 'Betriebsdokumentation (Betriebshandbücher, Konfigurationen) ist aktuell gepflegt.', 1, 4, 'offen', NULL),
(33, '8. Betriebssicherheit', 'Änderungen an IT-Systemen unterliegen einem geregelten Change-Management-Prozess.', 1, 5, 'offen', NULL),
(34, '8. Betriebssicherheit', 'Kapazitäten werden überwacht und geplant (Kapazitätsmanagement).', 0, 3, 'offen', NULL),
(35, '8. Betriebssicherheit', 'Test- und Entwicklungsumgebungen sind von Produktivumgebungen getrennt.', 1, 4, 'offen', NULL),
(36, '8. Betriebssicherheit', 'Schadsoftware-Schutz ist auf allen relevanten Systemen installiert und aktuell.', 1, 5, 'offen', NULL),
(37, '8. Betriebssicherheit', 'Sicherheitsrelevante Ereignisse werden protokolliert und Logs regelmäßig ausgewertet.', 1, 4, 'offen', NULL),
(38, '9. Netzwerksicherheit', 'Das Netzwerk ist segmentiert; kritische Systeme sind in separaten Zonen.', 1, 5, 'offen', NULL),
(39, '9. Netzwerksicherheit', 'Netzwerkzugänge (intern/extern) werden durch Firewalls oder äquivalente Systeme kontrolliert.', 1, 5, 'offen', NULL),
(40, '9. Netzwerksicherheit', 'Fernzugriffe auf das Netzwerk erfolgen ausschließlich über gesicherte Verbindungen (VPN/verschlüsselt).', 1, 5, 'offen', NULL),
(41, '9. Netzwerksicherheit', 'WLAN-Netzwerke sind von Produktivnetzwerken getrennt und sicher konfiguriert.', 1, 4, 'offen', NULL),
(42, '9. Netzwerksicherheit', 'Netzwerkaktivitäten werden überwacht (IDS/IPS oder vergleichbar).', 0, 3, 'offen', NULL),
(43, '10. Lieferanten & Drittparteien', 'Sicherheitsanforderungen an Lieferanten und Dienstleister sind vertraglich vereinbart.', 1, 5, 'offen', NULL),
(44, '10. Lieferanten & Drittparteien', 'Die Einhaltung der Sicherheitsanforderungen durch Dritte wird regelmäßig überprüft.', 1, 4, 'offen', NULL),
(45, '10. Lieferanten & Drittparteien', 'Zugriffe von Dritten auf interne Systeme werden kontrolliert und protokolliert.', 1, 4, 'offen', NULL),
(46, '10. Lieferanten & Drittparteien', 'AVV (Auftragsverarbeitungsvertrag) liegt für alle relevanten Dienstleister vor.', 1, 4, 'offen', NULL),
(47, '11. Vorfallmanagement', 'Ein dokumentierter Incident-Response-Prozess ist vorhanden und erprobt.', 1, 5, 'offen', NULL),
(48, '11. Vorfallmanagement', 'Sicherheitsvorfälle werden klassifiziert, dokumentiert und ausgewertet.', 1, 5, 'offen', NULL),
(49, '11. Vorfallmanagement', 'Meldepflichten (intern/extern, z.B. Datenschutzbehörde, BSI) sind bekannt und eingehalten.', 1, 5, 'offen', NULL),
(50, '11. Vorfallmanagement', 'Post-Incident-Reviews führen zu nachverfolgbaren Verbesserungsmaßnahmen.', 0, 3, 'offen', NULL),
(51, '12. Business Continuity & Notfallmanagement', 'Ein Business-Continuity-Plan (BCP) für kritische Geschäftsprozesse ist dokumentiert.', 1, 5, 'offen', NULL),
(52, '12. Business Continuity & Notfallmanagement', 'Backup-Konzept ist vorhanden; Datensicherungen werden regelmäßig durchgeführt und getestet.', 1, 5, 'offen', NULL),
(53, '12. Business Continuity & Notfallmanagement', 'Wiederanlaufpläne (DRP) sind dokumentiert und Wiederanlaufzeiten (RTO/RPO) sind definiert.', 1, 4, 'offen', NULL),
(54, '12. Business Continuity & Notfallmanagement', 'BCM-Tests und Notfallübungen werden mind. jährlich durchgeführt.', 1, 4, 'offen', NULL),
(55, '13. Compliance & Datenschutz', 'Relevante gesetzliche und regulatorische Anforderungen (DSGVO, HGB, etc.) sind identifiziert und eingehalten.', 1, 5, 'offen', NULL),
(56, '13. Compliance & Datenschutz', 'Interne Audits zur Informationssicherheit werden regelmäßig (mind. jährlich) durchgeführt.', 1, 5, 'offen', NULL),
(57, '13. Compliance & Datenschutz', 'Ein Datenschutzkonzept und ein Verzeichnis von Verarbeitungstätigkeiten (VVT) sind vorhanden.', 1, 4, 'offen', NULL),
(58, '13. Compliance & Datenschutz', 'Verstöße gegen Sicherheitsrichtlinien werden konsequent verfolgt und dokumentiert.', 0, 3, 'offen', NULL),
(59, '14. Patch- & Schwachstellenmanagement', 'Ein strukturierter Prozess zur zeitnahen Einspielung von Sicherheits-Patches ist etabliert.', 1, 5, 'offen', NULL),
(60, '14. Patch- & Schwachstellenmanagement', 'Schwachstellen in IT-Systemen werden regelmäßig gescannt und bewertet.', 1, 5, 'offen', NULL),
(61, '14. Patch- & Schwachstellenmanagement', 'Kritische Schwachstellen werden innerhalb definierter Fristen behoben.', 1, 5, 'offen', NULL),
(62, '14. Patch- & Schwachstellenmanagement', 'Software, die vom Hersteller nicht mehr unterstützt wird (End-of-Life), ist nicht produktiv im Einsatz.', 1, 5, 'offen', NULL);

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `aud_abweichungen`
--

CREATE TABLE `aud_abweichungen` (
  `id` int(10) UNSIGNED NOT NULL,
  `audit_id` int(10) UNSIGNED NOT NULL,
  `nummer` varchar(20) DEFAULT NULL,
  `titel` varchar(200) NOT NULL,
  `beschreibung` text DEFAULT NULL,
  `typ` varchar(50) NOT NULL DEFAULT 'Empfehlung',
  `status` varchar(50) NOT NULL DEFAULT 'offen',
  `verantwortlich` int(10) UNSIGNED DEFAULT NULL,
  `faellig` date DEFAULT NULL,
  `norm` varchar(256) DEFAULT NULL,
  `norm_punkt` varchar(64) DEFAULT NULL,
  `massnahmen` text DEFAULT NULL,
  `Ersteller` int(10) UNSIGNED DEFAULT NULL,
  `erstellt` datetime NOT NULL DEFAULT current_timestamp(),
  `Aenderer` int(10) UNSIGNED DEFAULT NULL,
  `geaendert` datetime DEFAULT NULL,
  `ursachenanalyse` text DEFAULT NULL,
  `uebertragbarkeit` text DEFAULT NULL,
  `wirksamkeit` text DEFAULT NULL,
  `risiken` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `aud_anhaenge`
--

CREATE TABLE `aud_anhaenge` (
  `id` int(10) UNSIGNED NOT NULL,
  `audit_id` int(10) UNSIGNED NOT NULL,
  `original_name` varchar(255) NOT NULL,
  `stored_name` varchar(255) NOT NULL,
  `rel_path` varchar(255) NOT NULL,
  `mime_type` varchar(100) NOT NULL,
  `file_size` bigint(20) NOT NULL DEFAULT 0,
  `beschreibung` varchar(255) DEFAULT NULL,
  `ersteller` int(10) UNSIGNED DEFAULT NULL,
  `erstellt` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `aud_audits`
--

CREATE TABLE `aud_audits` (
  `id` int(10) UNSIGNED NOT NULL,
  `nummer` varchar(20) DEFAULT NULL,
  `titel` varchar(200) NOT NULL,
  `beschreibung` text DEFAULT NULL,
  `datum_von` date DEFAULT NULL,
  `datum_bis` date DEFAULT NULL,
  `status` varchar(50) NOT NULL DEFAULT 'geplant',
  `art` varchar(20) NOT NULL DEFAULT 'intern',
  `auditor` varchar(200) DEFAULT NULL,
  `norm` varchar(256) DEFAULT NULL,
  `Ersteller` int(10) UNSIGNED DEFAULT NULL,
  `erstellt` datetime NOT NULL DEFAULT current_timestamp(),
  `Aenderer` int(10) UNSIGNED DEFAULT NULL,
  `geaendert` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `aud_gap_fortschritt`
--

CREATE TABLE `aud_gap_fortschritt` (
  `audit_id` int(10) UNSIGNED NOT NULL,
  `kapitel` char(40) NOT NULL COMMENT 'SHA-1 des Kapitelnamens',
  `status` varchar(16) NOT NULL DEFAULT 'begonnen' COMMENT 'begonnen | erledigt | uebersprungen',
  `position` int(10) UNSIGNED DEFAULT NULL COMMENT 'Pruefpunkt, bei dem es weitergeht',
  `benutzer` varchar(64) NOT NULL DEFAULT '',
  `geaendert` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `aud_pruefpunkte`
--

CREATE TABLE `aud_pruefpunkte` (
  `id` int(10) UNSIGNED NOT NULL,
  `audit_id` int(10) UNSIGNED NOT NULL,
  `norm_id` int(10) UNSIGNED DEFAULT NULL,
  `norm` varchar(256) DEFAULT NULL,
  `kapitel` varchar(256) DEFAULT NULL,
  `nummer` varchar(64) DEFAULT NULL,
  `titel` varchar(500) NOT NULL,
  `bewertung` varchar(32) NOT NULL DEFAULT 'offen',
  `feststellung` text DEFAULT NULL,
  `nachweis` text DEFAULT NULL,
  `abweichung_id` int(10) UNSIGNED DEFAULT NULL,
  `sortierung` int(11) NOT NULL DEFAULT 0,
  `Ersteller` int(10) UNSIGNED DEFAULT NULL,
  `erstellt` datetime NOT NULL DEFAULT current_timestamp(),
  `Aenderer` int(10) UNSIGNED DEFAULT NULL,
  `geaendert` datetime DEFAULT NULL,
  `beschreibung` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `aud_pruefpunkte`
--

INSERT INTO `aud_pruefpunkte` (`id`, `audit_id`, `norm_id`, `norm`, `kapitel`, `nummer`, `titel`, `bewertung`, `feststellung`, `nachweis`, `abweichung_id`, `sortierung`, `Ersteller`, `erstellt`, `Aenderer`, `geaendert`, `beschreibung`) VALUES
(26, 2, 560, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.4', 'Leitungsverantwortung', 'offen', NULL, NULL, NULL, 560, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:38:29', 'Wie zeigt die Geschäftsführung konkret ihre Unterstützung für Informationssicherheit, z. B. durch Budgetfreigabe, Teilnahme an Reviews oder Vorbildfunktion?\nWelche Ressourcen – Zeit, Budget, Werkzeuge – stehen für das ISMS zur Verfügung?\nWie wird die Leitungsunterstützung dokumentiert, z. B. Protokolle der Managementbewertung, freigegebene Richtlinien oder Investitionsentscheidungen?'),
(27, 2, 561, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.5', 'Kontakt zu Behörden', 'offen', NULL, NULL, NULL, 561, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:38:29', 'Welche Behörden sind für Ihre IT/Software-GmbH sicherheitsrelevant, z. B. BSI, Datenschutzaufsicht Baden-Württemberg oder CERT-Bund?\nWie haben Sie die Kontaktdaten dieser Stellen dokumentiert und wer ist intern für die Kontaktaufnahme zuständig?\nIn welchen Fällen würden Sie Behörden kontaktieren, z. B. bei meldepflichtigen Datenschutzvorfällen oder Cyberangriffen?\nWelche Nachweise gibt es, z. B. eine Kontaktliste oder ein Notfallhandbuch?'),
(28, 2, 562, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.6', 'Kontakt zu Interessengruppen', 'offen', NULL, NULL, NULL, 562, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:38:29', 'Mit welchen externen Interessengruppen tauschen Sie sich zur Informationssicherheit aus, z. B. Branchenverbänden, CERT-Netzwerken oder Kundengruppen?\nWie ist dieser Austausch organisiert und dokumentiert?\nWelchen Nutzen ziehen Sie aus diesen Kontakten für Ihr ISMS und Ihre Softwareentwicklung?\nWer ist intern für die Pflege dieser Beziehungen verantwortlich?'),
(29, 2, 563, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.7', 'Threat Intelligence', 'offen', NULL, NULL, NULL, 563, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:38:29', 'Wie informieren Sie sich über aktuelle Bedrohungen und Angriffsmethoden, die für Ihre Softwareentwicklung und Ihren SaaS-Betrieb relevant sind?\nWelche Quellen nutzen Sie, z. B. BSI-Warnmeldungen, CVE-Datenbanken, Fachportale oder Herstellerinformationen?\nWie fließen diese Erkenntnisse in konkrete Schutzmaßnahmen oder Entwicklungsentscheidungen ein?\nWelche Nachweise dokumentieren die Auswertung, z. B. protokollierte Bewertungen oder Maßnahmenableitung?'),
(30, 2, 564, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.8', 'Informationssicherheit im Projektmanagement', 'offen', NULL, NULL, NULL, 564, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:38:29', 'Wie stellen Sie sicher, dass Sicherheitsanforderungen von Anfang an in Ihre Softwareprojekte einfließen – von der Planung bis zur Produktivsetzung?\nWelche Sicherheitsaspekte prüfen Sie bei neuen Features oder Releases, z. B. sichere Architektur, Authentifizierung oder Datenverschlüsselung?\nWie dokumentieren Sie sicherheitsrelevante Entscheidungen in Projekten, z. B. in Projektplänen, User Stories oder Abnahmeprotokollen?\nWer trägt die Verantwortung für Informationssicherheit in Projekten?'),
(31, 2, 565, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.9', 'Asset-Inventar', 'offen', NULL, NULL, NULL, 565, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:38:29', 'Führen Sie ein Verzeichnis Ihrer Informationswerte, z. B. Kundendaten, Quellcode, Server, Entwicklungsumgebungen oder SaaS-Infrastruktur?\nWie dokumentieren Sie Zuständigkeiten und Schutzbedarf je Asset?\nWie halten Sie das Inventar aktuell, etwa bei neuen Systemen oder Änderungen?\nWelche Nachweise gibt es, z. B. eine Asset-Liste, CMDB oder Tabelle mit Verantwortlichen und Klassifizierung?'),
(32, 2, 566, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.10', 'Erlaubte Nutzung von Assets', 'offen', NULL, NULL, NULL, 566, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:38:29', 'Welche Regeln gelten für die Nutzung von Arbeitsmitteln und Informationswerten, z. B. Laptops, Cloud-Dienste oder Quellcode-Repositories?\nWie verhindern Sie Missbrauch oder unbeabsichtigten Datenabfluss, etwa durch private Nutzung oder unsichere Tools?\nWie sind diese Regeln dokumentiert und kommuniziert, z. B. in einer Nutzungsrichtlinie oder Arbeitsanweisung?\nWie kontrollieren Sie die Einhaltung in Ihrem kleinen Team?'),
(33, 2, 567, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.11', 'Rückgabe von Assets', 'offen', NULL, NULL, NULL, 567, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:38:29', 'Wie stellen Sie sicher, dass bei Austritt, Rollenwechsel oder Vertragsende alle Assets und Zugänge zurückgegeben bzw. entzogen werden?\nWelcher Prozess wird durchlaufen, z. B. Checkliste, Offboarding-Protokoll oder Übergabegespräch?\nWie dokumentieren Sie die Rückgabe, z. B. durch Unterschrift, Ticketnachweis oder Systemprotokoll?\nWie schnell werden Zugänge nach Austritt gesperrt?'),
(34, 2, 568, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.12', 'Klassifizierung von Informationen', 'offen', NULL, NULL, NULL, 568, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:38:29', 'Nach welchem Schema klassifizieren Sie Informationen hinsichtlich Vertraulichkeit, Integrität und Verfügbarkeit?\nWelche Klassifizierungsstufen nutzen Sie und wie sind diese definiert?\nWie leiten Sie aus der Klassifizierung konkrete Schutzmaßnahmen ab, z. B. Verschlüsselung, Zugriffsbeschränkung oder Backup-Anforderungen?\nWelche Dokumente belegen das Klassifizierungsschema, z. B. eine Richtlinie oder eine Übersicht je Informationsart?'),
(35, 2, 569, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.13', 'Kennzeichnung von Informationen', 'offen', NULL, NULL, NULL, 569, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:38:29', 'Wie kennzeichnen Sie klassifizierte Informationen, damit der Schutzbedarf im Alltag erkennbar ist – etwa in Dokumenten, E-Mails oder Dateien?\nWelche Kennzeichnungsarten nutzen Sie, z. B. Wasserzeichen, Kopfzeilen, Ordnerstruktur oder Metadaten?\nWie stellen Sie sicher, dass alle Mitarbeiter die Kennzeichnung verstehen und anwenden?\nWelche Nachweise gibt es, z. B. eine Kennzeichnungsrichtlinie oder Beispieldokumente?'),
(36, 2, 570, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.14', 'Informationsübertragung', 'offen', NULL, NULL, NULL, 570, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:38:29', 'Wie regeln Sie den sicheren Austausch von Informationen – intern und mit Kunden oder Partnern?\nWelche Kanäle sind für welche Vertraulichkeitsstufe erlaubt, z. B. verschlüsselte E-Mail, SFTP, sichere Cloud oder Kundenportal?\nWie dokumentieren Sie Freigaben und Schutzmaßnahmen für Übertragungen, z. B. in einer Richtlinie oder Transferprotokoll?\nWie gehen Sie mit dem Versand sensibler Daten an Ihre SaaS-Kunden um?'),
(37, 2, 571, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.15', 'Zugriffskontrolle', 'offen', NULL, NULL, NULL, 571, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:38:29', 'Wie stellen Sie sicher, dass Zugriffsrechte nur nach dem Need-to-know- und Least-Privilege-Prinzip vergeben werden?\nWie überwachen und protokollieren Sie Zugriffe auf kritische Systeme, z. B. Quellcode-Repositories, Produktionsumgebung oder Kundendaten?\nIn welchem Turnus überprüfen Sie bestehende Berechtigungen?\nWelche Nachweise dokumentieren die Zugriffskontrolle, z. B. Berechtigungsmatrix, Audit-Logs oder Rezertifizierungsprotokolle?'),
(38, 2, 572, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.16', 'Identitätsmanagement', 'offen', NULL, NULL, NULL, 572, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:38:29', 'Wie verwalten Sie Identitäten über ihren gesamten Lebenszyklus – Anlage, Änderung und Deaktivierung?\nWelche Systeme nutzen Sie für das Identitätsmanagement, z. B. Active Directory, Identity Provider oder manuelle Pflege?\nWie stellen Sie Nachvollziehbarkeit sicher, z. B. durch Protokollierung oder Tickethistorie?\nWie schnell werden Identitäten bei Austritt oder Rollenwechsel angepasst?'),
(39, 2, 573, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.17', 'Authentifizierungsinformationen', 'offen', NULL, NULL, NULL, 573, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:38:29', 'Wie stellen Sie sicher, dass Passwörter und andere Authentifizierungsdaten sicher erstellt, gespeichert und übertragen werden?\nWelche Vorgaben gibt es für Passwortkomplexität, Ablauf und Mehrfaktorauthentifizierung?\nWie schützen Sie Authentifizierungsdaten technisch, z. B. durch Passwort-Manager, Hashing oder sichere Übertragung?\nWelche Nachweise dokumentieren Ihre Vorgaben, z. B. eine Passwortrichtlinie oder Systemkonfiguration?'),
(40, 2, 574, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.18', 'Berechtigungsverwaltung', 'offen', NULL, NULL, NULL, 574, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:38:29', 'Wie werden Zugriffsrechte vergeben und dokumentiert – wer beantragt, wer genehmigt?\nIn welchem Turnus überprüfen Sie bestehende Berechtigungen auf Aktualität und Angemessenheit (Rezertifizierung)?\nWie schnell werden Rechte entzogen, wenn sie nicht mehr benötigt werden, z. B. nach Projektwechsel oder Kündigung?\nWelche Nachweise gibt es, z. B. Antragsformulare, Genehmigungsprotokolle oder Rezertifizierungslisten?'),
(41, 2, 575, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.19', 'Informationssicherheit bei Lieferanten', 'offen', NULL, NULL, NULL, 575, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:39:18', 'Welche Lieferanten sind für Ihre ISMS-Software und den SaaS-Betrieb besonders kritisch, z. B. Hosting-Provider, Entwicklungstools oder Drittkomponenten?\nWie bewerten Sie neue und bestehende Lieferanten hinsichtlich Informationssicherheitsrisiken, z. B. mittels Checkliste, Fragebogen oder Zertifikatsprüfung?\nWelche Kriterien legen Sie an, um die Kritikalität eines Lieferanten für Ihren Geltungsbereich einzustufen?\nWie dokumentieren Sie die Ergebnisse Ihrer Lieferantenbewertung, z. B. in einer Lieferantenliste oder einem Bewertungsprotokoll?'),
(42, 2, 576, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.20', 'Sicherheitsanforderungen an Lieferanten', 'offen', NULL, NULL, NULL, 576, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:39:18', 'Wie stellen Sie sicher, dass Sicherheitsanforderungen in Verträgen mit Lieferanten verankert sind, z. B. durch Vertragszusätze, AVV oder NDA?\nWelche konkreten Sicherheitsklauseln vereinbaren Sie typischerweise mit Ihren Hosting- oder Cloud-Anbietern?\nWie passen Sie die vertraglichen Anforderungen an den jeweiligen Schutzbedarf und das Risiko an?\nWo sind diese Vertragsvorlagen oder -muster abgelegt und wer prüft deren Einhaltung bei Vertragsabschluss?'),
(43, 2, 577, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.21', 'Lieferantenüberwachung', 'offen', NULL, NULL, NULL, 577, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:39:18', 'Wie überwachen Sie, ob Ihre kritischen Lieferanten die vereinbarten Sicherheitsanforderungen einhalten, z. B. durch Zertifikatsnachfrage, Auditberichte oder regelmäßige Selbstauskünfte?\nIn welchem Turnus fordern Sie Nachweise wie ISO-27001-Zertifikate oder SOC-2-Berichte von Ihren Cloud-Anbietern an?\nWie gehen Sie vor, wenn ein Lieferant die vereinbarten Anforderungen nicht mehr erfüllt?\nWelche Aufzeichnungen führen Sie über die Lieferantenüberwachung?'),
(44, 2, 578, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.22', 'Service-Delivery-Management', 'offen', NULL, NULL, NULL, 578, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:39:18', 'Welche Dienstleistungen haben Sie ausgelagert, z. B. Hosting, Backup, Support oder Softwareentwicklung?\nWie steuern Sie im laufenden Betrieb, dass diese Dienstleister Ihre Sicherheitsanforderungen einhalten, z. B. durch SLAs, regelmäßige Abstimmungen oder Incident-Meldepflichten?\nWer ist intern verantwortlich für die Überwachung ausgelagerter Leistungen?\nWie dokumentieren Sie Abweichungen oder Sicherheitsvorfälle beim Dienstleister?'),
(45, 2, 579, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.23', 'Nutzung von Cloud-Diensten', 'offen', NULL, NULL, NULL, 579, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:39:18', 'Welche Cloud-Dienste nutzen Sie für Ihre ISMS-Software und den internen Betrieb, z. B. IaaS, PaaS oder SaaS-Lösungen?\nWie haben Sie vor Nutzung eines Cloud-Dienstes die Risiken bewertet und dokumentiert?\nWelche Sicherheitskontrollen setzen Sie für Cloud-Dienste um, z. B. Verschlüsselung, Zugriffsmanagement oder Standortwahl?\nWie stellen Sie sicher, dass Cloud-Anbieter die Anforderungen der DSGVO und ggf. NIS2 erfüllen?'),
(46, 2, 580, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.24', 'Incident-Management', 'offen', NULL, NULL, NULL, 580, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:39:18', 'Wie erkennen Sie Sicherheitsvorfälle in Ihrem Unternehmen, z. B. durch Monitoring, Meldungen oder automatisierte Alarme?\nWer ist für die Entgegennahme und Erstbewertung von Vorfällen zuständig und wie erreicht man diese Person?\nWie dokumentieren Sie Sicherheitsvorfälle von der Meldung bis zur Lösung, z. B. in einem Ticketsystem oder Vorfallsprotokoll?\nWelche Kriterien nutzen Sie, um einen Vorfall als sicherheitsrelevant einzustufen?'),
(47, 2, 581, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.25', 'Bewertung von Sicherheitsereignissen', 'offen', NULL, NULL, NULL, 581, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:39:18', 'Wie unterscheiden Sie zwischen einem Sicherheitsereignis und einem echten Sicherheitsvorfall?\nNach welchen Kriterien priorisieren Sie Sicherheitsereignisse, z. B. Auswirkung, Dringlichkeit oder betroffene Assets?\nWie stellen Sie sicher, dass relevante Ereignisse zeitnah analysiert und in den Reaktionsprozess überführt werden?\nWelche Aufzeichnungen gibt es zur Analyse und Priorisierung von Ereignissen?'),
(48, 2, 582, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.26', 'Reaktion auf Sicherheitsvorfälle', 'offen', NULL, NULL, NULL, 582, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:39:18', 'Welche Abläufe haben Sie definiert, um Sicherheitsvorfälle einzudämmen und zu beheben, z. B. in einem Incident-Response-Plan oder Notfallhandbuch?\nWie stellen Sie die Wiederherstellung betroffener Systeme oder Daten nach einem Vorfall sicher?\nWer kommuniziert intern und extern bei einem Vorfall und nach welchen Vorgaben?\nKönnen Sie ein Beispiel nennen, wie Sie zuletzt auf einen Vorfall reagiert haben?'),
(49, 2, 583, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.27', 'Lernen aus Vorfällen', 'offen', NULL, NULL, NULL, 583, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:39:18', 'Wie werten Sie abgeschlossene Sicherheitsvorfälle aus, um Ursachen zu identifizieren und Wiederholungen zu vermeiden?\nWelche Maßnahmen haben Sie aus früheren Vorfällen abgeleitet und umgesetzt?\nWie dokumentieren Sie die Lessons Learned und wo werden diese festgehalten, z. B. in einem Vorfallsbericht oder Maßnahmenplan?\nWer ist verantwortlich für die Nachverfolgung und Umsetzung von Verbesserungen?'),
(50, 2, 584, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.28', 'Beweissicherung', 'offen', NULL, NULL, NULL, 584, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:39:18', 'Wie sichern Sie bei einem Sicherheitsvorfall Beweise, z. B. Logdateien, Screenshots oder E-Mails?\nWie stellen Sie sicher, dass gesicherte Belege nicht verändert werden können und nachvollziehbar bleiben?\nWelche Vorgaben haben Sie für die Beweissicherung, damit diese im Streitfall rechtlich verwertbar ist?\nWo und wie lange bewahren Sie solche Belege auf?'),
(51, 2, 585, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.29', 'Informationssicherheit in Notfällen', 'offen', NULL, NULL, NULL, 585, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:39:18', 'Haben Sie Notfall- oder Krisenpläne, die Informationssicherheit explizit berücksichtigen?\nWie stellen Sie sicher, dass auch im Notfallbetrieb Vertraulichkeit, Integrität und Verfügbarkeit Ihrer Daten gewahrt bleiben?\nWelche Szenarien haben Sie für Ihre ISMS-Software und den SaaS-Betrieb durchgespielt?\nWie sind Verantwortlichkeiten und Kommunikationswege im Notfall geregelt?'),
(52, 2, 586, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.30', 'IKT-Bereitschaft für Business Continuity', 'offen', NULL, NULL, NULL, 586, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:39:18', 'Welche IT-Systeme und Prozesse sind für den Betrieb Ihrer ISMS-Software und die Kundenbetreuung kritisch?\nWie haben Sie die Wiederherstellungszeiten und -ziele für diese Systeme definiert, z. B. RTO und RPO?\nWelche Maßnahmen haben Sie getroffen, um den Betrieb bei Ausfall kritischer Systeme fortzuführen, z. B. Backups, Redundanzen oder Notfallzugänge?\nWie testen Sie Ihre Business-Continuity-Maßnahmen, z. B. durch Wiederherstellungstests?'),
(53, 2, 587, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.31', 'Rechtliche Anforderungen', 'offen', NULL, NULL, NULL, 587, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:39:18', 'Wie ermitteln Sie, welche gesetzlichen, regulatorischen und vertraglichen Anforderungen für Ihre ISMS-Software und Beratung gelten, z. B. DSGVO, NIS2 oder Kundenverträge?\nWo dokumentieren Sie diese Anforderungen und wie halten Sie diese aktuell?\nWie stellen Sie die Umsetzung dieser Pflichten im Tagesgeschäft sicher?\nWer ist für die Überwachung und Aktualisierung rechtlicher Anforderungen verantwortlich?'),
(54, 2, 588, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.32', 'Geistiges Eigentum', 'offen', NULL, NULL, NULL, 588, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:39:18', 'Wie schützen Sie Ihr Know-how und Ihren Quellcode vor unbefugtem Zugriff oder Weitergabe?\nWie stellen Sie sicher, dass eingesetzte Software und Bibliotheken lizenzkonform genutzt werden, z. B. durch ein Lizenzregister oder regelmäßige Prüfungen?\nWelche Regelungen haben Sie für Mitarbeitende und Dritte zum Umgang mit geistigem Eigentum, z. B. in Arbeitsverträgen oder NDAs?\nWie dokumentieren Sie Ihre eigenen Schutzrechte?'),
(55, 2, 589, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.33', 'Schutz von Aufzeichnungen', 'offen', NULL, NULL, NULL, 589, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:39:18', 'Welche Aufzeichnungen führen Sie für Ihr ISMS und den laufenden Betrieb, z. B. Protokolle, Verträge oder Nachweise?\nWie stellen Sie sicher, dass diese Aufzeichnungen vor unbefugter Änderung oder Verlust geschützt sind?\nNach welchen Kriterien legen Sie Aufbewahrungsfristen fest und wie stellen Sie die fristgerechte Löschung sicher?\nWo sind Ihre Aufzeichnungen abgelegt und wer hat Zugriff?'),
(56, 2, 590, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.34', 'Datenschutz', 'offen', NULL, NULL, NULL, 590, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:39:18', 'Welche personenbezogenen Daten verarbeiten Sie im Rahmen Ihrer ISMS-Software und Beratung?\nWelche technischen und organisatorischen Maßnahmen setzen Sie zum Schutz dieser Daten um, z. B. Verschlüsselung, Zugriffskontrollen oder Pseudonymisierung?\nWie arbeiten Sie mit Ihrem Datenschutzbeauftragten oder einer externen Datenschutzberatung zusammen?\nWie dokumentieren Sie Ihre Datenschutzmaßnahmen, z. B. im Verzeichnis von Verarbeitungstätigkeiten?'),
(57, 2, 591, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.35', 'Unabhängige Sicherheitsprüfung', 'offen', NULL, NULL, NULL, 591, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:39:18', 'Wie und in welchem Turnus lassen Sie Ihre Sicherheitsmaßnahmen unabhängig prüfen, z. B. durch externe Audits, Penetrationstests oder Zertifizierungen?\nWer führt diese Prüfungen durch und wie wählen Sie geeignete Prüfer aus?\nWie gehen Sie mit den Ergebnissen und Empfehlungen aus solchen Prüfungen um?\nWelche Nachweise über durchgeführte Prüfungen liegen vor, z. B. Auditberichte oder Testprotokolle?'),
(58, 2, 592, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.36', 'Einhaltung von Richtlinien', 'offen', NULL, NULL, NULL, 592, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:39:18', 'Wie überprüfen Sie, ob Ihre internen Sicherheitsrichtlinien im Alltag eingehalten werden, z. B. durch Stichproben, Self-Assessments oder Reviews?\nWie gehen Sie vor, wenn Sie Abweichungen von Ihren Vorgaben feststellen?\nWer ist für die Überwachung der Richtlinieneinhaltung verantwortlich?\nWelche Aufzeichnungen führen Sie über Compliance-Prüfungen und eingeleitete Maßnahmen?'),
(59, 2, 593, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.37', 'Technische Compliance', 'offen', NULL, NULL, NULL, 593, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:39:18', 'Welche technischen Vorgaben und Baselines haben Sie für Ihre IT-Systeme definiert, z. B. Härtungsvorgaben, Patchstände oder Konfigurationsstandards?\nWie kontrollieren Sie regelmäßig, ob diese technischen Vorgaben eingehalten werden, z. B. durch Scans, automatisierte Prüfungen oder Reviews?\nWie dokumentieren Sie Abweichungen und deren Behebung?\nWer ist für die technische Compliance verantwortlich?'),
(60, 2, 594, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.1', 'Hintergrundprüfungen', 'offen', NULL, NULL, NULL, 594, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:39:18', 'Welche Hintergrundprüfungen führen Sie vor der Einstellung neuer Mitarbeitender durch, z. B. Referenzprüfung, Identitätsprüfung oder Führungszeugnis?\nWie stellen Sie sicher, dass diese Prüfungen im rechtlich zulässigen Rahmen erfolgen, z. B. unter Beachtung des BDSG?\nFühren Sie auch während der Beschäftigung anlassbezogene Prüfungen durch?\nWie dokumentieren Sie die durchgeführten Prüfungen, z. B. in der Personalakte?'),
(61, 2, 595, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.2', 'Arbeitsverträge', 'offen', NULL, NULL, NULL, 595, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:04', 'Welche Sicherheitsanforderungen und Vertraulichkeitspflichten sind in Ihren Arbeitsverträgen verankert?\nWie stellen Sie sicher, dass neue Mitarbeitende vor Arbeitsbeginn eine Verpflichtungserklärung zur Informationssicherheit unterzeichnen, z. B. NDA oder Datenschutzverpflichtung?\nWelche Dokumente belegen die vertragliche Verankerung, z. B. Musterarbeitsvertrag, Zusatzvereinbarungen, unterschriebene Verpflichtungserklärungen?\nWer prüft, ob die vertraglichen Sicherheitsklauseln bei Vertragsänderungen oder Rollenwechseln aktualisiert werden?'),
(62, 2, 596, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.3', 'Sensibilisierung und Schulung', 'offen', NULL, NULL, NULL, 596, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:04', 'Wie werden Ihre Mitarbeitenden regelmäßig zu Informationssicherheitsrisiken und ISMS-Vorgaben geschult?\nIn welchen Intervallen finden Sensibilisierungsmaßnahmen statt und wer ist für deren Durchführung verantwortlich?\nWelche Nachweise dokumentieren die Teilnahme, z. B. Teilnehmerlisten, E-Learning-Zertifikate, Protokolle?\nWie passen Sie Schulungsinhalte an aktuelle Bedrohungen an, etwa Phishing oder Social Engineering im Softwareentwicklungsumfeld?'),
(63, 2, 597, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.4', 'Disziplinarische Maßnahmen', 'offen', NULL, NULL, NULL, 597, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:04', 'Gibt es in Ihrem Unternehmen definierte Konsequenzen bei Verstößen gegen Sicherheitsregeln?\nWie sind diese Maßnahmen abgestuft und wo sind sie dokumentiert, z. B. in einer Richtlinie, Betriebsvereinbarung oder im Arbeitsvertrag?\nWie stellen Sie sicher, dass alle Mitarbeitenden diese Konsequenzen kennen?\nWer entscheidet über disziplinarische Maßnahmen und wie wird die Verhältnismäßigkeit gewahrt?'),
(64, 2, 598, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.5', 'Verantwortlichkeiten nach Beendigung', 'offen', NULL, NULL, NULL, 598, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:04', 'Welche Pflichten zur Vertraulichkeit und zum Schutz von Informationen gelten für ausscheidende Mitarbeitende über das Beschäftigungsende hinaus?\nWie werden diese Pflichten vertraglich festgehalten, z. B. in Aufhebungsverträgen, nachvertraglichen Klauseln oder separaten NDAs?\nWie erinnern Sie ausscheidende Mitarbeitende an fortbestehende Pflichten, etwa durch ein Exit-Gespräch oder Checkliste?\nWelche Nachweise existieren, z. B. unterschriebene Austrittsdokumente?'),
(65, 2, 599, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.6', 'Vertraulichkeitsvereinbarungen', 'offen', NULL, NULL, NULL, 599, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:04', 'Für welche Rollen und externen Partner bestehen Vertraulichkeitsvereinbarungen?\nWie stellen Sie sicher, dass NDAs vor Zugang zu sensiblen Informationen unterzeichnet werden?\nWelche Dokumente belegen dies, z. B. unterschriebene NDAs, Rahmenverträge mit Vertraulichkeitsklauseln?\nWer verwaltet diese Vereinbarungen und prüft deren Aktualität bei langjährigen Partnern?'),
(66, 2, 600, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.7', 'Remote Work', 'offen', NULL, NULL, NULL, 600, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:04', 'Welche Regeln gelten für Remote Work und Homeoffice hinsichtlich Gerätenutzung, Netzwerksicherheit und Zugriffsschutz?\nWo sind diese Vorgaben dokumentiert, z. B. in einer Remote-Work-Richtlinie oder IT-Nutzungsordnung?\nWie schützen Ihre Mitarbeitenden sensible Informationen bei mobilem Arbeiten, etwa durch VPN, Bildschirmschutzfolien oder verschlüsselte Geräte?\nWie überprüfen Sie die Einhaltung dieser Regeln?'),
(67, 2, 601, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.8', 'Meldung von Sicherheitsereignissen', 'offen', NULL, NULL, NULL, 601, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:04', 'Über welche Kanäle melden Ihre Mitarbeitenden Sicherheitsvorfälle oder Auffälligkeiten?\nWie ist der Meldeprozess dokumentiert und allen bekannt gemacht, z. B. durch Aushang, Intranet oder Schulung?\nWelche Nachweise gibt es für eingegangene Meldungen, z. B. Ticketsystem, E-Mail-Postfach, Meldeprotokoll?\nWie schnell erfolgt typischerweise die Erstreaktion auf eine Meldung?'),
(68, 2, 602, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.1', 'Sicherheitszonen', 'offen', NULL, NULL, NULL, 602, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:04', 'Wie haben Sie Bereiche mit unterschiedlichem Schutzbedarf in Ihren Räumlichkeiten definiert?\nWelche Zutrittsmaßnahmen schützen sensible Bereiche wie Serverraum oder Entwicklungsarbeitsplätze?\nWo ist die Zonenklassifizierung dokumentiert, z. B. in einem Raumplan oder Sicherheitskonzept?\nWie berücksichtigen Sie den Schutzbedarf, wenn Sie Büroflächen anmieten oder Co-Working nutzen?'),
(69, 2, 603, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.2', 'Zutrittskontrolle', 'offen', NULL, NULL, NULL, 603, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:04', 'Wie kontrollieren Sie den physischen Zutritt zu Ihren Geschäftsräumen?\nWerden Zutrittsberechtigungen dokumentiert und regelmäßig überprüft, z. B. Schlüssellisten, Zutrittskarten, Berechtigungsübersichten?\nWie protokollieren Sie den Zutritt zu besonders sensiblen Bereichen?\nWer ist für die Vergabe und den Entzug von Zutrittsrechten verantwortlich?'),
(70, 2, 604, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.3', 'Sicherung von Büros', 'offen', NULL, NULL, NULL, 604, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:04', 'Welche Maßnahmen verhindern unbefugten Zugriff auf Ihre Büros und Arbeitsplätze?\nWie ist sichergestellt, dass Besucher nicht unbeaufsichtigt in sensible Bereiche gelangen?\nWelche Vorkehrungen treffen Sie gegen Manipulation, z. B. abschließbare Schränke, Sichtschutz?\nWie dokumentieren Sie diese Schutzmaßnahmen?'),
(71, 2, 605, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.4', 'Physische Überwachung', 'offen', NULL, NULL, NULL, 605, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:04', 'Werden sicherheitsrelevante Bereiche physisch überwacht, z. B. durch Alarmanlagen, Bewegungsmelder oder Videoüberwachung?\nWie ist die Überwachung angemessen zum Schutzbedarf eines kleinen IT-Unternehmens gestaltet?\nWer wertet Überwachungsdaten aus und wie lange werden Aufzeichnungen aufbewahrt?\nWelche Nachweise belegen die Funktionsfähigkeit, z. B. Wartungsprotokolle, Testläufe?'),
(72, 2, 606, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.5', 'Schutz vor Umweltgefahren', 'offen', NULL, NULL, NULL, 606, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:04', 'Welche Schutzmaßnahmen haben Sie gegen Umwelteinflüsse wie Feuer, Wasser oder Stromausfall umgesetzt?\nWie schützen Sie kritische IT-Systeme vor Infrastrukturstörungen, z. B. durch USV, Rauchmelder, Wasserschutz?\nWelche Nachweise existieren, z. B. Wartungsprotokolle, Prüfberichte, Versicherungsunterlagen?\nWie berücksichtigen Sie diese Risiken bei einem angemieteten Büro oder Rechenzentrum?'),
(73, 2, 607, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.6', 'Arbeiten in gesicherten Bereichen', 'offen', NULL, NULL, NULL, 607, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:04', 'Welche Bereiche mit erhöhtem Schutzbedarf existieren und welche Regeln gelten dort für Tätigkeiten?\nWie werden Freigaben für Arbeiten in diesen Bereichen erteilt und dokumentiert?\nWer darf Wartungs- oder Installationsarbeiten durchführen und wie wird dies kontrolliert?\nWelche Nachweise belegen die Einhaltung, z. B. Freigabeprotokolle, Begleitregelungen für externe Techniker?'),
(74, 2, 608, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.7', 'Clear Desk / Clear Screen', 'offen', NULL, NULL, NULL, 608, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:04', 'Welche Vorgaben existieren für Clear Desk und Clear Screen an Ihren Arbeitsplätzen?\nWie stellen Sie sicher, dass sensible Informationen nicht offen einsehbar sind, z. B. Bildschirmsperre, verschlossene Schubladen?\nWo sind diese Regeln dokumentiert, z. B. in einer Arbeitsplatzrichtlinie oder IT-Nutzungsordnung?\nWie überprüfen Sie die Einhaltung im Alltag?'),
(75, 2, 609, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.8', 'Standortgebundene Geräte', 'offen', NULL, NULL, NULL, 609, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:04', 'Wie schützen Sie standortgebundene Geräte wie Server, Arbeitsplatzrechner oder Netzwerkkomponenten gegen Diebstahl und unbefugte Nutzung?\nWelche Maßnahmen sind umgesetzt, z. B. Kensington-Schlösser, abschließbare Schränke, BIOS-Passwörter?\nWer führt ein Inventar dieser Geräte und wie wird es gepflegt?\nWelche Nachweise belegen die Schutzmaßnahmen?'),
(76, 2, 610, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.9', 'Außerbetriebnahme von Geräten', 'offen', NULL, NULL, NULL, 610, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:04', 'Wie stellen Sie sicher, dass Daten bei Außerbetriebnahme oder Weitergabe von Geräten sicher gelöscht werden?\nWelches Verfahren nutzen Sie zur Datenlöschung, z. B. zertifizierte Löschsoftware, physische Zerstörung?\nWelche Nachweise dokumentieren die sichere Entsorgung, z. B. Löschprotokolle, Vernichtungszertifikate?\nWer ist für diesen Prozess verantwortlich?'),
(77, 2, 611, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.10', 'Lagerung von Datenträgern', 'offen', NULL, NULL, NULL, 611, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:04', 'Wie werden Datenträger entsprechend ihrem Schutzbedarf gelagert und verwaltet?\nWelche Maßnahmen gelten für Transport und Aufbewahrung, z. B. verschlossene Schränke, verschlüsselte Medien?\nFühren Sie ein Verzeichnis über Datenträger mit sensiblen Informationen?\nWie erfolgt die sichere Entsorgung nicht mehr benötigter Datenträger?'),
(78, 2, 612, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.11', 'Unterstützende Infrastruktur', 'offen', NULL, NULL, NULL, 612, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:04', 'Wie ist Ihre unterstützende Infrastruktur wie Stromversorgung, Klimatisierung oder Internetzugang gegen Ausfälle geschützt?\nWelche Maßnahmen sichern die Verfügbarkeit, z. B. USV, redundante Internetanbindung, Wartungsverträge?\nWer ist für die Überwachung und Wartung dieser Systeme verantwortlich?\nWelche Nachweise belegen regelmäßige Prüfungen, z. B. Wartungsprotokolle?'),
(79, 2, 613, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.12', 'Kabelschutz', 'offen', NULL, NULL, NULL, 613, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:04', 'Wie schützen Sie Strom- und Datenkabel gegen Beschädigung, Abhören oder Manipulation?\nWelche Maßnahmen sind umgesetzt, z. B. Kabelkanäle, getrennte Verlegung, Zugangsbeschränkungen zu Verteilerräumen?\nWie ist die Verkabelung dokumentiert, z. B. in einem Netzwerkplan?\nWer prüft regelmäßig die Integrität der Verkabelung?'),
(80, 2, 614, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.13', 'Wartung von Geräten', 'offen', NULL, NULL, NULL, 614, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:04', 'Wie stellen Sie sicher, dass Wartung und Reparatur von Geräten kontrolliert und nachvollziehbar erfolgen?\nWelche Regeln gelten für externe Dienstleister bei Wartungsarbeiten, z. B. Begleitung, Vertraulichkeitsvereinbarung?\nWelche Nachweise dokumentieren durchgeführte Wartungen, z. B. Wartungsprotokolle, Serviceberichte, Ticketeinträge?\nWie wird vor Wartung sichergestellt, dass sensible Daten geschützt sind?'),
(81, 2, 615, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.14', 'Entsorgung', 'offen', NULL, NULL, NULL, 615, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:50', 'Wie stellen Sie sicher, dass ausgemusterte Laptops, Festplatten oder USB-Sticks vor Weitergabe oder Entsorgung vollständig von Daten bereinigt werden?\nWelche Verfahren nutzen Sie zur sicheren Datenlöschung oder physischen Zerstörung, z. B. Löschsoftware mit Protokoll, Schredder-Dienstleister?\nWer entscheidet, ob ein Gerät wiederverwendet oder entsorgt wird, und wie wird dies dokumentiert?\nWie gehen Sie mit defekten Datenträgern um, die sich nicht mehr softwareseitig löschen lassen?'),
(82, 2, 616, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.1', 'Endgerätesicherheit', 'offen', NULL, NULL, NULL, 616, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:50', 'Welche Härtungsmaßnahmen setzen Sie auf Entwickler-Laptops und anderen Endgeräten um, z. B. deaktivierte Dienste, Festplattenverschlüsselung, Firewall?\nWie stellen Sie sicher, dass Betriebssysteme und Anwendungen zeitnah aktualisiert werden?\nWelche Vorgaben existieren für den Einsatz privater Geräte oder mobiler Endgeräte im Firmennetz?\nWie wird die Einhaltung der Endgerätekonfiguration überprüft – gibt es eine Baseline oder Checkliste?'),
(83, 2, 617, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.2', 'Privilegierte Zugriffe', 'offen', NULL, NULL, NULL, 617, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:50', 'Wer verfügt in Ihrem kleinen Team über privilegierte Zugriffsrechte, z. B. Admin-Konten für Server, Cloud-Konsolen oder Datenbanken?\nWie trennen Sie administrative von regulären Benutzerkonten im Tagesgeschäft?\nWelche Kontrollen oder Genehmigungsverfahren gelten für die Vergabe und Nutzung privilegierter Rechte?\nWie protokollieren und überwachen Sie Aktionen mit erhöhten Rechten, z. B. Audit-Logs, Benachrichtigungen?'),
(84, 2, 618, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.3', 'Informationszugriff', 'offen', NULL, NULL, NULL, 618, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:50', 'Wie setzen Sie technisch durch, dass nur berechtigte Personen auf bestimmte Informationen und Systeme zugreifen können, z. B. Rollenkonzept, Gruppenberechtigungen?\nWelche Systeme protokollieren Zugriffe und wie lange bewahren Sie diese Protokolle auf?\nWie überprüfen Sie regelmäßig, ob vergebene Zugriffsrechte noch angemessen sind?'),
(85, 2, 619, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.4', 'Quellcodezugriff', 'offen', NULL, NULL, NULL, 619, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:50', 'Wo wird der Quellcode Ihrer ISMS-Software gespeichert und wer hat darauf Zugriff, z. B. Git-Repository, Cloud-Dienst?\nWelche Zugriffskontrollen schützen das Repository vor unbefugter Einsicht oder Änderungen, z. B. Branch-Protection, Code-Review-Pflicht?\nWie stellen Sie die Nachvollziehbarkeit von Änderungen sicher, z. B. Commit-Historie, signierte Commits?\nWelche Maßnahmen verhindern, dass Quellcode unkontrolliert das Unternehmen verlässt?'),
(86, 2, 620, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.5', 'Sichere Authentisierung', 'offen', NULL, NULL, NULL, 620, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:50', 'Welche Authentisierungsverfahren setzen Sie für kritische Systeme ein, z. B. Cloud-Konsolen, Repository, Produktivumgebung?\nWo nutzen Sie Mehrfaktor-Authentisierung und nach welchen Kriterien entscheiden Sie über deren Einsatz?\nWie stellen Sie sicher, dass Passwörter ausreichend stark sind und nicht mehrfach verwendet werden?\nWelche Vorgaben gelten für die Authentisierung gegenüber Ihrer SaaS-Plattform durch Kunden?'),
(87, 2, 621, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.6', 'Kapazitätsmanagement', 'offen', NULL, NULL, NULL, 621, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:50', 'Wie überwachen Sie die Auslastung Ihrer Cloud-Ressourcen oder Server, z. B. CPU, Speicher, Datenbankkapazität?\nWelche Schwellenwerte oder Alarme haben Sie definiert, um Engpässe frühzeitig zu erkennen?\nWie planen Sie Kapazitäten für Lastspitzen, etwa bei steigender Kundenzahl Ihrer ISMS-Software?\nWelche Dokumentation oder Aufzeichnungen belegen Ihre Kapazitätsplanung?'),
(88, 2, 622, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.7', 'Malware-Schutz', 'offen', NULL, NULL, NULL, 622, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:50', 'Welche Schutzmaßnahmen gegen Schadsoftware setzen Sie auf Endgeräten und Servern ein, z. B. Antivirus, EDR-Lösung?\nWie stellen Sie sicher, dass Signaturen und Schutzmechanismen aktuell bleiben?\nWie werden erkannte Bedrohungen gemeldet und behandelt?\nGibt es Ausnahmen vom Malware-Schutz und wie werden diese dokumentiert und begründet?'),
(89, 2, 623, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.8', 'Technische Schwachstellen', 'offen', NULL, NULL, NULL, 623, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:50', 'Wie erfahren Sie von neuen Schwachstellen in den von Ihnen eingesetzten Komponenten, z. B. CVE-Feeds, Herstellermeldungen, Dependency-Scanner?\nNach welchen Kriterien bewerten und priorisieren Sie Schwachstellen für Ihre Umgebung?\nWie schnell werden kritische Patches eingespielt und wie dokumentieren Sie dies?\nWie gehen Sie mit Schwachstellen um, für die noch kein Patch verfügbar ist?'),
(90, 2, 624, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.9', 'Konfigurationsmanagement', 'offen', NULL, NULL, NULL, 624, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:50', 'Welche sicheren Basiskonfigurationen haben Sie für Server, Cloud-Dienste und Entwicklungsumgebungen definiert, z. B. Hardening-Guides, Konfigurations-Templates?\nWie stellen Sie sicher, dass Konfigurationen nicht unautorisiert verändert werden, z. B. Infrastructure-as-Code, Änderungsprotokolle?\nWie oft überprüfen Sie, ob aktuelle Konfigurationen noch den Vorgaben entsprechen?'),
(91, 2, 625, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.10', 'Informationslöschung', 'offen', NULL, NULL, NULL, 625, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:50', 'Welche Verfahren nutzen Sie, um Daten auf Speichermedien oder in Cloud-Diensten sicher zu löschen, z. B. kryptografisches Löschen, Überschreiben?\nWie stellen Sie sicher, dass auch Backups und Replikate berücksichtigt werden?\nWie dokumentieren Sie durchgeführte Löschvorgänge, z. B. Löschprotokolle?\nWelche gesetzlichen Aufbewahrungsfristen beachten Sie vor einer Löschung?'),
(92, 2, 626, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.11', 'Datenmaskierung', 'offen', NULL, NULL, NULL, 626, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:50', 'In welchen Szenarien arbeiten Sie mit maskierten oder reduzierten Daten, z. B. in Test- oder Entwicklungsumgebungen Ihrer ISMS-Software?\nWelche Techniken setzen Sie zur Datenmaskierung ein, z. B. Anonymisierung, Pseudonymisierung, synthetische Daten?\nWie stellen Sie sicher, dass Produktivdaten nicht ungeschützt in Testumgebungen gelangen?'),
(93, 2, 627, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.12', 'Datenverlustprävention', 'offen', NULL, NULL, NULL, 627, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:50', 'Welche Mechanismen verhindern, dass sensible Daten unkontrolliert das Unternehmen verlassen, z. B. E-Mail-Filter, Cloud-Freigaben, USB-Einschränkungen?\nWie erkennen Sie ungewöhnliche Datenabflüsse oder -übertragungen?\nWelche Richtlinien gelten für den Umgang mit Kundendaten aus Ihrer SaaS-Plattform?\nWie sensibilisieren Sie Ihr Team für die Risiken unerlaubter Datenübertragung?'),
(94, 2, 628, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.13', 'Datensicherung', 'offen', NULL, NULL, NULL, 628, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:50', 'Welche Daten und Systeme werden wie häufig gesichert, z. B. Quellcode, Kundendaten, Konfigurationen?\nWo werden Backups aufbewahrt und wie sind sie vor unbefugtem Zugriff geschützt, z. B. Verschlüsselung, separater Standort?\nWann haben Sie zuletzt eine Wiederherstellung getestet und was war das Ergebnis?\nWie schnell könnten Sie nach einem Datenverlust den Betrieb Ihrer ISMS-Software wiederherstellen?'),
(95, 2, 629, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.14', 'Redundanz', 'offen', NULL, NULL, NULL, 629, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:50', 'Welche Verfügbarkeitsziele haben Sie für Ihre SaaS-Plattform definiert und wo sind diese dokumentiert?\nWelche Redundanzen nutzen Sie, um Ausfälle abzufangen, z. B. mehrstufige Cloud-Regionen, Datenbank-Replikation?\nWie haben Sie getestet, ob ein Failover im Ernstfall funktioniert?\nWie gehen Sie mit Single-Points-of-Failure in Ihrer Infrastruktur um?'),
(96, 2, 630, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.15', 'Protokollierung', 'offen', NULL, NULL, NULL, 630, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:50', 'Welche sicherheitsrelevanten Ereignisse werden protokolliert, z. B. Anmeldeversuche, Rechtevergabe, Systemänderungen?\nWo werden Logs gespeichert und wie schützen Sie sie vor Manipulation oder vorzeitiger Löschung?\nWie lange bewahren Sie Protokolle auf und welche Vorgaben liegen dem zugrunde?\nWer hat Zugriff auf die Logs und wie ist dieser Zugriff eingeschränkt?'),
(97, 2, 631, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.16', 'Monitoring', 'offen', NULL, NULL, NULL, 631, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:50', 'Wie überwachen Sie Ihre Systeme auf Anomalien, verdächtige Aktivitäten oder Angriffe, z. B. Alerting, SIEM, Cloud-Monitoring?\nWelche Schwellenwerte oder Regeln lösen Alarme aus und wer wird benachrichtigt?\nWie schnell reagieren Sie auf erkannte Abweichungen und wie ist der Prozess dokumentiert?\nWie stellen Sie sicher, dass Alarme nicht übersehen werden – auch außerhalb der Geschäftszeiten?'),
(98, 2, 632, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.17', 'Uhrzeitsynchronisation', 'offen', NULL, NULL, NULL, 632, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:50', 'Wie stellen Sie sicher, dass alle Systeme eine einheitliche Zeitquelle nutzen, z. B. NTP-Server, Cloud-Zeitdienst?\nWelche Systeme sind an die zentrale Zeitquelle angebunden und wie überprüfen Sie die Synchronisation?\nWie würden Sie Abweichungen der Systemzeit erkennen und korrigieren?'),
(99, 2, 633, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.18', 'Nutzung privilegierter Programme', 'offen', NULL, NULL, NULL, 633, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:50', 'Welche administrativen Tools und Befehle stehen Ihrem Team zur Verfügung, z. B. Remote-Shells, Datenbank-Clients, Cloud-CLIs?\nWie kontrollieren und beschränken Sie den Einsatz solcher privilegierten Programme?\nWie wird die Nutzung dieser Tools protokolliert und nachvollziehbar gemacht?\nGibt es Vorgaben, wann und durch wen solche Programme eingesetzt werden dürfen?'),
(100, 2, 634, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.19', 'Softwareinstallation', 'offen', NULL, NULL, NULL, 634, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:40:50', 'Wie stellen Sie sicher, dass nur freigegebene Software auf Arbeitsgeräten und Servern installiert wird?\nWelche Freigabe- oder Genehmigungsverfahren gelten für neue Software, z. B. Freigabeliste, Prüfung durch Verantwortlichen?\nWie überprüfen Sie die Herkunft und Integrität von Software vor der Installation, z. B. Signaturen, offizielle Quellen?\nWie verhindern Sie die Installation nicht autorisierter Programme?'),
(101, 2, 635, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.20', 'Netzwerksicherheit', 'offen', NULL, NULL, NULL, 635, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:41:22', 'Wie ist Ihr Netzwerk aktuell strukturiert und nach welchen Kriterien haben Sie Segmente gebildet?\nWelche Schutzbedarfsstufen unterscheiden Sie für Ihre Netzwerkbereiche, z. B. Entwicklung, SaaS-Infrastruktur, Büronetz?\nWie sind externe Verbindungen zu Kunden oder Cloud-Diensten abgesichert, und welche Firewall-Regeln oder VPN-Konfigurationen dokumentieren dies?\nWer ist für die Pflege der Netzwerksicherheitsregeln verantwortlich, und wo ist dies festgehalten?'),
(102, 2, 636, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.21', 'Netzwerkdienste', 'offen', NULL, NULL, NULL, 636, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:41:22', 'Welche Netzwerkdienste betreiben Sie intern oder extern, und wie stellen Sie sicher, dass nur benötigte Dienste aktiv sind?\nWie überwachen Sie Ihre Netzwerkdienste auf Verfügbarkeit und sicherheitsrelevante Ereignisse?\nWelche Dokumentation belegt die sichere Konfiguration Ihrer Dienste, z. B. Härtungsrichtlinien, Konfigurationsdateien, Monitoring-Dashboards?'),
(103, 2, 637, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.22', 'Trennung von Netzwerken', 'offen', NULL, NULL, NULL, 637, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:41:22', 'Wie trennen Sie Netzwerksegmente technisch voneinander, z. B. durch VLANs, Firewalls oder separate Netze?\nWie verhindern Sie, dass ein kompromittiertes System auf andere Segmente wie Ihre SaaS-Produktionsumgebung übergreifen kann?\nWelche Nachweise existieren für die Segmentierung, z. B. Netzwerkdiagramme, Firewall-Regelwerke, VLAN-Konfigurationen?'),
(104, 2, 638, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.23', 'Webfilterung', 'offen', NULL, NULL, NULL, 638, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:41:22', 'Gibt es Vorgaben, welche Webseiten oder Kategorien von Ihren Mitarbeitern aufgerufen werden dürfen?\nWelche technischen Maßnahmen setzen Sie ein, um Zugriffe auf schädliche Inhalte zu blockieren, z. B. DNS-Filter, Proxy, Endpoint-Protection?\nWie dokumentieren Sie diese Richtlinien und deren Umsetzung, z. B. Filterprofile, Protokolle blockierter Zugriffe?'),
(105, 2, 639, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.24', 'Kryptografische Verfahren', 'offen', NULL, NULL, NULL, 639, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:41:22', 'Für welche Anwendungsfälle setzen Sie Verschlüsselung ein, z. B. Datenübertragung zur SaaS-Plattform, Speicherung von Kundendaten?\nNach welchen Kriterien wählen Sie Verschlüsselungsverfahren und Schlüssellängen aus?\nWelche Dokumentation belegt Ihre Kryptografie-Richtlinie und deren Umsetzung, z. B. TLS-Konfigurationen, Verschlüsselungskonzept?'),
(106, 2, 640, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.25', 'Schlüsselmanagement', 'offen', NULL, NULL, NULL, 640, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:41:22', 'Wie erzeugen, speichern und schützen Sie kryptografische Schlüssel für Ihre SaaS-Anwendung und interne Systeme?\nWelches Verfahren nutzen Sie für Schlüsselrotation und wie dokumentieren Sie die Außerbetriebnahme alter Schlüssel?\nWo sind Verantwortlichkeiten und Prozesse für das Schlüsselmanagement festgelegt, z. B. Key-Management-Richtlinie, HSM-Dokumentation?'),
(107, 2, 641, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.26', 'Sichere Entwicklung', 'offen', NULL, NULL, NULL, 641, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:41:22', 'Wie stellen Sie sicher, dass Sicherheitsanforderungen von Beginn an in Ihre Softwareentwicklung einfließen?\nWelche Rollen und Verantwortlichkeiten für sichere Entwicklung haben Sie definiert?\nWelche Dokumente beschreiben Ihren sicheren Entwicklungsprozess, z. B. Entwicklungsrichtlinie, Security-Requirements, Definition of Done?'),
(108, 2, 642, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.27', 'Sichere Architektur', 'offen', NULL, NULL, NULL, 642, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:41:22', 'Nach welchen Sicherheitsprinzipien entwerfen Sie die Architektur Ihrer ISMS-Software, z. B. Least Privilege, Defense in Depth?\nWie dokumentieren Sie Architekturentscheidungen unter Sicherheitsaspekten, z. B. Architekturdiagramme, Threat Models?\nWer prüft neue Systemdesigns auf Einhaltung dieser Prinzipien, und wie ist dieser Review-Prozess geregelt?'),
(109, 2, 643, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.28', 'Sicheres Coding', 'offen', NULL, NULL, NULL, 643, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:41:22', 'Welche Coding-Standards oder Richtlinien nutzen Sie, um typische Sicherheitslücken wie Injection oder XSS zu vermeiden?\nWie führen Sie Code-Reviews durch, und welche Sicherheitsaspekte werden dabei geprüft?\nWelche Nachweise gibt es für die Einhaltung dieser Standards, z. B. Coding Guidelines, Review-Protokolle, statische Code-Analyse-Berichte?'),
(110, 2, 644, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.29', 'Sicherheitstests', 'offen', NULL, NULL, NULL, 644, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:41:22', 'Welche Sicherheitstests führen Sie vor der Produktivsetzung durch, z. B. Penetrationstests, SAST, DAST, manuelle Reviews?\nWie planen Sie diese Tests, und wer ist für Durchführung und Nachverfolgung von Findings verantwortlich?\nWelche Dokumentation belegt die Testergebnisse und deren Behebung, z. B. Testberichte, Issue-Tracker, Abnahmeprotokolle?'),
(111, 2, 645, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.30', 'Externe Entwicklung', 'offen', NULL, NULL, NULL, 645, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:41:22', 'Beauftragen Sie externe Entwickler oder Dienstleister für Teile Ihrer Software, und falls ja, für welche Komponenten?\nWie stellen Sie vertraglich sicher, dass externe Partner Ihre Sicherheitsanforderungen einhalten?\nWelche Nachweise fordern Sie von externen Entwicklern ein, z. B. Sicherheitstests, Code-Reviews, Vertraulichkeitsvereinbarungen?'),
(112, 2, 646, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.31', 'Produktionsumgebung', 'offen', NULL, NULL, NULL, 646, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:41:22', 'Wie schützen Sie Ihre SaaS-Produktionsumgebung vor unbefugtem Zugriff und unautorisierten Änderungen?\nWer hat Zugriff auf Produktionssysteme, und wie ist dieser Zugriff dokumentiert und kontrolliert?\nWelche Nachweise existieren für den Schutz der Produktionsumgebung, z. B. Zugriffsrechtelisten, Härtungsdokumentation, Änderungsprotokolle?');
INSERT INTO `aud_pruefpunkte` (`id`, `audit_id`, `norm_id`, `norm`, `kapitel`, `nummer`, `titel`, `bewertung`, `feststellung`, `nachweis`, `abweichung_id`, `sortierung`, `Ersteller`, `erstellt`, `Aenderer`, `geaendert`, `beschreibung`) VALUES
(113, 2, 647, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.32', 'Änderungsmanagement', 'offen', NULL, NULL, NULL, 647, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:41:22', 'Wie läuft Ihr Änderungsmanagement ab, von der Beantragung über Bewertung bis zur Freigabe und Umsetzung?\nWer genehmigt Änderungen an Systemen und Software, und wie dokumentieren Sie diese Freigaben?\nWelche Aufzeichnungen führen Sie über durchgeführte Änderungen, z. B. Change-Tickets, Deployment-Logs, Freigabeprotokolle?'),
(114, 2, 648, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.33', 'Testdaten', 'offen', NULL, NULL, NULL, 648, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:41:22', 'Wie gehen Sie mit Testdaten um, insbesondere wenn diese echte Kundendaten oder personenbezogene Daten enthalten könnten?\nWelche Maßnahmen setzen Sie ein, um Vertraulichkeit zu wahren, z. B. Anonymisierung, Maskierung, synthetische Daten?\nWelche Dokumentation belegt Ihre Vorgehensweise, z. B. Testdatenrichtlinie, Anonymisierungsprotokolle?'),
(115, 2, 649, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.34', 'Trennung Test/Produktion', 'offen', NULL, NULL, NULL, 649, 18, '2026-08-30 17:52:17', 18, '2026-09-22 11:41:22', 'Wie trennen Sie Ihre Test- und Entwicklungsumgebungen von der Produktionsumgebung Ihrer SaaS-Plattform?\nWelche technischen und organisatorischen Maßnahmen verhindern, dass Produktivdaten in Testumgebungen gelangen oder Tests die Produktion beeinflussen?\nWelche Nachweise dokumentieren diese Trennung, z. B. Umgebungsübersicht, Netzwerkdiagramme, Zugriffsregelungen?'),
(116, 3, 1733, 'NIS2', 'Kap. I – Allgemeine Bestimmungen', 'Art. 2', 'Geltungsbereich – Betroffene Einrichtungen', 'offen', NULL, NULL, NULL, 1733, 18, '2026-09-22 06:33:28', 18, '2026-09-22 07:34:37', 'Die Anforderung verlangt eine systematische Selbsteinschätzung, ob die Organisation unter die NIS2-Richtlinie fällt. Geprüft wird, ob eine nachvollziehbare Analyse der Sektorzugehörigkeit (Anhang I/II), der Größenkriterien (Mitarbeiterzahl, Umsatz) und der Konzernverflechtungen vorliegt. Typische Lücken sind fehlende Dokumentation der Einstufungsentscheidung oder unberücksichtigte Tochtergesellschaften. Nachweise umfassen die schriftliche Einstufungsdokumentation, Organigramme, Geschäftsberichte und einen Prozess zur regelmäßigen Überprüfung bei Strukturänderungen.'),
(117, 3, 1734, 'NIS2', 'Kap. I – Allgemeine Bestimmungen', 'Art. 3', 'Registrierung wesentlicher und wichtiger Einrichtungen', 'offen', NULL, NULL, NULL, 1734, 18, '2026-09-22 06:33:28', 18, '2026-09-22 07:34:37', 'Die Anforderung fordert die fristgerechte Registrierung beim BSI mit vollständigen Angaben wie Name, Kontaktdaten, Sektorzugehörigkeit und IP-Adressbereichen sowie einen benannten Ansprechpartner. Prüffragen zielen auf die Einhaltung der Fristen, die Vollständigkeit der Angaben und den Aktualisierungsprozess bei Änderungen. Häufige Lücken sind verspätete Registrierungen oder fehlende 24/7-Erreichbarkeit bei kritischen Einrichtungen. Nachweise sind Registrierungsbestätigungen, Korrespondenz mit dem BSI und interne Prozessbeschreibungen zur Datenpflege.'),
(118, 3, 1735, 'NIS2', 'Kap. II – Koordinierung', 'Art. 8', 'Zuständige Behörden und zentrale Anlaufstellen', 'offen', NULL, NULL, NULL, 1735, 18, '2026-09-22 06:33:28', 18, '2026-09-22 07:34:37', 'Die Anforderung verlangt, dass die Organisation ihre zuständigen Aufsichtsbehörden kennt und Kommunikationswege etabliert hat. Geprüft wird, ob das BSI und ggf. weitere sektorale Behörden identifiziert sind und eine interne Kontaktperson für behördliche Anfragen benannt wurde. Typische Lücken sind unklare Zuständigkeiten oder fehlende Prozesse für behördliche Meldungen. Nachweise umfassen Kontaktlisten, Organigramme mit benannten Ansprechpartnern und dokumentierte Kommunikationsprozesse.'),
(119, 3, 1736, 'NIS2', 'Kap. IV – Risikomanagement', 'Art. 20', 'Governance – Verantwortung der Leitungsorgane', 'offen', NULL, NULL, NULL, 1736, 18, '2026-09-22 06:33:28', 18, '2026-09-22 07:34:37', 'Die Anforderung stellt die persönliche Verantwortung der Geschäftsleitung für Cybersicherheit in den Mittelpunkt. Geprüft wird, ob das Leitungsorgan Sicherheitsmaßnahmen genehmigt, deren Umsetzung überwacht und selbst regelmäßig geschult wird. Typische Lücken sind fehlende Schulungsnachweise der Geschäftsführung oder unzureichende Berichterstattung an die Leitung. Nachweise sind Schulungszertifikate, Protokolle von Leitungssitzungen, Bestellungsurkunden eines CISO und regelmäßige Management-Reports zur Cybersicherheitslage.'),
(120, 3, 1737, 'NIS2', 'Kap. IV – Risikomanagement', 'Art. 21 Abs. 1', 'Risikomanagement – Allgemeine Verpflichtung', 'offen', NULL, NULL, NULL, 1737, 18, '2026-09-22 06:33:28', 18, '2026-09-22 07:34:37', 'Die Anforderung fordert ein dokumentiertes Risikomanagement-Framework, das Cybersicherheitsrisiken systematisch identifiziert, bewertet und behandelt. Geprüft wird, ob ein All-Hazard-Ansatz verfolgt wird und Maßnahmen verhältnismäßig zur Größe und Risiko der Organisation sind. Typische Lücken sind veraltete Risikoanalysen oder fehlende Berichte an das Leitungsorgan. Nachweise umfassen Risikomanagement-Richtlinien, Risikoregister, Behandlungspläne und Protokolle der jährlichen Überprüfung.'),
(121, 3, 1738, 'NIS2', 'Kap. IV – Risikomanagement', 'Art. 21 Abs. 2a', 'Risikoanalyse und Sicherheitskonzepte für Informationssysteme', 'offen', NULL, NULL, NULL, 1738, 18, '2026-09-22 06:33:28', 18, '2026-09-22 07:34:37', 'Die Anforderung verlangt dokumentierte Konzepte zur Risikoanalyse und eine genehmigte Informationssicherheitsrichtlinie. Geprüft wird, ob Schutzbedarfsfeststellungen für IT-Systeme vorliegen, Restrisiken durch die Leitung akzeptiert sind und externe Bedrohungslagen einbezogen werden. Typische Lücken sind fehlende oder veraltete IS-Policies sowie nicht dokumentierte Risikoakzeptanzen. Nachweise sind die IS-Policy, Schutzbedarfsanalysen, Risk Treatment Plans und Protokolle der Risikoakzeptanz durch die Geschäftsleitung.'),
(122, 3, 1739, 'NIS2', 'Kap. IV – Risikomanagement', 'Art. 21 Abs. 2b', 'Bewältigung von Sicherheitsvorfällen (Incident Handling)', 'offen', NULL, NULL, NULL, 1739, 18, '2026-09-22 06:33:28', 18, '2026-09-22 07:34:37', 'Die Anforderung fordert dokumentierte Verfahren zur Bewältigung von Sicherheitsvorfällen einschließlich eines getesteten Incident-Response-Plans. Geprüft wird, ob Rollen, Eskalationsstufen und Klassifizierungsschemata definiert sind sowie Lessons-Learned-Prozesse und regelmäßige Übungen stattfinden. Typische Lücken sind ungetestete Pläne oder fehlende forensische Sicherungsprozesse. Nachweise umfassen den IRP, Übungsprotokolle, Vorfallsberichte, Eskalationsmatrizen und Dokumentation durchgeführter Nachbereitungen.'),
(123, 3, 1740, 'NIS2', 'Kap. IV – Risikomanagement', 'Art. 21 Abs. 2c', 'Business Continuity und Krisenmanagement', 'offen', NULL, NULL, NULL, 1740, 18, '2026-09-22 06:33:28', 18, '2026-09-22 07:34:37', 'Die Anforderung verlangt dokumentierte Business-Continuity- und Krisenmanagementpläne für Cybervorfälle mit definierten RTO/RPO-Werten. Geprüft wird, ob Backup-Strategien getestet, ein Krisenmanagementteam benannt und Krisenkommunikationspläne vorhanden sind. Typische Lücken sind ungetestete Wiederherstellungsverfahren oder fehlende jährliche BCM-Übungen. Nachweise sind BCP, DRP, Testprotokolle, Backup-Wiederherstellungsnachweise und Dokumentation des Krisenmanagementteams.'),
(124, 3, 1741, 'NIS2', 'Kap. IV – Risikomanagement', 'Art. 21 Abs. 2d', 'Sicherheit der Lieferkette (Supply Chain Security)', 'offen', NULL, NULL, NULL, 1741, 18, '2026-09-22 06:33:28', 18, '2026-09-22 07:34:37', 'Die Anforderung fordert die Berücksichtigung von Cybersicherheitsrisiken in Lieferantenbeziehungen. Geprüft wird, ob ein Lieferanteninventar mit Risikokategorisierung existiert, Sicherheitsanforderungen vertraglich verankert sind und regelmäßige Bewertungen kritischer Lieferanten stattfinden. Typische Lücken sind fehlende Exit-Strategien oder nicht einbezogene Sub-Auftragnehmer. Nachweise umfassen Lieferantenlisten, Vertragsklauseln, Audit-Berichte, Zertifikate der Lieferanten und Exit-Management-Pläne.'),
(125, 3, 1742, 'NIS2', 'Kap. IV – Risikomanagement', 'Art. 21 Abs. 2e', 'Sicherheit in Erwerb, Entwicklung und Wartung von IT-Systemen', 'offen', NULL, NULL, NULL, 1742, 18, '2026-09-22 06:33:28', 18, '2026-09-22 07:34:37', 'Die Anforderung verlangt Sicherheit beim Erwerb, der Entwicklung und Wartung von IT-Systemen. Geprüft wird, ob Sicherheitsanforderungen in Ausschreibungen enthalten sind, ein Secure Development Lifecycle sowie Schwachstellen- und Patch-Management etabliert sind. Typische Lücken sind fehlende Sicherheitstests vor Produktivsetzung oder nicht dokumentierte Coding Guidelines. Nachweise sind Lastenhefte mit Sicherheitsanforderungen, SSDLC-Dokumentation, Penetrationstest-Berichte, Patch-Management-Prozesse und Schwachstellenregister.'),
(126, 3, 1743, 'NIS2', 'Kap. IV – Risikomanagement', 'Art. 21 Abs. 2f', 'Bewertung der Wirksamkeit von Risikomanagementmaßnahmen', 'offen', NULL, NULL, NULL, 1743, 18, '2026-09-22 06:33:28', NULL, NULL, NULL),
(127, 3, 1744, 'NIS2', 'Kap. IV – Risikomanagement', 'Art. 21 Abs. 2g', 'Cyberhygiene und Schulungen zur Cybersicherheit', 'offen', NULL, NULL, NULL, 1744, 18, '2026-09-22 06:33:28', NULL, NULL, NULL),
(128, 3, 1745, 'NIS2', 'Kap. IV – Risikomanagement', 'Art. 21 Abs. 2h', 'Kryptographie und Verschlüsselung', 'offen', NULL, NULL, NULL, 1745, 18, '2026-09-22 06:33:28', NULL, NULL, NULL),
(129, 3, 1746, 'NIS2', 'Kap. IV – Risikomanagement', 'Art. 21 Abs. 2i', 'Personalsicherheit, Zugriffskontrolle und Asset-Management', 'offen', NULL, NULL, NULL, 1746, 18, '2026-09-22 06:33:28', NULL, NULL, NULL),
(130, 3, 1747, 'NIS2', 'Kap. IV – Risikomanagement', 'Art. 21 Abs. 2j', 'Multi-Faktor-Authentifizierung und sichere Kommunikation', 'offen', NULL, NULL, NULL, 1747, 18, '2026-09-22 06:33:28', NULL, NULL, NULL),
(131, 3, 1748, 'NIS2', 'Kap. IV – Risikomanagement', 'Art. 21 Abs. 3', 'Europäische Cybersicherheitsstandards und Zertifizierungsschemata', 'offen', NULL, NULL, NULL, 1748, 18, '2026-09-22 06:33:28', NULL, NULL, NULL),
(132, 3, 1749, 'NIS2', 'Kap. IV – Risikomanagement', 'Art. 23 Abs. 1', 'Meldepflicht erheblicher Sicherheitsvorfälle', 'offen', NULL, NULL, NULL, 1749, 18, '2026-09-22 06:33:28', NULL, NULL, NULL),
(133, 3, 1750, 'NIS2', 'Kap. IV – Risikomanagement', 'Art. 23 Abs. 3', 'Kriterien für einen erheblichen Sicherheitsvorfall', 'offen', NULL, NULL, NULL, 1750, 18, '2026-09-22 06:33:28', NULL, NULL, NULL),
(134, 3, 1751, 'NIS2', 'Kap. IV – Risikomanagement', 'Art. 23 Abs. 4-5', 'Meldeprozess und Kommunikationspflichten', 'offen', NULL, NULL, NULL, 1751, 18, '2026-09-22 06:33:28', NULL, NULL, NULL),
(135, 3, 1752, 'NIS2', 'Kap. IV – Risikomanagement', 'Art. 24', 'Nutzung europäischer Cybersicherheitszertifizierungsschemata', 'offen', NULL, NULL, NULL, 1752, 18, '2026-09-22 06:33:28', NULL, NULL, NULL),
(136, 3, 1753, 'NIS2', 'Kap. IV – Risikomanagement', 'Art. 25', 'Standardisierung der Cybersicherheitsmaßnahmen', 'offen', NULL, NULL, NULL, 1753, 18, '2026-09-22 06:33:28', NULL, NULL, NULL),
(137, 3, 1754, 'NIS2', 'Kap. V – Aufsicht und Durchsetzung', 'Art. 30', 'Aufsichtsmaßnahmen und Informationspflichten gegenüber Behörden', 'offen', NULL, NULL, NULL, 1754, 18, '2026-09-22 06:33:28', NULL, NULL, NULL),
(138, 3, 1755, 'NIS2', 'Kap. V – Aufsicht und Durchsetzung', 'Art. 32-33', 'Aufsichtsmaßnahmen für wesentliche und wichtige Einrichtungen', 'offen', NULL, NULL, NULL, 1755, 18, '2026-09-22 06:33:28', NULL, NULL, NULL),
(139, 3, 1756, 'NIS2', 'Kap. V – Aufsicht und Durchsetzung', 'Art. 34', 'Sanktionen und Bußgeldrahmen', 'offen', NULL, NULL, NULL, 1756, 18, '2026-09-22 06:33:28', NULL, NULL, NULL),
(140, 3, 1757, 'NIS2', 'Sektorspezifische Anforderungen', 'Anh. I – Sektor 1', 'Energie – Strom, Gas, Öl, Wasserstoff', 'offen', NULL, NULL, NULL, 1757, 18, '2026-09-22 06:33:28', NULL, NULL, NULL),
(141, 3, 1758, 'NIS2', 'Sektorspezifische Anforderungen', 'Anh. I – Sektor 2', 'Verkehr – Luft, Bahn, Wasser, Straße', 'offen', NULL, NULL, NULL, 1758, 18, '2026-09-22 06:33:28', NULL, NULL, NULL),
(142, 3, 1759, 'NIS2', 'Sektorspezifische Anforderungen', 'Anh. I – Sektor 3', 'Bankwesen und Finanzmarktinfrastrukturen', 'offen', NULL, NULL, NULL, 1759, 18, '2026-09-22 06:33:28', NULL, NULL, NULL),
(143, 3, 1760, 'NIS2', 'Sektorspezifische Anforderungen', 'Anh. I – Sektor 4', 'Gesundheitswesen', 'offen', NULL, NULL, NULL, 1760, 18, '2026-09-22 06:33:28', NULL, NULL, NULL),
(144, 3, 1761, 'NIS2', 'Sektorspezifische Anforderungen', 'Anh. I – Sektor 6', 'Digitale Infrastruktur und IKT-Dienstleister', 'offen', NULL, NULL, NULL, 1761, 18, '2026-09-22 06:33:28', NULL, NULL, NULL),
(145, 3, 1762, 'NIS2', 'Sektorspezifische Anforderungen', 'Anh. II – Wichtige Einr.', 'Wichtige Einrichtungen – Sektoren Anhang II', 'offen', NULL, NULL, NULL, 1762, 18, '2026-09-22 06:33:28', NULL, NULL, NULL),
(146, 3, 1763, 'NIS2', 'Umsetzung DE – BSIG n.F.', 'BSIG §30', 'Technische und organisatorische Maßnahmen (TOM) nach deutschem Recht', 'offen', NULL, NULL, NULL, 1763, 18, '2026-09-22 06:33:28', NULL, NULL, NULL),
(147, 3, 1764, 'NIS2', 'Umsetzung DE – BSIG n.F.', 'BSIG §32', 'Meldepflichten nach deutschem Recht', 'offen', NULL, NULL, NULL, 1764, 18, '2026-09-22 06:33:28', NULL, NULL, NULL),
(148, 3, 1765, 'NIS2', 'Umsetzung DE – BSIG n.F.', 'BSIG §33', 'Registrierungspflicht und Selbstauskunft gegenüber dem BSI', 'offen', NULL, NULL, NULL, 1765, 18, '2026-09-22 06:33:28', NULL, NULL, NULL),
(149, 3, 1766, 'NIS2', 'Umsetzung DE – BSIG n.F.', 'BSIG §38', 'Pflichten und Haftung der Geschäftsleitung', 'offen', NULL, NULL, NULL, 1766, 18, '2026-09-22 06:33:28', NULL, NULL, NULL),
(150, 3, 1767, 'NIS2', 'Umsetzung DE – BSIG n.F.', 'BSIG §65', 'Bußgeld- und Sanktionssystem nach deutschem Recht', 'offen', NULL, NULL, NULL, 1767, 18, '2026-09-22 06:33:28', NULL, NULL, NULL),
(186, 5, 534, 'ISO/IEC 27001:2022', 'Kapitel 4', '4.1', 'Organisatorischer Kontext', 'offen', NULL, NULL, 2, 534, 29, '2026-09-22 10:58:43', 29, '2026-09-22 10:58:58', NULL),
(187, 5, 536, 'ISO/IEC 27001:2022', 'Kapitel 4', '4.2', 'Erwartungen interessierter Parteien', 'offen', NULL, NULL, NULL, 536, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(188, 5, 537, 'ISO/IEC 27001:2022', 'Kapitel 4', '4.3', 'Geltungsbereich des ISMS', 'offen', NULL, NULL, NULL, 537, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(189, 5, 538, 'ISO/IEC 27001:2022', 'Kapitel 4', '4.4', 'Informationssicherheitsmanagementsystem', 'offen', NULL, NULL, NULL, 538, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(190, 5, 539, 'ISO/IEC 27001:2022', 'Kapitel 5', '5.1', 'Führung und Verpflichtung', 'offen', NULL, NULL, NULL, 539, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(191, 5, 540, 'ISO/IEC 27001:2022', 'Kapitel 5', '5.2', 'Informationssicherheitspolitik', 'offen', NULL, NULL, NULL, 540, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(192, 5, 541, 'ISO/IEC 27001:2022', 'Kapitel 5', '5.3', 'Rollen und Verantwortlichkeiten', 'offen', NULL, NULL, NULL, 541, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(193, 5, 542, 'ISO/IEC 27001:2022', 'Kapitel 6', '6.1', 'Umgang mit Risiken und Chancen', 'offen', NULL, NULL, NULL, 542, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(194, 5, 543, 'ISO/IEC 27001:2022', 'Kapitel 6', '6.1.1', 'Risikobewertung', 'offen', NULL, NULL, NULL, 543, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(195, 5, 544, 'ISO/IEC 27001:2022', 'Kapitel 6', '6.1.2', 'Risikobehandlung', 'offen', NULL, NULL, NULL, 544, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(196, 5, 545, 'ISO/IEC 27001:2022', 'Kapitel 6', '6.2', 'Informationssicherheitsziele', 'offen', NULL, NULL, NULL, 545, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(197, 5, 546, 'ISO/IEC 27001:2022', 'Kapitel 7', '7.1', 'Ressourcen', 'offen', NULL, NULL, NULL, 546, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(198, 5, 547, 'ISO/IEC 27001:2022', 'Kapitel 7', '7.2', 'Kompetenz', 'offen', NULL, NULL, NULL, 547, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(199, 5, 548, 'ISO/IEC 27001:2022', 'Kapitel 7', '7.3', 'Bewusstsein', 'offen', NULL, NULL, NULL, 548, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(200, 5, 549, 'ISO/IEC 27001:2022', 'Kapitel 7', '7.4', 'Kommunikation', 'offen', NULL, NULL, NULL, 549, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(201, 5, 550, 'ISO/IEC 27001:2022', 'Kapitel 7', '7.5', 'Dokumentierte Informationen', 'offen', NULL, NULL, NULL, 550, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(202, 5, 551, 'ISO/IEC 27001:2022', 'Kapitel 8', '8.1', 'Betriebliche Planung und Steuerung', 'offen', NULL, NULL, NULL, 551, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(203, 5, 552, 'ISO/IEC 27001:2022', 'Kapitel 9', '9.1', 'Überwachung, Messung und Analyse', 'offen', NULL, NULL, NULL, 552, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(204, 5, 553, 'ISO/IEC 27001:2022', 'Kapitel 9', '9.2', 'Internes Audit', 'offen', NULL, NULL, NULL, 553, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(205, 5, 554, 'ISO/IEC 27001:2022', 'Kapitel 9', '9.3', 'Managementbewertung', 'offen', NULL, NULL, NULL, 554, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(206, 5, 555, 'ISO/IEC 27001:2022', 'Kapitel 10', '10.1', 'Nichtkonformität und Korrekturmaßnahmen', 'offen', NULL, NULL, NULL, 555, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(207, 5, 556, 'ISO/IEC 27001:2022', 'Kapitel 10', '10.2', 'Kontinuierliche Verbesserung', 'offen', NULL, NULL, NULL, 556, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(208, 5, 557, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.1', 'Richtlinien zur Informationssicherheit', 'offen', NULL, NULL, NULL, 557, 29, '2026-09-22 10:58:43', 29, '2026-09-22 11:00:17', 'Gefordert ist eine dokumentierte Informationssicherheitsleitlinie, die Grundsätze, Ziele und Verbindlichkeit festlegt. Bei einem Kleinunternehmen mit unter 10 Mitarbeitern genügt ein schlankes, ein- bis zweiseitiges Dokument, das von der Geschäftsführung freigegeben ist. Prüfer achten darauf, ob die Leitlinie allen Mitarbeitern bekannt ist und ob sie aktuelle Themen wie Cloud-Nutzung oder SaaS-Entwicklung adressiert. Typische Nachweise sind das unterschriebene Dokument, Verteilnachweise (z. B. E-Mail, Intranet) und Bestätigung der Kenntnisnahme durch Mitarbeiter.'),
(209, 5, 558, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.2', 'Überprüfung der Sicherheitsvorgaben', 'offen', NULL, NULL, NULL, 558, 29, '2026-09-22 10:58:43', 29, '2026-09-22 11:00:17', 'Die Sicherheitsrichtlinien müssen regelmäßig auf Aktualität und Wirksamkeit geprüft werden – bei einem kleinen Softwareunternehmen reicht oft ein jährlicher Review durch die Geschäftsführung. Prüfer fragen nach dem letzten Überprüfungsdatum, ausgelösten Änderungen und ob externe Faktoren wie neue Bedrohungen oder Kundenanforderungen berücksichtigt wurden. Nachweise sind datierte Reviewprotokolle, Versionsstände der Dokumente und dokumentierte Anpassungen nach relevanten Ereignissen.'),
(210, 5, 559, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.3', 'Rollen und Verantwortlichkeiten', 'offen', NULL, NULL, NULL, 559, 29, '2026-09-22 10:58:43', 29, '2026-09-22 11:00:17', 'Aufgaben, Verantwortlichkeiten und Befugnisse für Informationssicherheit müssen klar zugewiesen und kommuniziert sein. In einem Kleinbetrieb kann dies pragmatisch über Stellenbeschreibungen, eine einfache RACI-Matrix oder einen Organigramm-Anhang erfolgen. Prüfer achten darauf, ob jeder weiß, wer für Sicherheitsthemen zuständig ist und ob Stellvertretungen geregelt sind. Nachweise sind dokumentierte Rollenzuweisungen, Arbeitsverträge mit Sicherheitsaufgaben oder Protokolle, die die Kommunikation belegen.'),
(211, 5, 560, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.4', 'Leitungsverantwortung', 'offen', NULL, NULL, NULL, 560, 29, '2026-09-22 10:58:43', 29, '2026-09-22 11:00:17', 'Die Geschäftsführung muss Informationssicherheit aktiv unterstützen und ausreichende Ressourcen bereitstellen. Bei einer kleinen GmbH zeigt sich dies durch persönliches Engagement, Budgetfreigaben für Sicherheitsmaßnahmen und Teilnahme an Reviews. Prüfer fragen, wie die Leitung ihr Commitment demonstriert und ob Zeit und Mittel für ISMS-Aufgaben eingeplant sind. Nachweise sind Management-Review-Protokolle, freigegebene Budgets, Schulungsteilnahmen der Führung und dokumentierte Entscheidungen zu Sicherheitsthemen.'),
(212, 5, 561, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.5', 'Kontakt zu Behörden', 'offen', NULL, NULL, NULL, 561, 29, '2026-09-22 10:58:43', 29, '2026-09-22 11:00:17', 'Relevante Behördenkontakte für Sicherheitsvorfälle müssen identifiziert und dokumentiert sein – für ein IT-Unternehmen in Baden-Württemberg etwa BSI, LKA Cybercrime, Datenschutzaufsicht und ggf. CERT-Bund. Prüfer fragen, ob Kontaktdaten aktuell vorliegen und wann diese zuletzt geprüft wurden. Nachweise sind eine gepflegte Kontaktliste mit Ansprechpartnern, dokumentierte Meldewege und ggf. Nachweise über bisherige Abstimmungen oder Meldungen.'),
(213, 5, 562, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.6', 'Kontakt zu Interessengruppen', 'offen', NULL, NULL, NULL, 562, 29, '2026-09-22 10:58:43', 29, '2026-09-22 11:00:17', 'Der Austausch mit externen Interessengruppen zur Informationssicherheit soll geplant sein. Für ein SaaS-Unternehmen sind das z. B. Branchenverbände wie Bitkom, ISACA-Chapter, Security-Communities oder Kundengruppen mit Sicherheitsanforderungen. Prüfer achten darauf, ob relevante Gruppen identifiziert sind und wie der Informationsaustausch erfolgt. Nachweise sind eine Liste relevanter Stakeholder, Mitgliedschaften, Teilnahmenachweise an Arbeitskreisen oder dokumentierter Informationsaustausch.'),
(214, 5, 563, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.7', 'Threat Intelligence', 'offen', NULL, NULL, NULL, 563, 29, '2026-09-22 10:58:43', 29, '2026-09-22 11:00:17', 'Bedrohungsinformationen müssen systematisch gesammelt und in Schutzmaßnahmen einbezogen werden. Für einen kleinen Softwareentwickler genügt das regelmäßige Auswerten von BSI-Warnungen, CVE-Feeds oder branchenspezifischen Security-Newslettern. Prüfer fragen, welche Quellen genutzt werden, wie Informationen bewertet und welche Maßnahmen daraus abgeleitet wurden. Nachweise sind abonnierte Quellen, dokumentierte Auswertungen und nachvollziehbare Reaktionen auf relevante Bedrohungshinweise.'),
(215, 5, 564, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.8', 'Informationssicherheit im Projektmanagement', 'offen', NULL, NULL, NULL, 564, 29, '2026-09-22 10:58:43', 29, '2026-09-22 11:00:17', 'Sicherheitsanforderungen müssen in Projekte integriert werden – von Planung bis Go-Live. Bei der Entwicklung einer ISMS-Software bedeutet das Security by Design, Threat Modeling und Sicherheitstests vor Release. Prüfer achten darauf, ob Projekte eine Sicherheitsbetrachtung durchlaufen und ob dies dokumentiert ist. Nachweise sind Projektchecklisten mit Sicherheitskriterien, Risikoanalysen für Projekte, Testprotokolle und Freigabedokumente mit Sicherheitsabnahme.'),
(216, 5, 565, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.9', 'Asset-Inventar', 'offen', NULL, NULL, NULL, 565, 29, '2026-09-22 10:58:43', 29, '2026-09-22 11:00:17', 'Alle Informationswerte müssen inventarisiert sein, sodass Zuständigkeiten und Schutzbedarf erkennbar sind. Für ein kleines Softwareunternehmen umfasst dies Quellcode, Kundendaten, Server, Entwicklungsumgebungen und Cloud-Ressourcen. Prüfer fragen, ob das Inventar vollständig, aktuell und mit Eigentümern versehen ist. Nachweise sind eine Asset-Liste (z. B. Excel, CMDB), dokumentierte Schutzbedarfsfeststellungen und ein nachvollziehbarer Aktualisierungsprozess.'),
(217, 5, 566, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.10', 'Erlaubte Nutzung von Assets', 'offen', NULL, NULL, NULL, 566, 29, '2026-09-22 10:58:43', 29, '2026-09-22 11:00:17', 'Für die Nutzung von Informationswerten müssen klare Regeln existieren, um Missbrauch und Datenabfluss zu verhindern. Bei einem SaaS-Anbieter betrifft dies z. B. Umgang mit Quellcode, Kundendaten, Testdaten und Cloud-Zugängen. Prüfer achten darauf, ob Nutzungsregeln dokumentiert, kommuniziert und praktisch umsetzbar sind. Nachweise sind Nutzungsrichtlinien, Arbeitsanweisungen, Bestätigungen der Mitarbeiter und ggf. technische Einschränkungen wie Zugriffskontrollen.'),
(218, 5, 567, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.11', 'Rückgabe von Assets', 'offen', NULL, NULL, NULL, 567, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(219, 5, 568, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.12', 'Klassifizierung von Informationen', 'offen', NULL, NULL, NULL, 568, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(220, 5, 569, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.13', 'Kennzeichnung von Informationen', 'offen', NULL, NULL, NULL, 569, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(221, 5, 570, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.14', 'Informationsübertragung', 'offen', NULL, NULL, NULL, 570, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(222, 5, 571, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.15', 'Zugriffskontrolle', 'offen', NULL, NULL, NULL, 571, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(223, 5, 572, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.16', 'Identitätsmanagement', 'offen', NULL, NULL, NULL, 572, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(224, 5, 573, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.17', 'Authentifizierungsinformationen', 'offen', NULL, NULL, NULL, 573, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(225, 5, 574, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.18', 'Berechtigungsverwaltung', 'offen', NULL, NULL, NULL, 574, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(226, 5, 575, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.19', 'Informationssicherheit bei Lieferanten', 'offen', NULL, NULL, NULL, 575, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(227, 5, 576, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.20', 'Sicherheitsanforderungen an Lieferanten', 'offen', NULL, NULL, NULL, 576, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(228, 5, 577, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.21', 'Lieferantenüberwachung', 'offen', NULL, NULL, NULL, 577, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(229, 5, 578, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.22', 'Service-Delivery-Management', 'offen', NULL, NULL, NULL, 578, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(230, 5, 579, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.23', 'Nutzung von Cloud-Diensten', 'offen', NULL, NULL, NULL, 579, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(231, 5, 580, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.24', 'Incident-Management', 'offen', NULL, NULL, NULL, 580, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(232, 5, 581, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.25', 'Bewertung von Sicherheitsereignissen', 'offen', NULL, NULL, NULL, 581, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(233, 5, 582, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.26', 'Reaktion auf Sicherheitsvorfälle', 'offen', NULL, NULL, NULL, 582, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(234, 5, 583, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.27', 'Lernen aus Vorfällen', 'offen', NULL, NULL, NULL, 583, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(235, 5, 584, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.28', 'Beweissicherung', 'offen', NULL, NULL, NULL, 584, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(236, 5, 585, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.29', 'Informationssicherheit in Notfällen', 'offen', NULL, NULL, NULL, 585, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(237, 5, 586, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.30', 'IKT-Bereitschaft für Business Continuity', 'offen', NULL, NULL, NULL, 586, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(238, 5, 587, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.31', 'Rechtliche Anforderungen', 'offen', NULL, NULL, NULL, 587, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(239, 5, 588, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.32', 'Geistiges Eigentum', 'offen', NULL, NULL, NULL, 588, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(240, 5, 589, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.33', 'Schutz von Aufzeichnungen', 'offen', NULL, NULL, NULL, 589, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(241, 5, 590, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.34', 'Datenschutz', 'offen', NULL, NULL, NULL, 590, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(242, 5, 591, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.35', 'Unabhängige Sicherheitsprüfung', 'offen', NULL, NULL, NULL, 591, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(243, 5, 592, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.36', 'Einhaltung von Richtlinien', 'offen', NULL, NULL, NULL, 592, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(244, 5, 593, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.37', 'Technische Compliance', 'offen', NULL, NULL, NULL, 593, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(245, 5, 594, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.1', 'Hintergrundprüfungen', 'offen', NULL, NULL, NULL, 594, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(246, 5, 595, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.2', 'Arbeitsverträge', 'offen', NULL, NULL, NULL, 595, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(247, 5, 596, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.3', 'Sensibilisierung und Schulung', 'offen', NULL, NULL, NULL, 596, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(248, 5, 597, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.4', 'Disziplinarische Maßnahmen', 'offen', NULL, NULL, NULL, 597, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(249, 5, 598, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.5', 'Verantwortlichkeiten nach Beendigung', 'offen', NULL, NULL, NULL, 598, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(250, 5, 599, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.6', 'Vertraulichkeitsvereinbarungen', 'offen', NULL, NULL, NULL, 599, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(251, 5, 600, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.7', 'Remote Work', 'offen', NULL, NULL, NULL, 600, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(252, 5, 601, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.8', 'Meldung von Sicherheitsereignissen', 'offen', NULL, NULL, NULL, 601, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(253, 5, 602, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.1', 'Sicherheitszonen', 'offen', NULL, NULL, NULL, 602, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(254, 5, 603, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.2', 'Zutrittskontrolle', 'offen', NULL, NULL, NULL, 603, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(255, 5, 604, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.3', 'Sicherung von Büros', 'offen', NULL, NULL, NULL, 604, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(256, 5, 605, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.4', 'Physische Überwachung', 'offen', NULL, NULL, NULL, 605, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(257, 5, 606, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.5', 'Schutz vor Umweltgefahren', 'offen', NULL, NULL, NULL, 606, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(258, 5, 607, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.6', 'Arbeiten in gesicherten Bereichen', 'offen', NULL, NULL, NULL, 607, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(259, 5, 608, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.7', 'Clear Desk / Clear Screen', 'offen', NULL, NULL, NULL, 608, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(260, 5, 609, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.8', 'Standortgebundene Geräte', 'offen', NULL, NULL, NULL, 609, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(261, 5, 610, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.9', 'Außerbetriebnahme von Geräten', 'offen', NULL, NULL, NULL, 610, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(262, 5, 611, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.10', 'Lagerung von Datenträgern', 'offen', NULL, NULL, NULL, 611, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(263, 5, 612, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.11', 'Unterstützende Infrastruktur', 'offen', NULL, NULL, NULL, 612, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(264, 5, 613, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.12', 'Kabelschutz', 'offen', NULL, NULL, NULL, 613, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(265, 5, 614, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.13', 'Wartung von Geräten', 'offen', NULL, NULL, NULL, 614, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(266, 5, 615, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.14', 'Entsorgung', 'offen', NULL, NULL, NULL, 615, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(267, 5, 616, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.1', 'Endgerätesicherheit', 'offen', NULL, NULL, NULL, 616, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(268, 5, 617, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.2', 'Privilegierte Zugriffe', 'offen', NULL, NULL, NULL, 617, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(269, 5, 618, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.3', 'Informationszugriff', 'offen', NULL, NULL, NULL, 618, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(270, 5, 619, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.4', 'Quellcodezugriff', 'offen', NULL, NULL, NULL, 619, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(271, 5, 620, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.5', 'Sichere Authentisierung', 'offen', NULL, NULL, NULL, 620, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(272, 5, 621, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.6', 'Kapazitätsmanagement', 'offen', NULL, NULL, NULL, 621, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(273, 5, 622, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.7', 'Malware-Schutz', 'offen', NULL, NULL, NULL, 622, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(274, 5, 623, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.8', 'Technische Schwachstellen', 'offen', NULL, NULL, NULL, 623, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(275, 5, 624, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.9', 'Konfigurationsmanagement', 'offen', NULL, NULL, NULL, 624, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(276, 5, 625, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.10', 'Informationslöschung', 'offen', NULL, NULL, NULL, 625, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(277, 5, 626, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.11', 'Datenmaskierung', 'offen', NULL, NULL, NULL, 626, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(278, 5, 627, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.12', 'Datenverlustprävention', 'offen', NULL, NULL, NULL, 627, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(279, 5, 628, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.13', 'Datensicherung', 'offen', NULL, NULL, NULL, 628, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(280, 5, 629, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.14', 'Redundanz', 'offen', NULL, NULL, NULL, 629, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(281, 5, 630, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.15', 'Protokollierung', 'offen', NULL, NULL, NULL, 630, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(282, 5, 631, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.16', 'Monitoring', 'offen', NULL, NULL, NULL, 631, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(283, 5, 632, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.17', 'Uhrzeitsynchronisation', 'offen', NULL, NULL, NULL, 632, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(284, 5, 633, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.18', 'Nutzung privilegierter Programme', 'offen', NULL, NULL, NULL, 633, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(285, 5, 634, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.19', 'Softwareinstallation', 'offen', NULL, NULL, NULL, 634, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(286, 5, 635, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.20', 'Netzwerksicherheit', 'offen', NULL, NULL, NULL, 635, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(287, 5, 636, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.21', 'Netzwerkdienste', 'offen', NULL, NULL, NULL, 636, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(288, 5, 637, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.22', 'Trennung von Netzwerken', 'offen', NULL, NULL, NULL, 637, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(289, 5, 638, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.23', 'Webfilterung', 'offen', NULL, NULL, NULL, 638, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(290, 5, 639, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.24', 'Kryptografische Verfahren', 'offen', NULL, NULL, NULL, 639, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(291, 5, 640, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.25', 'Schlüsselmanagement', 'offen', NULL, NULL, NULL, 640, 29, '2026-09-22 10:58:43', NULL, NULL, NULL),
(292, 5, 641, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.26', 'Sichere Entwicklung', 'offen', NULL, NULL, NULL, 641, 29, '2026-09-22 10:58:43', 29, '2026-09-22 11:02:34', 'Die Anforderung verlangt, dass Sicherheitsaspekte systematisch in den Softwareentwicklungsprozess integriert werden – von der Anforderungsanalyse bis zur Auslieferung. Für ein kleines Softwareunternehmen reicht oft eine dokumentierte Checkliste mit Sicherheitsanforderungen je Ticket oder User Story sowie klare Verantwortlichkeiten im Team. Prüfer achten darauf, ob Sicherheitsanforderungen nachvollziehbar erfasst und bei Abnahme geprüft werden. Typische Nachweise sind Entwicklungsrichtlinien, Ticket-System mit Security-Kriterien, Definition-of-Done und Freigabeprotokolle. Bei einer SaaS-Lösung ist besonders relevant, wie Mandantentrennung und Datenschutz bereits in Anforderungen einfließen.'),
(293, 5, 642, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.27', 'Sichere Architektur', 'offen', NULL, NULL, NULL, 642, 29, '2026-09-22 10:58:43', 29, '2026-09-22 11:02:34', 'Hier wird geprüft, ob Systeme nach anerkannten Sicherheitsprinzipien entworfen werden: Trennung von Komponenten, minimale Rechte, Defense-in-Depth. Für eine ISMS-Software bedeutet das etwa strikte Mandantentrennung, API-Gateway-Konzepte und Netzwerksegmentierung. Der Prüfer fragt nach Architekturdiagrammen, Designentscheidungen und deren Sicherheitsbegründung. Typische Lücken sind fehlende Dokumentation oder monolithische Strukturen ohne Trennungskonzept. Nachweise umfassen Architekturskizzen, Threat-Modeling-Ergebnisse und Protokolle von Design-Reviews, auch wenn diese bei einem Kleinunternehmen pragmatisch ausfallen dürfen.'),
(294, 5, 643, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.28', 'Sicheres Coding', 'offen', NULL, NULL, NULL, 643, 29, '2026-09-22 10:58:43', 29, '2026-09-22 11:02:34', 'Entwicklungsrichtlinien sollen typische Programmierfehler wie Injection, XSS oder unsichere Authentifizierung vermeiden. Für ein kleines Entwicklerteam genügt oft ein verbindlicher Coding-Standard mit OWASP-Bezug plus systematische Code-Reviews. Der Prüfer fragt, welche Standards gelten, wie sie vermittelt werden und ob Reviews stattfinden. Typische Lücken sind fehlende oder veraltete Richtlinien und ausbleibende Vier-Augen-Kontrolle. Nachweise sind Coding-Guidelines, Review-Protokolle oder Merge-Request-Kommentare, IDE-Linter-Konfigurationen und ggf. SAST-Tool-Berichte.'),
(295, 5, 644, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.29', 'Sicherheitstests', 'offen', NULL, NULL, NULL, 644, 29, '2026-09-22 10:58:43', 29, '2026-09-22 11:02:34', 'Vor Produktivsetzung müssen gezielte Sicherheitstests geplant und durchgeführt werden, um Schwachstellen frühzeitig zu erkennen. Für ein kleines SaaS-Unternehmen sind automatisierte Scans (DAST, Dependency-Check) und manuelle Penetrationstests bei größeren Releases angemessen. Der Prüfer prüft, ob ein Testplan existiert, wann zuletzt getestet wurde und wie mit Findings umgegangen wird. Typische Lücken sind fehlende Regelmäßigkeit oder nicht behobene kritische Schwachstellen. Nachweise sind Testpläne, Scan-Reports, Pentest-Berichte und Ticket-Nachverfolgung der Befunde.'),
(296, 5, 645, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.30', 'Externe Entwicklung', 'offen', NULL, NULL, NULL, 645, 29, '2026-09-22 10:58:43', 29, '2026-09-22 11:02:34', 'Werden Entwicklungsleistungen extern vergeben, müssen Sicherheitsanforderungen vertraglich festgelegt und deren Einhaltung überwacht werden. Bei einem Kleinunternehmen betrifft das oft Freelancer oder Agenturleistungen. Der Prüfer fragt nach Vertragsklauseln zu Sicherheitsstandards, Geheimhaltung, Codequalität und Übergabeprozessen. Typische Lücken sind fehlende NDA, unklare Schnittstellenverantwortung oder kein Code-Review externer Lieferungen. Nachweise umfassen Verträge mit Sicherheitsanhang, Abnahmeprotokolle, dokumentierte Schnittstellendefinitionen und Review-Ergebnisse für externen Code.'),
(297, 5, 646, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.31', 'Produktionsumgebung', 'offen', NULL, NULL, NULL, 646, 29, '2026-09-22 10:58:43', 29, '2026-09-22 11:02:34', 'Produktionssysteme – hier die SaaS-Plattform – erfordern besonderen Schutz: strikter Zugriff nur für Berechtigte, kontrollierte Änderungen, Überwachung. Der Prüfer prüft, ob Produktionszugang auf wenige Personen beschränkt ist, Änderungen dokumentiert werden und Notfallzugriffe geregelt sind. Typische Lücken sind Shared-Accounts, fehlende Protokollierung oder unkontrollierte Direktzugriffe. Nachweise sind Zugriffslisten, Rollendefinitionen, Change-Logs, Monitoring-Dashboards und Protokolle von Wartungszugriffen. Bei Hosting in der Cloud ist die Konfiguration des Cloud-Providers relevant.'),
(298, 5, 647, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.32', 'Änderungsmanagement', 'offen', NULL, NULL, NULL, 647, 29, '2026-09-22 10:58:43', 29, '2026-09-22 11:02:34', 'Änderungen an Systemen und Software müssen geplant, bewertet, genehmigt und dokumentiert werden, um unkontrollierte Auswirkungen zu vermeiden. Für ein kleines Team reicht ein schlanker Prozess: Ticket anlegen, Auswirkungen prüfen, Freigabe durch zweite Person, Dokumentation im Versionskontrollsystem. Der Prüfer fragt nach dem Change-Prozess, Genehmigungsstufen und Rückrollmöglichkeiten. Typische Lücken sind undokumentierte Hotfixes oder fehlende Freigaben. Nachweise sind Change-Policy, Tickethistorie, Git-Commits mit Merge-Approvals und Release-Notes.'),
(299, 5, 648, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.33', 'Testdaten', 'offen', NULL, NULL, NULL, 648, 29, '2026-09-22 10:58:43', 29, '2026-09-22 11:02:34', 'Testdaten dürfen keine echten personenbezogenen oder vertraulichen Produktionsdaten enthalten, sofern sie nicht anonymisiert oder maskiert sind. Bei einer ISMS-Software mit Kundendaten ist das besonders kritisch. Der Prüfer fragt, woher Testdaten stammen, ob Produktionsdaten kopiert werden und welche Schutzmaßnahmen greifen. Typische Lücken sind ungeschützte Datenbank-Dumps in Testumgebungen oder fehlende Anonymisierungsroutinen. Nachweise sind Richtlinien zur Testdatenverwendung, Anonymisierungsskripte, Freigaben für Testdaten und Protokolle der Datenbeschaffung.'),
(300, 5, 649, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.34', 'Trennung Test/Produktion', 'offen', NULL, NULL, NULL, 649, 29, '2026-09-22 10:58:43', 29, '2026-09-22 11:01:21', 'Die Anforderung verlangt eine klare Trennung zwischen Test- und Produktivumgebungen, um Risiken durch Datenabfluss, versehentliche Änderungen oder Fehlbedienung zu minimieren. Für einen kleinen Softwareanbieter mit SaaS-Produkt ist dies besonders relevant, da Kundendaten in der Produktivumgebung geschützt werden müssen und Entwicklungsfehler nicht live wirksam werden dürfen. Bei der Prüfung wird geachtet auf: getrennte Infrastruktur oder zumindest logische Separation, unterschiedliche Zugriffsrechte, Verwendung anonymisierter oder synthetischer Testdaten statt echter Kundendaten. Typische Nachweise sind Netzwerk- oder Systemarchitektur-Dokumentation, Konfigurationsnachweise der Cloud-Umgebung, Berechtigungslisten sowie Entwicklerinterviews zur tatsächlichen Arbeitsweise bei Deployments und Tests.'),
(301, 6, 557, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.1', 'Richtlinien zur Informationssicherheit', 'offen', NULL, NULL, NULL, 557, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Existiert eine schriftliche Informationssicherheitsrichtlinie, und wer hat diese freigegeben?\r\nWelche Kernthemen deckt Ihre Richtlinie ab, z. B. Schutzziele, Geltungsbereich, Verantwortlichkeiten?\r\nWie stellen Sie sicher, dass alle Mitarbeitenden die Richtlinie kennen und verstehen, z. B. Onboarding, Intranet, Unterschrift?\r\nWann wurde die Richtlinie zuletzt aktualisiert, und was war der Anlass?'),
(302, 6, 558, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.2', 'Überprüfung der Sicherheitsvorgaben', 'offen', NULL, NULL, NULL, 558, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'In welchem Turnus überprüfen Sie Ihre Sicherheitsrichtlinien auf Aktualität und Angemessenheit?\r\nWer ist für die Bewertung und Freigabe von Änderungen verantwortlich?\r\nWelche Auslöser führen zu einer außerplanmäßigen Überprüfung, z. B. neue Bedrohungen, Vorfälle, Gesetzesänderungen?\r\nWie dokumentieren Sie durchgeführte Reviews und deren Ergebnisse, z. B. Protokolle, Versionierung?'),
(303, 6, 559, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.3', 'Rollen und Verantwortlichkeiten', 'offen', NULL, NULL, NULL, 559, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie sind Rollen und Verantwortlichkeiten für Informationssicherheit in Ihrem Kleinteam festgelegt, z. B. Organigramm, Stellenbeschreibung, RACI-Matrix?\r\nWer übernimmt die Funktion eines Informationssicherheitsbeauftragten oder vergleichbare Aufgaben?\r\nWie kommunizieren Sie diese Zuständigkeiten an alle Mitarbeitenden?\r\nSind Vertretungsregelungen definiert, falls Verantwortliche ausfallen?'),
(304, 6, 560, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.4', 'Leitungsverantwortung', 'offen', NULL, NULL, NULL, 560, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie zeigt die Geschäftsführung ihr aktives Engagement für Informationssicherheit, z. B. Budget, Teilnahme an Reviews, Unterschrift unter Richtlinien?\r\nWelche Ressourcen – zeitlich, personell, finanziell – stehen für Sicherheitsmaßnahmen zur Verfügung?\r\nWie wird Informationssicherheit in strategische Entscheidungen einbezogen, etwa bei der SaaS-Produktentwicklung?'),
(305, 6, 561, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.5', 'Kontakt zu Behörden', 'offen', NULL, NULL, NULL, 561, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Welche Behörden sind für Sie im Sicherheitskontext relevant, z. B. BSI, LfDI Baden-Württemberg, CERT-Bund?\r\nWo sind Kontaktdaten und Ansprechpartner dokumentiert?\r\nIn welchen Fällen würden Sie Kontakt aufnehmen, z. B. Meldepflichten nach DSGVO, NIS2-Relevanz prüfen?\r\nHaben Sie bereits Erfahrungen mit behördlicher Kommunikation gesammelt?'),
(306, 6, 562, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.6', 'Kontakt zu Interessengruppen', 'offen', NULL, NULL, NULL, 562, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Mit welchen externen Interessengruppen tauschen Sie sich zu Sicherheitsthemen aus, z. B. Branchenverbände, ISACA, Bitkom-Arbeitskreise?\r\nWie ist dieser Austausch organisiert, z. B. Abonnements, Mitgliedschaften, regelmäßige Meetings?\r\nWelchen Nutzen ziehen Sie daraus für Ihre Sicherheitsmaßnahmen?\r\nWer im Unternehmen pflegt diese Kontakte?'),
(307, 6, 563, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.7', 'Threat Intelligence', 'offen', NULL, NULL, NULL, 563, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie informieren Sie sich über aktuelle Bedrohungen und Schwachstellen, z. B. BSI-Warnungen, CVE-Feeds, Security-Newsletter?\r\nWer wertet diese Informationen aus und entscheidet über Maßnahmen?\r\nWie fließen gewonnene Erkenntnisse in Ihre Schutzmaßnahmen oder Ihr Risikomanagement ein?\r\nKönnen Sie ein Beispiel nennen, bei dem Threat Intelligence zu einer konkreten Maßnahme geführt hat?'),
(308, 6, 564, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.8', 'Informationssicherheit im Projektmanagement', 'offen', NULL, NULL, NULL, 564, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie stellen Sie sicher, dass Sicherheitsanforderungen von Beginn an in Ihre Softwareprojekte einfließen, z. B. Security-Checklisten, Anforderungskataloge?\r\nWelche Sicherheitsaspekte prüfen Sie bei der Entwicklung Ihrer ISMS-Software, z. B. sichere Codierung, Penetrationstests?\r\nWie wird Sicherheit bei der Übergabe in den Betrieb oder bei Releases berücksichtigt?\r\nWer trägt die Verantwortung für Sicherheit im Projektverlauf?'),
(309, 6, 565, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.9', 'Asset-Inventar', 'offen', NULL, NULL, NULL, 565, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Führen Sie ein Inventar Ihrer Informationswerte, z. B. Systeme, Daten, Softwarelizenzen, und wo ist dieses dokumentiert?\r\nWelche Angaben erfassen Sie pro Asset, z. B. Eigentümer, Standort, Schutzbedarf?\r\nWie halten Sie das Inventar aktuell, insbesondere bei neuen Entwicklungen für Ihr SaaS-Produkt?\r\nWer ist für die Pflege des Asset-Inventars verantwortlich?'),
(310, 6, 566, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.10', 'Erlaubte Nutzung von Assets', 'offen', NULL, NULL, NULL, 566, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Welche Regeln gelten für die Nutzung von IT-Systemen, Daten und Software, z. B. Nutzungsrichtlinie, Betriebsvereinbarung?\r\nWie ist die private Nutzung von Firmengeräten geregelt?\r\nWelche Vorkehrungen treffen Sie gegen Datenabfluss, z. B. bei Kundendaten in der SaaS-Lösung?\r\nWie werden Mitarbeitende über erlaubte und untersagte Nutzung informiert?'),
(311, 6, 567, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.11', 'Rückgabe von Assets', 'offen', NULL, NULL, NULL, 567, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie stellen Sie sicher, dass beim Austritt eines Mitarbeitenden alle Assets zurückgegeben werden, z. B. Checkliste, Übergabeprotokoll?\r\nWelche Zugänge und Berechtigungen werden bei Austritt oder Rollenwechsel entzogen, und wer veranlasst dies?\r\nWie schnell erfolgt die Sperrung von Accounts nach Vertragsende?\r\nGibt es dokumentierte Fälle, in denen dieses Verfahren angewendet wurde?');
INSERT INTO `aud_pruefpunkte` (`id`, `audit_id`, `norm_id`, `norm`, `kapitel`, `nummer`, `titel`, `bewertung`, `feststellung`, `nachweis`, `abweichung_id`, `sortierung`, `Ersteller`, `erstellt`, `Aenderer`, `geaendert`, `beschreibung`) VALUES
(312, 6, 568, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.12', 'Klassifizierung von Informationen', 'offen', NULL, NULL, NULL, 568, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Nach welchem Schema klassifizieren Sie Ihre Informationen, z. B. öffentlich, intern, vertraulich, streng vertraulich?\r\nWelche Kriterien nutzen Sie für die Einstufung, z. B. Geschäftsgeheimnis, Kundendaten, personenbezogene Daten?\r\nWo ist das Klassifizierungsschema dokumentiert, und wer entscheidet über die Einstufung?\r\nWie leiten Sie aus der Klassifizierung konkrete Schutzmaßnahmen ab?'),
(313, 6, 569, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.13', 'Kennzeichnung von Informationen', 'offen', NULL, NULL, NULL, 569, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie kennzeichnen Sie klassifizierte Informationen, z. B. Wasserzeichen, Header, Dateinamenskonvention, Labels in Tools?\r\nGilt die Kennzeichnung sowohl für digitale als auch für physische Dokumente?\r\nWie stellen Sie sicher, dass Mitarbeitende die Kennzeichnung verstehen und beachten?\r\nWas passiert, wenn ein Dokument nicht gekennzeichnet ist?'),
(314, 6, 570, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.14', 'Informationsübertragung', 'offen', NULL, NULL, NULL, 570, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Welche Regeln gelten für die Übertragung vertraulicher Informationen, z. B. Verschlüsselungspflicht, zugelassene Kanäle?\r\nWie übermitteln Sie sensible Daten an Kunden oder Partner, z. B. verschlüsselte E-Mail, SFTP, sichere Portale?\r\nWer gibt die Weitergabe vertraulicher Informationen frei?\r\nWie dokumentieren Sie die Übertragung, z. B. Protokolle, Empfangsbestätigungen?'),
(315, 6, 571, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.15', 'Zugriffskontrolle', 'offen', NULL, NULL, NULL, 571, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Nach welchen Prinzipien vergeben Sie Zugriffsrechte, z. B. Need-to-know, Least Privilege, rollenbasiert?\r\nWie dokumentieren Sie, wer auf welche Systeme und Daten zugreifen darf, z. B. Berechtigungsmatrix, IAM-Tool?\r\nIn welchem Turnus überprüfen Sie bestehende Berechtigungen?\r\nWie gehen Sie mit privilegierten Zugängen um, z. B. Administratorrechte?'),
(316, 6, 572, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.16', 'Identitätsmanagement', 'offen', NULL, NULL, NULL, 572, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie legen Sie neue Benutzerkonten an, und welche Freigabeschritte sind erforderlich?\r\nWie werden Änderungen an Identitäten dokumentiert, z. B. Namensänderung, Abteilungswechsel?\r\nWie stellen Sie sicher, dass inaktive Konten zeitnah deaktiviert werden?\r\nWelche Systeme nutzen Sie für die Identitätsverwaltung, z. B. zentrales AD, Cloud-IdP?'),
(317, 6, 573, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.17', 'Authentifizierungsinformationen', 'offen', NULL, NULL, NULL, 573, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Welche Passwortrichtlinien gelten, z. B. Mindestlänge, Komplexität, Ablaufdauer?\r\nWie werden Passwörter und andere Authentifizierungsdaten sicher gespeichert, z. B. Passwort-Manager, Hashing?\r\nNutzen Sie Multi-Faktor-Authentifizierung, insbesondere für kritische Systeme oder Ihre SaaS-Plattform?\r\nWie stellen Sie Passwörter bei Ersteinrichtung oder Zurücksetzen sicher bereit?'),
(318, 6, 574, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.18', 'Berechtigungsverwaltung', 'offen', NULL, NULL, NULL, 574, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie wird die Vergabe von Zugriffsrechten beantragt und freigegeben, z. B. Ticketsystem, schriftlicher Antrag?\r\nWer genehmigt Berechtigungen, und wie wird dies dokumentiert?\r\nIn welchem Rhythmus führen Sie Rezertifizierungen durch, und wie dokumentieren Sie diese?\r\nWie schnell werden Rechte entzogen, wenn sie nicht mehr benötigt werden?'),
(319, 6, 575, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.19', 'Informationssicherheit bei Lieferanten', 'offen', NULL, NULL, NULL, 575, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Welche Lieferanten haben Zugang zu Ihren Informationen oder Systemen, z. B. Hosting-Provider, Cloud-Dienste, Freelancer?\r\nWie bewerten Sie die Informationssicherheit Ihrer Lieferanten vor Vertragsabschluss, z. B. Fragebögen, Zertifikate, Audits?\r\nWelche Risiken sehen Sie in Ihrer Lieferkette, insbesondere für Ihre SaaS-Plattform?\r\nWie überwachen Sie die Sicherheitsleistung Ihrer Lieferanten laufend?'),
(320, 6, 576, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.20', 'Sicherheitsanforderungen an Lieferanten', 'offen', NULL, NULL, NULL, 576, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Welche Sicherheitsanforderungen vereinbaren Sie vertraglich mit Lieferanten, z. B. Vertraulichkeitsklauseln, AVV, SLA zur Sicherheit?\r\nWie stellen Sie sicher, dass Anforderungen dem Risiko und Schutzbedarf entsprechen?\r\nWelche Nachweise fordern Sie von Lieferanten, z. B. ISO-27001-Zertifikat, SOC-2-Report, Pentestberichte?\r\nWie gehen Sie vor, wenn ein Lieferant die Anforderungen nicht erfüllt?'),
(321, 6, 577, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.21', 'Lieferantenüberwachung', 'offen', NULL, NULL, NULL, 577, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Welche Lieferanten mit Zugriff auf Ihre Systeme oder Daten haben Sie identifiziert, und wie dokumentieren Sie deren Sicherheitsanforderungen?\r\nWie überprüfen Sie regelmäßig, ob diese Lieferanten die vereinbarten Sicherheitsanforderungen einhalten, z. B. durch Zertifikatsnachweise, Selbstauskünfte oder Berichte?\r\nWelche Nachweise fordern Sie von Ihren Cloud- und Hosting-Anbietern an, z. B. SOC-2-Reports, ISO-27001-Zertifikate oder Penetrationstest-Berichte?\r\nWie gehen Sie vor, wenn ein Lieferant Sicherheitsanforderungen nicht erfüllt?'),
(322, 6, 578, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.22', 'Service-Delivery-Management', 'offen', NULL, NULL, NULL, 578, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Welche Dienstleistungen haben Sie ausgelagert, die für Ihre ISMS-Software oder Kundendaten relevant sind?\r\nWie stellen Sie sicher, dass diese externen Leistungen im laufenden Betrieb Ihre Sicherheitsanforderungen einhalten, z. B. durch SLAs, regelmäßige Reviews oder definierte Ansprechpartner?\r\nWelche Dokumente belegen die Steuerung ausgelagerter Leistungen, z. B. Dienstleisterverträge mit Sicherheitsanhang, Protokolle von Service-Reviews?\r\nWer ist intern verantwortlich für die Überwachung der externen Dienstleister?'),
(323, 6, 579, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.23', 'Nutzung von Cloud-Diensten', 'offen', NULL, NULL, NULL, 579, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Welche Cloud-Dienste nutzen Sie für Entwicklung, Betrieb oder Speicherung Ihrer SaaS-Lösung und Kundendaten?\r\nWie haben Sie die Sicherheitsanforderungen an diese Cloud-Dienste definiert und dokumentiert, z. B. in einer Cloud-Richtlinie oder Risikoanalyse?\r\nWelche Risikobewertung haben Sie für jeden genutzten Cloud-Dienst durchgeführt, und wo ist diese dokumentiert?\r\nWelche technischen und organisatorischen Kontrollen setzen Sie zur sicheren Cloud-Nutzung um, z. B. Verschlüsselung, Zugriffsmanagement, Standortwahl innerhalb der EU?'),
(324, 6, 580, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.24', 'Incident-Management', 'offen', NULL, NULL, NULL, 580, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie erkennen und melden Ihre Mitarbeitenden Sicherheitsvorfälle – gibt es einen definierten Meldeweg, z. B. E-Mail-Adresse, Ticket-System oder Ansprechpartner?\r\nWelches Verfahren nutzen Sie zur Bewertung, Behandlung und Dokumentation von Vorfällen, z. B. eine Incident-Management-Richtlinie oder ein Vorfallsprotokoll?\r\nKönnen Sie ein Beispiel zeigen, wie ein vergangener Vorfall dokumentiert wurde?\r\nWer ist für die Koordination bei Sicherheitsvorfällen verantwortlich?'),
(325, 6, 581, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.25', 'Bewertung von Sicherheitsereignissen', 'offen', NULL, NULL, NULL, 581, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie unterscheiden Sie zwischen einem Sicherheitsereignis und einem tatsächlichen Sicherheitsvorfall?\r\nNach welchen Kriterien priorisieren Sie Sicherheitsereignisse, z. B. Auswirkung auf Kundendaten, Geschäftskritikalität oder Dringlichkeit?\r\nWelche Nachweise gibt es für die Analyse und Priorisierung, z. B. Bewertungsmatrix, Ticketverläufe oder Protokolle?\r\nWie stellen Sie sicher, dass relevante Ereignisse zeitnah in den Reaktionsprozess überführt werden?'),
(326, 6, 582, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.26', 'Reaktion auf Sicherheitsvorfälle', 'offen', NULL, NULL, NULL, 582, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Welche definierten Abläufe existieren zur Eindämmung und Behebung von Sicherheitsvorfällen, z. B. Notfallpläne, Checklisten oder Eskalationswege?\r\nWie stellen Sie die Wiederherstellung betroffener Systeme oder Daten sicher?\r\nWer kommuniziert intern und extern bei einem Vorfall, und nach welchen Regeln, z. B. gegenüber Kunden, Behörden oder Partnern?\r\nWelche Dokumentation belegt Ihre Reaktionsprozesse, z. B. Incident-Response-Plan, Kommunikationsvorlagen?'),
(327, 6, 583, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.27', 'Lernen aus Vorfällen', 'offen', NULL, NULL, NULL, 583, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie werten Sie Sicherheitsvorfälle nach deren Abschluss aus, um Ursachen zu identifizieren?\r\nWelche Maßnahmen leiten Sie aus den Erkenntnissen ab, und wie dokumentieren Sie diese, z. B. in Lessons-Learned-Protokollen oder Maßnahmenlisten?\r\nKönnen Sie ein Beispiel nennen, bei dem ein Vorfall zu einer konkreten Verbesserung Ihrer Sicherheitsmaßnahmen geführt hat?\r\nWer ist verantwortlich für die Umsetzung und Nachverfolgung der Verbesserungsmaßnahmen?'),
(328, 6, 584, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.28', 'Beweissicherung', 'offen', NULL, NULL, NULL, 584, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie sichern Sie bei Sicherheitsvorfällen relevante Beweise, z. B. Logdateien, Screenshots oder E-Mails?\r\nWelche Maßnahmen ergreifen Sie, um die Integrität und Nachvollziehbarkeit dieser Beweise zu gewährleisten, z. B. Hash-Werte, Zeitstempel, Zugriffsschutz?\r\nWo und wie lange bewahren Sie diese Beweise auf?\r\nHaben Sie geprüft, welche Anforderungen für eine mögliche rechtliche Verwertbarkeit gelten, z. B. für Strafanzeigen oder Versicherungsfälle?'),
(329, 6, 585, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.29', 'Informationssicherheit in Notfällen', 'offen', NULL, NULL, NULL, 585, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Verfügen Sie über Notfall- oder Krisenpläne, und berücksichtigen diese explizit die Informationssicherheit Ihrer SaaS-Plattform und Kundendaten?\r\nWie stellen Sie sicher, dass Schutzziele auch unter Stressbedingungen eingehalten werden, z. B. bei Systemausfällen oder Cyberangriffen?\r\nWelche Dokumente belegen Ihre Notfallplanung, z. B. Notfallhandbuch, Kontaktlisten, Wiederanlaufpläne?\r\nWann wurden diese Pläne zuletzt getestet oder aktualisiert?'),
(330, 6, 586, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.30', 'IKT-Bereitschaft für Business Continuity', 'offen', NULL, NULL, NULL, 586, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Welche Ihrer Geschäftsprozesse sind kritisch für den Betrieb Ihrer SaaS-Lösung und die Erfüllung von Kundenverträgen?\r\nWie haben Sie geplant, diese kritischen IT-Systeme bei Störungen fortzuführen, z. B. durch Backups, redundante Systeme oder Ausweichverfahren?\r\nWelche Dokumentation belegt Ihre IKT-Bereitschaftsplanung, z. B. Business-Impact-Analyse, Recovery-Pläne, RTO/RPO-Definitionen?\r\nWurden diese Pläne bereits getestet, und wenn ja, mit welchem Ergebnis?'),
(331, 6, 587, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.31', 'Rechtliche Anforderungen', 'offen', NULL, NULL, NULL, 587, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie identifizieren Sie relevante gesetzliche, regulatorische und vertragliche Anforderungen für Ihre ISMS-Software, z. B. DSGVO, Telekommunikationsrecht oder Kundenverträge?\r\nWo dokumentieren Sie diese Pflichten und deren Umsetzungsstatus, z. B. in einem Rechtskataster oder einer Anforderungsliste?\r\nWie stellen Sie sicher, dass Änderungen in der Rechtslage erkannt und umgesetzt werden?\r\nWer ist für die Überwachung rechtlicher Anforderungen verantwortlich?'),
(332, 6, 588, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.32', 'Geistiges Eigentum', 'offen', NULL, NULL, NULL, 588, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie schützen Sie das geistige Eigentum Ihrer ISMS-Software, z. B. Quellcode, Dokumentation oder Know-how?\r\nWie stellen Sie sicher, dass eingesetzte Drittanbieter-Software lizenzkonform genutzt wird, z. B. durch Lizenzübersichten oder regelmäßige Prüfungen?\r\nWelche Nachweise gibt es für den Schutz und die Lizenzverwaltung, z. B. Lizenzverträge, Inventarlisten, Geheimhaltungsvereinbarungen?\r\nWie sind Zugriffsrechte auf sensiblen Quellcode geregelt?'),
(333, 6, 589, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.33', 'Schutz von Aufzeichnungen', 'offen', NULL, NULL, NULL, 589, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Welche Aufzeichnungen sind für Ihr ISMS relevant, z. B. Auditprotokolle, Vorfallsdokumentationen oder Verträge?\r\nWie schützen Sie diese vor unbefugtem Zugriff, Verlust oder Veränderung?\r\nNach welchen Fristen löschen Sie Aufzeichnungen, und wie stellen Sie die Einhaltung sicher, z. B. durch Aufbewahrungsrichtlinie oder automatisierte Löschprozesse?\r\nWo sind Aufbewahrungsfristen und Verantwortlichkeiten dokumentiert?'),
(334, 6, 590, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.34', 'Datenschutz', 'offen', NULL, NULL, NULL, 590, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Welche personenbezogenen Daten verarbeiten Sie im Rahmen Ihrer ISMS-Software und internen Prozesse?\r\nWelche technischen und organisatorischen Maßnahmen setzen Sie zum Schutz dieser Daten um, z. B. Verschlüsselung, Zugriffsbeschränkungen, Pseudonymisierung?\r\nWie dokumentieren Sie diese Maßnahmen, z. B. im Verzeichnis von Verarbeitungstätigkeiten oder in technisch-organisatorischen Maßnahmen (TOM)?\r\nWie stimmen Sie sich mit Ihrem Datenschutzbeauftragten oder externen Datenschutzverantwortlichen ab?'),
(335, 6, 591, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.35', 'Unabhängige Sicherheitsprüfung', 'offen', NULL, NULL, NULL, 591, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wurden Ihre Sicherheitsmaßnahmen und -prozesse bereits unabhängig geprüft, z. B. durch externe Auditoren, Penetrationstests oder Zertifizierungsaudits?\r\nIn welchen Abständen planen Sie solche unabhängigen Prüfungen?\r\nWelche Nachweise gibt es für durchgeführte Prüfungen, z. B. Auditberichte, Testprotokolle oder Zertifikate?\r\nWie gehen Sie mit den Ergebnissen und Empfehlungen aus diesen Prüfungen um?'),
(336, 6, 592, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.36', 'Einhaltung von Richtlinien', 'offen', NULL, NULL, NULL, 592, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie überprüfen Sie regelmäßig, ob Ihre internen Sicherheitsvorgaben eingehalten werden, z. B. durch Stichproben, Self-Assessments oder interne Audits?\r\nWelche Dokumentation belegt diese Prüfungen, z. B. Checklisten, Prüfprotokolle oder Maßnahmenlisten?\r\nWie gehen Sie bei festgestellten Abweichungen vor, und wer ist für die Einleitung von Korrekturmaßnahmen verantwortlich?\r\nKönnen Sie ein Beispiel für eine erkannte Abweichung und die daraus abgeleitete Maßnahme nennen?'),
(337, 6, 593, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.37', 'Technische Compliance', 'offen', NULL, NULL, NULL, 593, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Welche technischen Vorgaben, Baselines oder Standards gelten für Ihre IT-Systeme, z. B. Härtungsvorgaben, Patch-Zyklen oder Konfigurationsstandards?\r\nWie kontrollieren Sie systematisch die Einhaltung dieser Vorgaben, z. B. durch automatisierte Scans, manuelle Prüfungen oder Konfigurationsmanagement?\r\nWelche Nachweise dokumentieren die technische Compliance, z. B. Scan-Berichte, Konfigurationsprotokolle oder Prüfberichte?\r\nWie gehen Sie mit Abweichungen um?'),
(338, 6, 594, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.1', 'Hintergrundprüfungen', 'offen', NULL, NULL, NULL, 594, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Führen Sie vor der Einstellung neuer Mitarbeitender sicherheitsrelevante Prüfungen durch, z. B. Überprüfung von Zeugnissen, Referenzen oder polizeilichen Führungszeugnissen?\r\nWie stellen Sie sicher, dass diese Prüfungen im rechtlich zulässigen Rahmen erfolgen?\r\nWelche Nachweise dokumentieren durchgeführte Hintergrundprüfungen, z. B. Checklisten, Kopien oder Vermerke in der Personalakte?\r\nGibt es auch während der Beschäftigung anlassbezogene Prüfungen?'),
(339, 6, 595, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.2', 'Arbeitsverträge', 'offen', NULL, NULL, NULL, 595, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie verankern Sie Sicherheitsanforderungen und -pflichten in Arbeitsverträgen oder ergänzenden Dokumenten, z. B. Vertraulichkeitsvereinbarungen, IT-Nutzungsrichtlinien oder Verpflichtungserklärungen?\r\nWelche konkreten Sicherheitspflichten sind dort festgehalten, z. B. Geheimhaltung, Passwortschutz oder Meldepflichten bei Vorfällen?\r\nWo werden diese Dokumente aufbewahrt, z. B. in der Personalakte?\r\nWie stellen Sie sicher, dass alle Mitarbeitenden diese Dokumente erhalten und bestätigen?'),
(340, 6, 596, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.3', 'Sensibilisierung und Schulung', 'offen', NULL, NULL, NULL, 596, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie schulen und sensibilisieren Sie Ihre Mitarbeitenden regelmäßig zu Informationssicherheitsthemen, z. B. durch Onboarding-Schulungen, E-Learnings oder Team-Briefings?\r\nWelche Themen werden abgedeckt, z. B. Phishing-Erkennung, Passwortregeln, Umgang mit Kundendaten oder Meldung von Vorfällen?\r\nWelche Nachweise dokumentieren die durchgeführten Schulungen, z. B. Teilnehmerlisten, Schulungsprotokolle oder Zertifikate?\r\nWie stellen Sie sicher, dass auch neue Mitarbeitende zeitnah geschult werden?'),
(341, 6, 597, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.4', 'Disziplinarische Maßnahmen', 'offen', NULL, NULL, NULL, 597, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Existiert eine Regelung, die abgestufte Konsequenzen bei Verstößen gegen Sicherheitsvorgaben festlegt, z. B. in einer Arbeitsordnung, einem Mitarbeiterhandbuch oder einer ISMS-Richtlinie?\r\nWie werden Mitarbeitende über mögliche Konsequenzen bei Sicherheitsverstößen informiert?\r\nWer entscheidet bei Ihnen über disziplinarische Maßnahmen und wie wird dabei die Verhältnismäßigkeit sichergestellt?\r\nWie dokumentieren Sie Sicherheitsverstöße und die darauf folgenden Maßnahmen?'),
(342, 6, 598, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.5', 'Verantwortlichkeiten nach Beendigung', 'offen', NULL, NULL, NULL, 598, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Welche vertraglichen Regelungen stellen sicher, dass Vertraulichkeitspflichten auch nach dem Ausscheiden eines Mitarbeitenden fortbestehen, z. B. nachvertragliche Klauseln im Arbeitsvertrag oder separate Vereinbarungen?\r\nWie kommunizieren Sie beim Offboarding die fortgeltenden Pflichten zum Schutz von Unternehmensinformationen?\r\nWelche Fristen gelten für die Vertraulichkeitspflichten nach Austritt und wo sind diese dokumentiert?'),
(343, 6, 599, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.6', 'Vertraulichkeitsvereinbarungen', 'offen', NULL, NULL, NULL, 599, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Für welche Rollen und externen Partner bestehen bei Ihnen Vertraulichkeitsvereinbarungen, z. B. NDAs mit Freelancern, Subunternehmern oder Kunden?\r\nWie stellen Sie sicher, dass Vertraulichkeitsvereinbarungen vor Zugang zu sensiblen Informationen unterzeichnet werden?\r\nWo werden die unterschriebenen Vereinbarungen aufbewahrt und wer prüft deren Vollständigkeit?\r\nWann wurden die Vorlagen zuletzt auf Aktualität geprüft?'),
(344, 6, 600, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.7', 'Remote Work', 'offen', NULL, NULL, NULL, 600, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Welche schriftliche Regelung definiert Anforderungen für Remote Work und Homeoffice, z. B. eine Homeoffice-Richtlinie oder IT-Nutzungsordnung?\r\nWie stellen Sie sicher, dass private Netzwerke und Geräte im Homeoffice ausreichend geschützt sind, z. B. durch VPN-Pflicht oder Mindestanforderungen an WLAN-Sicherheit?\r\nWelche Vorgaben gelten für den Umgang mit sensiblen Kundendaten beim mobilen Arbeiten?\r\nWie kontrollieren Sie die Einhaltung dieser Regelungen?'),
(345, 6, 601, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.8', 'Meldung von Sicherheitsereignissen', 'offen', NULL, NULL, NULL, 601, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Über welche Kanäle können Ihre Mitarbeitenden Sicherheitsauffälligkeiten melden, z. B. E-Mail-Adresse, Ticketsystem oder direkter Ansprechpartner?\r\nWie sind die Meldekanäle dokumentiert und wie werden neue Mitarbeitende darüber informiert?\r\nInnerhalb welcher Zeitvorgaben sollen Sicherheitsereignisse gemeldet werden?\r\nWie stellen Sie sicher, dass auch externe Berater oder Freelancer die Meldewege kennen?'),
(346, 6, 602, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.1', 'Sicherheitszonen', 'offen', NULL, NULL, NULL, 602, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Haben Sie Bereiche mit unterschiedlichem Schutzbedarf definiert, z. B. Serverraum, Entwicklungsbereich oder Büro?\r\nWelche Zutrittsmaßnahmen schützen die jeweiligen Bereiche, z. B. Schlüssel, Codes, Chipkarten?\r\nWo ist dokumentiert, welche Zonen welchen Schutz erfordern und wer Zutritt hat?\r\nWie berücksichtigen Sie Ihre Büroräume als SaaS-Anbieter hinsichtlich Zugang zu Produktivsystemen?'),
(347, 6, 603, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.2', 'Zutrittskontrolle', 'offen', NULL, NULL, NULL, 603, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie kontrollieren Sie den physischen Zugang zu Ihren Geschäftsräumen, z. B. durch Schlüsselvergabe, Schließanlage oder Zutrittskontrollsystem?\r\nWer verwaltet die Schlüssel oder Zugangsmittel und führt darüber eine aktuelle Liste?\r\nWie protokollieren Sie Zutritte zu sensiblen Bereichen und wie lange bewahren Sie die Aufzeichnungen auf?\r\nWann haben Sie zuletzt geprüft, ob nur berechtigte Personen Zugang haben?'),
(348, 6, 604, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.3', 'Sicherung von Büros', 'offen', NULL, NULL, NULL, 604, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie verhindern Sie unbefugten Zugriff auf Arbeitsplätze und Unterlagen in Ihren Büroräumen, z. B. durch abschließbare Schränke oder Sichtschutzfolien?\r\nWelche Regelungen gelten für Besucher in Ihren Räumlichkeiten?\r\nWie ist sichergestellt, dass sensible Informationen nicht von Fenster oder Flur einsehbar sind?'),
(349, 6, 605, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.4', 'Physische Überwachung', 'offen', NULL, NULL, NULL, 605, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Setzen Sie Überwachungsmaßnahmen für sicherheitsrelevante Bereiche ein, z. B. Videoüberwachung, Bewegungsmelder oder Alarmanlagen?\r\nFalls ja, wie sind diese Maßnahmen dokumentiert und wer wertet Aufzeichnungen aus?\r\nFalls nein, wie begründen Sie den Verzicht angesichts des Schutzbedarfs Ihrer IT-Infrastruktur?'),
(350, 6, 606, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.5', 'Schutz vor Umweltgefahren', 'offen', NULL, NULL, NULL, 606, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Welche Schutzmaßnahmen haben Sie gegen Umweltgefahren getroffen, z. B. Rauchmelder, Feuerlöscher, USV für Server?\r\nWie schützen Sie Ihre Entwicklungs- und Produktivsysteme vor Stromausfällen oder Wasserschäden?\r\nWann wurden Brandschutzeinrichtungen oder USV-Anlagen zuletzt geprüft und wo ist dies dokumentiert?'),
(351, 6, 607, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.6', 'Arbeiten in gesicherten Bereichen', 'offen', NULL, NULL, NULL, 607, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Welche Bereiche in Ihrem Unternehmen haben erhöhten Schutzbedarf, z. B. Serverraum oder Bereich mit Kundendatenzugriff?\r\nWelche Regeln gelten für Tätigkeiten in diesen Bereichen, z. B. Vier-Augen-Prinzip oder Protokollierung?\r\nWer erteilt Freigaben für Arbeiten in gesicherten Bereichen und wie wird dies dokumentiert?'),
(352, 6, 608, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.7', 'Clear Desk / Clear Screen', 'offen', NULL, NULL, NULL, 608, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Gibt es eine Clear-Desk-/Clear-Screen-Richtlinie oder vergleichbare Vorgaben, z. B. in einer IT-Nutzungsordnung?\r\nWie stellen Ihre Mitarbeitenden sicher, dass Bildschirme bei Abwesenheit gesperrt und Unterlagen weggeschlossen werden?\r\nWie sensibilisieren Sie neue Teammitglieder für diese Anforderungen?'),
(353, 6, 609, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.8', 'Standortgebundene Geräte', 'offen', NULL, NULL, NULL, 609, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie schützen Sie Notebooks, Smartphones und andere Geräte gegen Diebstahl, z. B. durch Kensington-Schlösser, verschlossene Schränke oder Verschlüsselung?\r\nWelche Vorgaben gelten für den Transport von Geräten außerhalb des Büros?\r\nWie wird sichergestellt, dass verlorene Geräte zeitnah gemeldet und Zugänge gesperrt werden?'),
(354, 6, 610, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.9', 'Außerbetriebnahme von Geräten', 'offen', NULL, NULL, NULL, 610, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie gehen Sie vor, wenn ein Gerät ausgesondert oder weitergegeben wird, z. B. Löschverfahren, Zerstörung von Datenträgern?\r\nWer ist für die sichere Datenlöschung verantwortlich und wie wird sie dokumentiert, z. B. durch Löschprotokolle oder Zertifikate?\r\nWelche Methode nutzen Sie, um sicherzustellen, dass Daten nicht wiederherstellbar sind?'),
(355, 6, 611, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.10', 'Lagerung von Datenträgern', 'offen', NULL, NULL, NULL, 611, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie lagern Sie Datenträger mit sensiblen Informationen, z. B. verschlossene Schränke, Tresore oder gesicherte Räume?\r\nWer hat Zugang zu gelagerten Datenträgern und wie ist dies geregelt?\r\nWie handhaben Sie den Transport von Datenträgern, z. B. verschlüsselte USB-Sticks oder gesicherte Versandwege?'),
(356, 6, 612, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.11', 'Unterstützende Infrastruktur', 'offen', NULL, NULL, NULL, 612, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie stellen Sie die Verfügbarkeit Ihrer Stromversorgung und Internetanbindung sicher, z. B. USV, redundante Leitungen?\r\nWer ist für Wartung und Überwachung der Gebäudetechnik zuständig?\r\nWelche Maßnahmen greifen bei Ausfall der unterstützenden Infrastruktur?'),
(357, 6, 613, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.12', 'Kabelschutz', 'offen', NULL, NULL, NULL, 613, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie schützen Sie Strom- und Datenkabel vor Beschädigung oder unbefugtem Zugriff, z. B. durch Kabelkanäle, gesicherte Verlegewege?\r\nSind Netzwerkkabel so verlegt, dass sie nicht leicht manipuliert oder abgehört werden können?\r\nWie berücksichtigen Sie Kabelschutz bei Umbaumaßnahmen oder neuen Arbeitsplätzen?'),
(358, 6, 614, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.13', 'Wartung von Geräten', 'offen', NULL, NULL, NULL, 614, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie stellen Sie sicher, dass Wartungsarbeiten an IT-Geräten kontrolliert und nachvollziehbar erfolgen, z. B. durch Wartungsprotokolle oder Auftragserteilung?\r\nWelche Vorgaben gelten für externe Techniker, z. B. Begleitung, Vertraulichkeitsvereinbarung?\r\nWie wird sichergestellt, dass bei Reparaturen keine sensiblen Daten offengelegt werden?'),
(359, 6, 615, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.14', 'Entsorgung', 'offen', NULL, NULL, NULL, 615, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie entsorgen Sie Geräte und Datenträger, damit keine Daten offengelegt werden, z. B. zertifizierte Entsorgungsunternehmen, physische Zerstörung?\r\nWelche Nachweise erhalten Sie über die sichere Entsorgung, z. B. Vernichtungszertifikate?\r\nWer genehmigt die Entsorgung oder Wiederverwendung von Geräten und dokumentiert dies?'),
(360, 6, 616, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.1', 'Endgerätesicherheit', 'offen', NULL, NULL, NULL, 616, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie härten Sie Endgeräte wie Notebooks und Smartphones, z. B. durch Verschlüsselung, Firewall, Deaktivierung ungenutzter Dienste?\r\nWie stellen Sie sicher, dass Betriebssysteme und Software zeitnah aktualisiert werden, z. B. durch automatische Updates oder Patch-Management?\r\nWelche Sicherheitssoftware setzen Sie ein, z. B. Antivirus, EDR?\r\nWie kontrollieren Sie, dass alle Entwickler-Endgeräte diese Vorgaben erfüllen?'),
(361, 6, 617, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.2', 'Privilegierte Zugriffe', 'offen', NULL, NULL, NULL, 617, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Welche Personen in Ihrem Unternehmen verfügen über privilegierte Konten (z. B. Admin-Rechte für Server, Cloud-Dienste, Datenbanken)?\r\nWie stellen Sie sicher, dass privilegierte Rechte strikt getrennt von normalen Benutzerkonten genutzt werden?\r\nWelche Dokumentation führen Sie über die Vergabe und den Entzug privilegierter Zugänge, z. B. eine Berechtigungsmatrix oder Tickethistorie?\r\nWie überwachen Sie die Nutzung privilegierter Konten – etwa durch Protokollierung oder Alerts bei ungewöhnlichen Aktivitäten?\r\nIn welchen Abständen überprüfen Sie, ob vergebene Admin-Rechte noch erforderlich sind?'),
(362, 6, 618, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.3', 'Informationszugriff', 'offen', NULL, NULL, NULL, 618, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie setzen Sie technisch durch, dass nur berechtigte Personen auf Ihre Systeme und Informationen zugreifen können, z. B. über Rollenkonzepte oder ACLs?\r\nWelche Protokollierung erfolgt bei Zugriffen auf geschäftskritische Daten und wie lange bewahren Sie diese Logs auf?\r\nWo dokumentieren Sie Ihre Zugriffsberechtigungen, z. B. in einer Berechtigungsmatrix oder einem IAM-System?\r\nWie gehen Sie vor, wenn ein Mitarbeiter das Unternehmen verlässt oder die Rolle wechselt?'),
(363, 6, 619, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.4', 'Quellcodezugriff', 'offen', NULL, NULL, NULL, 619, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie schützen Sie den Quellcode Ihrer ISMS-Software vor unbefugtem Zugriff – sowohl intern als auch extern?\r\nWelches Versionskontrollsystem nutzen Sie (z. B. Git) und wie sind die Zugriffsrechte darauf geregelt?\r\nWer darf Änderungen am Quellcode vornehmen und wie werden diese freigegeben, z. B. durch Code-Reviews oder Merge-Requests?\r\nWie verhindern Sie, dass Quellcode unkontrolliert auf private Geräte oder externe Speicher kopiert wird?'),
(364, 6, 620, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.5', 'Sichere Authentisierung', 'offen', NULL, NULL, NULL, 620, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Welche Authentisierungsverfahren setzen Sie für den Zugang zu Ihren Systemen ein, z. B. Passwortrichtlinien, MFA?\r\nBei welchen Systemen oder Daten mit erhöhtem Schutzbedarf nutzen Sie Multi-Faktor-Authentisierung?\r\nWie stellen Sie sicher, dass Passwörter ausreichend komplex sind und regelmäßig gewechselt werden?\r\nWelche Nachweise dokumentieren Ihre Authentisierungsrichtlinie, z. B. technische Konfiguration oder Policy-Dokument?'),
(365, 6, 621, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.6', 'Kapazitätsmanagement', 'offen', NULL, NULL, NULL, 621, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie überwachen Sie die Auslastung Ihrer IT-Ressourcen, z. B. Speicher, CPU, Bandbreite Ihrer SaaS-Plattform?\r\nWelche Schwellwerte oder Alerts haben Sie definiert, um frühzeitig auf Kapazitätsengpässe reagieren zu können?\r\nWie planen Sie zukünftige Kapazitätsbedarfe, etwa bei wachsender Kundenzahl Ihrer Software?\r\nWelche Dokumentation belegt Ihre Kapazitätsplanung, z. B. Monitoring-Dashboards oder Planungstabellen?'),
(366, 6, 622, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.7', 'Malware-Schutz', 'offen', NULL, NULL, NULL, 622, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Welche Schutzmechanismen gegen Schadsoftware setzen Sie auf Arbeitsplätzen, Servern und in der Cloud ein?\r\nWie stellen Sie sicher, dass Virensignaturen und Schutzsoftware stets aktuell sind?\r\nWie werden Malware-Vorfälle erkannt, gemeldet und behandelt?\r\nWelche Nachweise zeigen den aktuellen Schutzstatus, z. B. Management-Konsole, Update-Logs?'),
(367, 6, 623, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.8', 'Technische Schwachstellen', 'offen', NULL, NULL, NULL, 623, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie identifizieren Sie technische Schwachstellen in Ihrer Software und Infrastruktur, z. B. durch Schwachstellenscanner, CVE-Überwachung?\r\nNach welchen Kriterien bewerten und priorisieren Sie erkannte Schwachstellen?\r\nIn welchem Zeitrahmen beheben Sie kritische Schwachstellen und wie dokumentieren Sie dies?\r\nWelche Nachweise führen Sie über durchgeführte Patches oder kompensierende Maßnahmen?'),
(368, 6, 624, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.9', 'Konfigurationsmanagement', 'offen', NULL, NULL, NULL, 624, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie definieren Sie sichere Basiskonfigurationen für Ihre Systeme, z. B. Hardening-Guides, Standard-Images?\r\nWie stellen Sie sicher, dass Konfigurationsänderungen nur autorisiert erfolgen?\r\nWelche Dokumentation belegt Ihre Soll-Konfigurationen und deren Einhaltung, z. B. Konfigurations-Datenbank, Audit-Logs?\r\nWie prüfen Sie regelmäßig, ob Systeme noch der definierten Baseline entsprechen?'),
(369, 6, 625, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.10', 'Informationslöschung', 'offen', NULL, NULL, NULL, 625, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie stellen Sie sicher, dass Daten bei Löschung oder Außerbetriebnahme von Geräten nicht wiederherstellbar sind?\r\nWelche Löschverfahren nutzen Sie für unterschiedliche Datenträger, z. B. Secure Erase, physische Vernichtung, Cloud-Löschung?\r\nWie dokumentieren Sie durchgeführte Löschungen, z. B. Löschprotokolle oder Vernichtungsnachweise?\r\nWie gehen Sie mit der Löschung von Kundendaten in Ihrer SaaS-Lösung um?'),
(370, 6, 626, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.11', 'Datenmaskierung', 'offen', NULL, NULL, NULL, 626, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'In welchen Fällen maskieren oder anonymisieren Sie sensible Daten, z. B. in Testumgebungen oder bei Support-Anfragen?\r\nWelche Techniken setzen Sie zur Datenmaskierung ein, z. B. Pseudonymisierung, Tokenisierung?\r\nWie stellen Sie sicher, dass Produktivdaten nicht unverändert in Testumgebungen gelangen?\r\nWelche Dokumentation belegt Ihre Vorgehensweise zur Datenmaskierung?'),
(371, 6, 627, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.12', 'Datenverlustprävention', 'offen', NULL, NULL, NULL, 627, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Welche Maßnahmen verhindern, dass sensible Daten unkontrolliert das Unternehmen verlassen, z. B. E-Mail-Filter, USB-Sperrung?\r\nWie erkennen Sie unerlaubte Datenübertragungen oder -speicherungen?\r\nWelche sensiblen Daten haben Sie identifiziert, die besonderen Schutz vor Abfluss benötigen?\r\nWelche Nachweise dokumentieren Ihre DLP-Maßnahmen, z. B. Richtlinien, technische Konfigurationen?'),
(372, 6, 628, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.13', 'Datensicherung', 'offen', NULL, NULL, NULL, 628, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie häufig erstellen Sie Backups Ihrer geschäftskritischen Daten und Systeme?\r\nWo werden Backups aufbewahrt und wie sind sie gegen unbefugten Zugriff und physische Risiken geschützt?\r\nWann haben Sie zuletzt eine vollständige Wiederherstellung getestet und wie wurde das Ergebnis dokumentiert?\r\nWelche Backup-Konzepte oder -Richtlinien existieren für Ihre SaaS-Kundendaten?'),
(373, 6, 629, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.14', 'Redundanz', 'offen', NULL, NULL, NULL, 629, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Welche Verfügbarkeitsziele haben Sie für Ihre ISMS-Software und kritische interne Systeme definiert?\r\nWelche Redundanzmechanismen setzen Sie ein, um Ausfälle abzufangen, z. B. Cloud-Verfügbarkeitszonen, gespiegelte Datenbanken?\r\nWie haben Sie geprüft, ob die Redundanz im Ernstfall funktioniert?\r\nWelche Dokumentation belegt Ihre Redundanzstrategie, z. B. Architekturdiagramme, SLAs?'),
(374, 6, 630, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.15', 'Protokollierung', 'offen', NULL, NULL, NULL, 630, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Welche sicherheitsrelevanten Ereignisse protokollieren Sie, z. B. Logins, Admin-Aktionen, Zugriffe auf sensible Daten?\r\nWie schützen Sie Logs vor Manipulation oder unbefugter Löschung?\r\nWie lange bewahren Sie Protokolle auf und wo ist dies geregelt?\r\nWelche Systeme oder Tools nutzen Sie zur zentralen Logverwaltung?'),
(375, 6, 631, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.16', 'Monitoring', 'offen', NULL, NULL, NULL, 631, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie überwachen Sie Ihre Systeme auf Anomalien, Angriffe oder Störungen, z. B. durch SIEM, Alerting?\r\nWelche Schwellwerte oder Regeln lösen Alarme aus?\r\nWie schnell können Sie auf erkannte Sicherheitsereignisse reagieren und wer ist verantwortlich?\r\nWelche Nachweise belegen Ihr Monitoring, z. B. Dashboards, Alarmlisten, Incident-Tickets?'),
(376, 6, 632, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.17', 'Uhrzeitsynchronisation', 'offen', NULL, NULL, NULL, 632, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie stellen Sie sicher, dass alle Ihre Systeme eine konsistente Zeitbasis nutzen?\r\nWelche Zeitquelle verwenden Sie, z. B. NTP-Server, und wie ist die Synchronisation konfiguriert?\r\nWie überprüfen Sie, dass die Zeitsynchronisation funktioniert und keine Abweichungen auftreten?\r\nWelche Dokumentation belegt Ihre Konfiguration zur Uhrzeitsynchronisation?'),
(377, 6, 633, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.18', 'Nutzung privilegierter Programme', 'offen', NULL, NULL, NULL, 633, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Welche administrativen Tools oder Befehle werden in Ihrem Unternehmen genutzt, z. B. Remote-Admin, Skripte, Systemwerkzeuge?\r\nWie kontrollieren Sie, wer diese Tools nutzen darf?\r\nWie wird die Nutzung privilegierter Programme protokolliert und nachvollziehbar gemacht?\r\nWelche Einschränkungen oder Freigabeprozesse existieren für den Einsatz solcher Werkzeuge?'),
(378, 6, 634, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.19', 'Softwareinstallation', 'offen', NULL, NULL, NULL, 634, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie stellen Sie sicher, dass Software nur kontrolliert und aus vertrauenswürdigen Quellen installiert wird?\r\nWelchen Freigabeprozess durchlaufen neue Softwareinstallationen, z. B. Genehmigung durch IT-Verantwortlichen?\r\nWie verhindern Sie, dass Mitarbeiter eigenständig nicht autorisierte Software installieren?\r\nWelche Dokumentation führen Sie über installierte Software, z. B. Softwareinventar, Freigabelisten?'),
(379, 6, 635, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.20', 'Netzwerksicherheit', 'offen', NULL, NULL, NULL, 635, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie ist Ihr Netzwerk segmentiert, um unterschiedliche Schutzbereiche zu trennen, z. B. Entwicklung, Produktion, Gäste-WLAN?\r\nWelche Firewall-Regeln oder Zugriffskontrollen schützen Ihre Netzwerke nach außen und innen?\r\nWie regeln Sie externe Verbindungen, z. B. VPN, Cloud-Anbindungen?\r\nWelche Dokumentation belegt Ihre Netzwerkarchitektur und Sicherheitsmaßnahmen, z. B. Netzwerkdiagramme, Firewall-Regelwerke?'),
(380, 6, 636, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.21', 'Netzwerkdienste', 'offen', NULL, NULL, NULL, 636, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Welche Netzwerkdienste stellen Sie bereit und wie stellen Sie sicher, dass nur benötigte Dienste aktiv sind?\r\nWie sind diese Dienste sicher konfiguriert, z. B. Verschlüsselung, Zugriffsbeschränkung?\r\nWie überwachen Sie Netzwerkdienste auf Verfügbarkeit und Sicherheitsprobleme?\r\nWelche Nachweise dokumentieren die Konfiguration und Freigabe Ihrer Netzwerkdienste?'),
(381, 6, 637, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.22', 'Trennung von Netzwerken', 'offen', NULL, NULL, NULL, 637, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie ist Ihr Netzwerk segmentiert, um z. B. Entwicklungsumgebungen, Cloud-Dienste und interne Systeme voneinander zu trennen?\r\nWelche technischen Maßnahmen setzen Sie ein, um den Datenverkehr zwischen Segmenten zu kontrollieren, z. B. Firewalls, VLANs oder Cloud-Netzwerkgruppen?\r\nWie stellen Sie sicher, dass ein kompromittiertes System nicht auf andere Netzwerkbereiche zugreifen kann?\r\nWelche Dokumentation belegt Ihre Netzwerktopologie und Segmentierungsregeln, z. B. Netzwerkdiagramme, Firewall-Regelsätze?'),
(382, 6, 638, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.23', 'Webfilterung', 'offen', NULL, NULL, NULL, 638, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie kontrollieren Sie den Webzugriff Ihrer Mitarbeitenden, um den Aufruf schädlicher oder unerwünschter Inhalte zu verhindern?\r\nWelche technischen Lösungen nutzen Sie für Webfilterung, z. B. DNS-Filter, Proxy, Browser-Erweiterungen oder Cloud-basierte Dienste?\r\nWie werden Richtlinien zu erlaubten und gesperrten Webkategorien definiert und kommuniziert?\r\nWelche Nachweise dokumentieren Ihre Filterregeln und deren Wirksamkeit, z. B. Konfigurationsprotokolle, Blockierungsberichte?'),
(383, 6, 639, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.24', 'Kryptografische Verfahren', 'offen', NULL, NULL, NULL, 639, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Für welche Daten und Übertragungswege setzen Sie Verschlüsselung ein, z. B. Kundendaten, SaaS-Kommunikation, Backups?\r\nWie haben Sie den Schutzbedarf ermittelt, der die Wahl der Verschlüsselungsverfahren begründet?\r\nWelche Algorithmen und Protokolle verwenden Sie für Datenübertragung und -speicherung, z. B. TLS 1.3, AES-256?\r\nWelche Dokumente belegen Ihre Kryptografie-Richtlinie oder die Konfiguration verschlüsselter Dienste, z. B. TLS-Zertifikate, Verschlüsselungskonzept?'),
(384, 6, 640, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.25', 'Schlüsselmanagement', 'offen', NULL, NULL, NULL, 640, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie erzeugen, speichern und verwalten Sie kryptografische Schlüssel für Ihre SaaS-Anwendung und interne Systeme?\r\nWer ist für das Schlüsselmanagement verantwortlich und wie ist der Zugriff auf Schlüssel beschränkt?\r\nNach welchen Kriterien und in welchen Intervallen rotieren Sie Schlüssel bzw. nehmen alte Schlüssel außer Betrieb?\r\nWelche Nachweise dokumentieren den Schlüssel-Lebenszyklus, z. B. Schlüsselinventar, Key-Management-Logs, Verfahrensanweisung?'),
(385, 6, 641, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.26', 'Sichere Entwicklung', 'offen', NULL, NULL, NULL, 641, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie sind Sicherheitsanforderungen in Ihrem Entwicklungsprozess für die ISMS-Software verankert?\r\nWelche Rollen sind für die Definition und Prüfung von Sicherheitsanforderungen zuständig?\r\nWelche Methoden nutzen Sie, um Sicherheitsaspekte in Anforderungen, Design und Implementierung zu berücksichtigen, z. B. Threat Modeling, Security User Stories?\r\nWelche Dokumente belegen Ihre Entwicklungsrichtlinie mit Sicherheitsvorgaben, z. B. Secure-Development-Policy, Definition of Done?'),
(386, 6, 642, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.27', 'Sichere Architektur', 'offen', NULL, NULL, NULL, 642, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie berücksichtigen Sie Sicherheitsprinzipien wie Minimierung von Angriffsflächen und Defense-in-Depth beim Architekturentwurf Ihrer Software?\r\nWelche Maßnahmen zur Trennung von Komponenten und Berechtigungen haben Sie in der Systemarchitektur umgesetzt?\r\nWer ist für die Bewertung und Freigabe von Architekturentscheidungen unter Sicherheitsaspekten verantwortlich?\r\nWelche Nachweise dokumentieren Ihre Sicherheitsarchitektur, z. B. Architekturdiagramme, Threat-Model-Dokumentation?'),
(387, 6, 643, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.28', 'Sicheres Coding', 'offen', NULL, NULL, NULL, 643, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Welche Coding-Richtlinien setzen Sie ein, um typische Sicherheitslücken wie Injection oder unsichere Authentifizierung zu vermeiden?\r\nWie stellen Sie sicher, dass alle Entwickler diese Standards kennen und anwenden, z. B. durch Schulungen, Checklisten?\r\nWelche Code-Review-Verfahren nutzen Sie, um Sicherheitsmängel vor dem Merge zu erkennen?\r\nWelche Dokumente belegen Ihre Secure-Coding-Standards, z. B. Entwicklerhandbuch, Review-Protokolle, Linter-Konfigurationen?'),
(388, 6, 644, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.29', 'Sicherheitstests', 'offen', NULL, NULL, NULL, 644, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie planen und führen Sie Sicherheitstests durch, bevor neue Releases Ihrer ISMS-Software produktiv gehen?\r\nWelche Testmethoden nutzen Sie, z. B. statische Code-Analyse, Penetrationstests, automatisierte Schwachstellenscans?\r\nWer ist für die Durchführung und Auswertung der Sicherheitstests verantwortlich?\r\nWelche Nachweise dokumentieren Testergebnisse und deren Behebung, z. B. Testberichte, Issue-Tracker-Einträge, Scan-Reports?'),
(389, 6, 645, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.30', 'Externe Entwicklung', 'offen', NULL, NULL, NULL, 645, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Arbeiten Sie mit externen Entwicklern oder Dienstleistern zusammen und wie steuern Sie deren Sicherheitsanforderungen?\r\nWelche vertraglichen Regelungen zur Informationssicherheit haben Sie mit externen Entwicklungspartnern vereinbart, z. B. NDAs, Security-Klauseln?\r\nWie kontrollieren Sie die Einhaltung dieser Anforderungen, z. B. durch Code-Reviews, Audits, Nachweispflichten?\r\nWelche Dokumente belegen die Sicherheitsvorgaben für externe Entwicklung, z. B. Verträge, Lieferantenbewertungen?'),
(390, 6, 646, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.31', 'Produktionsumgebung', 'offen', NULL, NULL, NULL, 646, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie ist der Zugriff auf Ihre Produktionssysteme geregelt und auf welchen Personenkreis beschränkt?\r\nWelche technischen Schutzmaßnahmen gelten für Produktionsumgebungen, z. B. gehärtete Konfigurationen, Zugriffsprotokollierung?\r\nWie stellen Sie sicher, dass Änderungen an Produktionssystemen nur kontrolliert und nachvollziehbar erfolgen?\r\nWelche Nachweise dokumentieren den Schutz Ihrer Produktionsumgebung, z. B. Zugriffsberechtigungslisten, Audit-Logs, Härtungsdokumentation?'),
(391, 6, 647, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.32', 'Änderungsmanagement', 'offen', NULL, NULL, NULL, 647, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie ist Ihr Änderungsmanagement-Prozess für Software und Infrastruktur organisiert?\r\nWer bewertet und gibt Änderungen frei, bevor sie umgesetzt werden?\r\nWie dokumentieren Sie durchgeführte Änderungen und deren Auswirkungen, z. B. Change-Tickets, Release-Notes?\r\nWelche Nachweise belegen Ihren Change-Management-Prozess, z. B. Verfahrensanweisung, Change-Log, Genehmigungsprotokolle?'),
(392, 6, 648, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.33', 'Testdaten', 'offen', NULL, NULL, NULL, 648, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie gehen Sie mit Testdaten um, insbesondere wenn diese personenbezogene oder vertrauliche Informationen enthalten könnten?\r\nWelche Maßnahmen zur Anonymisierung oder Maskierung von Testdaten setzen Sie ein?\r\nWer ist für die Freigabe und Kontrolle von Testdaten verantwortlich?\r\nWelche Dokumente belegen Ihre Vorgaben zum Umgang mit Testdaten, z. B. Testdaten-Richtlinie, Anonymisierungsprotokolle?'),
(393, 6, 649, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.34', 'Trennung Test/Produktion', 'offen', NULL, NULL, NULL, 649, 29, '2026-09-22 15:58:55', 29, '2026-09-22 16:05:10', 'Wie trennen Sie Ihre Test- und Entwicklungsumgebungen von der Produktivumgebung Ihrer SaaS-Lösung?\r\nWelche technischen und organisatorischen Maßnahmen verhindern, dass Produktivdaten unkontrolliert in Testumgebungen gelangen?\r\nWie stellen Sie sicher, dass Änderungen in Testumgebungen nicht versehentlich Produktionssysteme beeinflussen?\r\nWelche Nachweise dokumentieren die Trennung, z. B. Umgebungsübersicht, Zugriffsregelungen, Netzwerkdiagramme?'),
(394, 7, 557, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.1', 'Richtlinien zur Informationssicherheit', 'offen', NULL, NULL, NULL, 557, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(395, 7, 558, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.2', 'Überprüfung der Sicherheitsvorgaben', 'offen', NULL, NULL, NULL, 558, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(396, 7, 559, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.3', 'Rollen und Verantwortlichkeiten', 'offen', NULL, NULL, NULL, 559, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(397, 7, 560, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.4', 'Leitungsverantwortung', 'offen', NULL, NULL, NULL, 560, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(398, 7, 561, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.5', 'Kontakt zu Behörden', 'offen', NULL, NULL, NULL, 561, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(399, 7, 562, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.6', 'Kontakt zu Interessengruppen', 'offen', NULL, NULL, NULL, 562, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(400, 7, 563, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.7', 'Threat Intelligence', 'offen', NULL, NULL, NULL, 563, 29, '2026-10-14 10:03:15', NULL, NULL, NULL);
INSERT INTO `aud_pruefpunkte` (`id`, `audit_id`, `norm_id`, `norm`, `kapitel`, `nummer`, `titel`, `bewertung`, `feststellung`, `nachweis`, `abweichung_id`, `sortierung`, `Ersteller`, `erstellt`, `Aenderer`, `geaendert`, `beschreibung`) VALUES
(401, 7, 564, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.8', 'Informationssicherheit im Projektmanagement', 'offen', NULL, NULL, NULL, 564, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(402, 7, 565, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.9', 'Asset-Inventar', 'offen', NULL, NULL, NULL, 565, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(403, 7, 566, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.10', 'Erlaubte Nutzung von Assets', 'offen', NULL, NULL, NULL, 566, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(404, 7, 567, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.11', 'Rückgabe von Assets', 'offen', NULL, NULL, NULL, 567, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(405, 7, 568, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.12', 'Klassifizierung von Informationen', 'offen', NULL, NULL, NULL, 568, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(406, 7, 569, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.13', 'Kennzeichnung von Informationen', 'offen', NULL, NULL, NULL, 569, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(407, 7, 570, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.14', 'Informationsübertragung', 'offen', NULL, NULL, NULL, 570, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(408, 7, 571, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.15', 'Zugriffskontrolle', 'offen', NULL, NULL, NULL, 571, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(409, 7, 572, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.16', 'Identitätsmanagement', 'offen', NULL, NULL, NULL, 572, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(410, 7, 573, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.17', 'Authentifizierungsinformationen', 'offen', NULL, NULL, NULL, 573, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(411, 7, 574, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.18', 'Berechtigungsverwaltung', 'offen', NULL, NULL, NULL, 574, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(412, 7, 575, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.19', 'Informationssicherheit bei Lieferanten', 'offen', NULL, NULL, NULL, 575, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(413, 7, 576, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.20', 'Sicherheitsanforderungen an Lieferanten', 'offen', NULL, NULL, NULL, 576, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(414, 7, 577, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.21', 'Lieferantenüberwachung', 'offen', NULL, NULL, NULL, 577, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(415, 7, 578, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.22', 'Service-Delivery-Management', 'offen', NULL, NULL, NULL, 578, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(416, 7, 579, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.23', 'Nutzung von Cloud-Diensten', 'offen', NULL, NULL, NULL, 579, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(417, 7, 580, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.24', 'Incident-Management', 'offen', NULL, NULL, NULL, 580, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(418, 7, 581, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.25', 'Bewertung von Sicherheitsereignissen', 'offen', NULL, NULL, NULL, 581, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(419, 7, 582, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.26', 'Reaktion auf Sicherheitsvorfälle', 'offen', NULL, NULL, NULL, 582, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(420, 7, 583, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.27', 'Lernen aus Vorfällen', 'offen', NULL, NULL, NULL, 583, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(421, 7, 584, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.28', 'Beweissicherung', 'offen', NULL, NULL, NULL, 584, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(422, 7, 585, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.29', 'Informationssicherheit in Notfällen', 'offen', NULL, NULL, NULL, 585, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(423, 7, 586, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.30', 'IKT-Bereitschaft für Business Continuity', 'offen', NULL, NULL, NULL, 586, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(424, 7, 587, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.31', 'Rechtliche Anforderungen', 'offen', NULL, NULL, NULL, 587, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(425, 7, 588, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.32', 'Geistiges Eigentum', 'offen', NULL, NULL, NULL, 588, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(426, 7, 589, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.33', 'Schutz von Aufzeichnungen', 'offen', NULL, NULL, NULL, 589, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(427, 7, 590, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.34', 'Datenschutz', 'offen', NULL, NULL, NULL, 590, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(428, 7, 591, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.35', 'Unabhängige Sicherheitsprüfung', 'offen', NULL, NULL, NULL, 591, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(429, 7, 592, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.36', 'Einhaltung von Richtlinien', 'offen', NULL, NULL, NULL, 592, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(430, 7, 593, 'ISO/IEC 27001:2022', 'Anhang A', 'A.5.37', 'Technische Compliance', 'offen', NULL, NULL, NULL, 593, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(431, 7, 594, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.1', 'Hintergrundprüfungen', 'offen', NULL, NULL, NULL, 594, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(432, 7, 595, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.2', 'Arbeitsverträge', 'offen', NULL, NULL, NULL, 595, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(433, 7, 596, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.3', 'Sensibilisierung und Schulung', 'offen', NULL, NULL, NULL, 596, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(434, 7, 597, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.4', 'Disziplinarische Maßnahmen', 'offen', NULL, NULL, NULL, 597, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(435, 7, 598, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.5', 'Verantwortlichkeiten nach Beendigung', 'offen', NULL, NULL, NULL, 598, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(436, 7, 599, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.6', 'Vertraulichkeitsvereinbarungen', 'offen', NULL, NULL, NULL, 599, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(437, 7, 600, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.7', 'Remote Work', 'offen', NULL, NULL, NULL, 600, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(438, 7, 601, 'ISO/IEC 27001:2022', 'Anhang A', 'A.6.8', 'Meldung von Sicherheitsereignissen', 'offen', NULL, NULL, NULL, 601, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(439, 7, 602, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.1', 'Sicherheitszonen', 'offen', NULL, NULL, NULL, 602, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(440, 7, 603, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.2', 'Zutrittskontrolle', 'offen', NULL, NULL, NULL, 603, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(441, 7, 604, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.3', 'Sicherung von Büros', 'offen', NULL, NULL, NULL, 604, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(442, 7, 605, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.4', 'Physische Überwachung', 'offen', NULL, NULL, NULL, 605, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(443, 7, 606, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.5', 'Schutz vor Umweltgefahren', 'offen', NULL, NULL, NULL, 606, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(444, 7, 607, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.6', 'Arbeiten in gesicherten Bereichen', 'offen', NULL, NULL, NULL, 607, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(445, 7, 608, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.7', 'Clear Desk / Clear Screen', 'offen', NULL, NULL, NULL, 608, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(446, 7, 609, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.8', 'Standortgebundene Geräte', 'offen', NULL, NULL, NULL, 609, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(447, 7, 610, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.9', 'Außerbetriebnahme von Geräten', 'offen', NULL, NULL, NULL, 610, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(448, 7, 611, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.10', 'Lagerung von Datenträgern', 'offen', NULL, NULL, NULL, 611, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(449, 7, 612, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.11', 'Unterstützende Infrastruktur', 'offen', NULL, NULL, NULL, 612, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(450, 7, 613, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.12', 'Kabelschutz', 'offen', NULL, NULL, NULL, 613, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(451, 7, 614, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.13', 'Wartung von Geräten', 'offen', NULL, NULL, NULL, 614, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(452, 7, 615, 'ISO/IEC 27001:2022', 'Anhang A', 'A.7.14', 'Entsorgung', 'offen', NULL, NULL, NULL, 615, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(453, 7, 616, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.1', 'Endgerätesicherheit', 'offen', NULL, NULL, NULL, 616, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(454, 7, 617, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.2', 'Privilegierte Zugriffe', 'offen', NULL, NULL, NULL, 617, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(455, 7, 618, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.3', 'Informationszugriff', 'offen', NULL, NULL, NULL, 618, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(456, 7, 619, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.4', 'Quellcodezugriff', 'offen', NULL, NULL, NULL, 619, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(457, 7, 620, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.5', 'Sichere Authentisierung', 'offen', NULL, NULL, NULL, 620, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(458, 7, 621, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.6', 'Kapazitätsmanagement', 'offen', NULL, NULL, NULL, 621, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(459, 7, 622, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.7', 'Malware-Schutz', 'offen', NULL, NULL, NULL, 622, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(460, 7, 623, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.8', 'Technische Schwachstellen', 'offen', NULL, NULL, NULL, 623, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(461, 7, 624, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.9', 'Konfigurationsmanagement', 'offen', NULL, NULL, NULL, 624, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(462, 7, 625, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.10', 'Informationslöschung', 'offen', NULL, NULL, NULL, 625, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(463, 7, 626, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.11', 'Datenmaskierung', 'offen', NULL, NULL, NULL, 626, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(464, 7, 627, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.12', 'Datenverlustprävention', 'offen', NULL, NULL, NULL, 627, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(465, 7, 628, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.13', 'Datensicherung', 'offen', NULL, NULL, NULL, 628, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(466, 7, 629, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.14', 'Redundanz', 'offen', NULL, NULL, NULL, 629, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(467, 7, 630, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.15', 'Protokollierung', 'offen', NULL, NULL, NULL, 630, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(468, 7, 631, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.16', 'Monitoring', 'offen', NULL, NULL, NULL, 631, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(469, 7, 632, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.17', 'Uhrzeitsynchronisation', 'offen', NULL, NULL, NULL, 632, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(470, 7, 633, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.18', 'Nutzung privilegierter Programme', 'offen', NULL, NULL, NULL, 633, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(471, 7, 634, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.19', 'Softwareinstallation', 'offen', NULL, NULL, NULL, 634, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(472, 7, 635, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.20', 'Netzwerksicherheit', 'offen', NULL, NULL, NULL, 635, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(473, 7, 636, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.21', 'Netzwerkdienste', 'offen', NULL, NULL, NULL, 636, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(474, 7, 637, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.22', 'Trennung von Netzwerken', 'offen', NULL, NULL, NULL, 637, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(475, 7, 638, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.23', 'Webfilterung', 'offen', NULL, NULL, NULL, 638, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(476, 7, 639, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.24', 'Kryptografische Verfahren', 'offen', NULL, NULL, NULL, 639, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(477, 7, 640, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.25', 'Schlüsselmanagement', 'offen', NULL, NULL, NULL, 640, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(478, 7, 641, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.26', 'Sichere Entwicklung', 'offen', NULL, NULL, NULL, 641, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(479, 7, 642, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.27', 'Sichere Architektur', 'offen', NULL, NULL, NULL, 642, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(480, 7, 643, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.28', 'Sicheres Coding', 'offen', NULL, NULL, NULL, 643, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(481, 7, 644, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.29', 'Sicherheitstests', 'offen', NULL, NULL, NULL, 644, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(482, 7, 645, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.30', 'Externe Entwicklung', 'offen', NULL, NULL, NULL, 645, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(483, 7, 646, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.31', 'Produktionsumgebung', 'offen', NULL, NULL, NULL, 646, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(484, 7, 647, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.32', 'Änderungsmanagement', 'offen', NULL, NULL, NULL, 647, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(485, 7, 648, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.33', 'Testdaten', 'offen', NULL, NULL, NULL, 648, 29, '2026-10-14 10:03:15', NULL, NULL, NULL),
(486, 7, 649, 'ISO/IEC 27001:2022', 'Anhang A', 'A.8.34', 'Trennung Test/Produktion', 'offen', NULL, NULL, NULL, 649, 29, '2026-10-14 10:03:15', NULL, NULL, NULL);

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `Auswirkung`
--

CREATE TABLE `Auswirkung` (
  `id` int(10) UNSIGNED NOT NULL,
  `Faktor` varchar(255) NOT NULL,
  `Unbedeutend` varchar(255) NOT NULL,
  `Gering` varchar(255) NOT NULL,
  `Mäßig` varchar(255) NOT NULL,
  `Groß` varchar(255) NOT NULL,
  `Katastrophal` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `Auswirkung`
--

INSERT INTO `Auswirkung` (`id`, `Faktor`, `Unbedeutend`, `Gering`, `Mäßig`, `Groß`, `Katastrophal`) VALUES
(1, 'Gesundheit & Sicherheit', 'Keine Verletzung oder Erkrankung', 'Leichte, isolierte Verletzung (keine Behandlung)', 'Lokale Verletzung (medizinisch behandelt)', 'Weitreichende oder mehrere Verletzungen', 'Todesfall oder Massenhospitalisierung'),
(2, 'Finanzen T€', 'kleiner 10', '10-50', '50-100', '100-500', '>500'),
(3, 'Service', 'Unterbrechung < 4 Std.', 'Unterbrechung 4–8 Std.', 'Unterbrechung 8 Std – 3 Arbeitstage', 'Unterbrechung 3 Arbeitstage – 2 Wochen', 'Ausfall mehr als 2 Wochen'),
(4, 'Recht & Compliance', 'Keine behördlichen Maßnahmen', 'Aufsichtsbehörde fordert Erklärung', 'Ordnungswidrigkeit mit Verstoßmeldung', 'Sanktionen und/oder Strafmaßnahmen', 'Strafverfolgung, Haftstrafe für Führungskräfte'),
(5, 'Reputation', 'Normales Beschwerdeaufkommen', 'Geringe Anmerkung oder Maßnahme', 'Reaktion bei Stakeholdern, nationale Berichte (< 3 Tage)', 'Nationale Medienberichte (1 Woche), Vorstand gefährdet', 'Medienberichte > 1 Woche, Entlassungsrisiko für Vorstand');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `bcm_bia`
--

CREATE TABLE `bcm_bia` (
  `id` int(11) NOT NULL,
  `prozess_id` int(11) DEFAULT NULL,
  `finanziell_1h` tinyint(4) DEFAULT 1,
  `finanziell_4h` tinyint(4) DEFAULT 1,
  `finanziell_24h` tinyint(4) DEFAULT 1,
  `finanziell_72h` tinyint(4) DEFAULT 1,
  `finanziell_1w` tinyint(4) DEFAULT 1,
  `operativ_1h` tinyint(4) DEFAULT 1,
  `operativ_4h` tinyint(4) DEFAULT 1,
  `operativ_24h` tinyint(4) DEFAULT 1,
  `operativ_72h` tinyint(4) DEFAULT 1,
  `operativ_1w` tinyint(4) DEFAULT 1,
  `regulatorisch_1h` tinyint(4) DEFAULT 1,
  `regulatorisch_4h` tinyint(4) DEFAULT 1,
  `regulatorisch_24h` tinyint(4) DEFAULT 1,
  `regulatorisch_72h` tinyint(4) DEFAULT 1,
  `regulatorisch_1w` tinyint(4) DEFAULT 1,
  `reputation_1h` tinyint(4) DEFAULT 1,
  `reputation_4h` tinyint(4) DEFAULT 1,
  `reputation_24h` tinyint(4) DEFAULT 1,
  `reputation_72h` tinyint(4) DEFAULT 1,
  `reputation_1w` tinyint(4) DEFAULT 1,
  `bemerkungen` text DEFAULT NULL,
  `abhaengigkeiten` text DEFAULT NULL,
  `ersteller` int(11) DEFAULT NULL,
  `erstellt` date DEFAULT NULL,
  `aenderer` int(11) DEFAULT NULL,
  `geaendert` date DEFAULT NULL,
  `abhaengigkeiten_en` text DEFAULT NULL,
  `bemerkungen_en` text DEFAULT NULL,
  `asset_id` int(11) DEFAULT NULL,
  `nummer` varchar(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `bcm_notfallplaene`
--

CREATE TABLE `bcm_notfallplaene` (
  `id` int(11) NOT NULL,
  `prozess_id` int(11) DEFAULT NULL,
  `nummer` varchar(20) DEFAULT NULL,
  `titel` varchar(200) NOT NULL,
  `typ` varchar(60) DEFAULT 'Notfallplan',
  `status` varchar(40) DEFAULT 'Entwurf',
  `version` varchar(20) DEFAULT '1.0',
  `gueltig_ab` date DEFAULT NULL,
  `gueltig_bis` date DEFAULT NULL,
  `inhalt` text DEFAULT NULL,
  `ersteller` int(11) DEFAULT NULL,
  `erstellt` date DEFAULT NULL,
  `aenderer` int(11) DEFAULT NULL,
  `geaendert` date DEFAULT NULL,
  `titel_en` text DEFAULT NULL,
  `inhalt_en` text DEFAULT NULL,
  `asset_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `bcm_prozesse`
--

CREATE TABLE `bcm_prozesse` (
  `id` int(11) NOT NULL,
  `nummer` varchar(20) DEFAULT NULL,
  `name` varchar(200) NOT NULL,
  `kategorie` varchar(80) DEFAULT NULL,
  `kritikalitaet` varchar(20) DEFAULT 'mittel',
  `rto_stunden` int(11) DEFAULT 24,
  `rpo_stunden` int(11) DEFAULT 24,
  `maz_stunden` int(11) DEFAULT 72,
  `verantwortlich` int(11) DEFAULT NULL,
  `status` varchar(40) DEFAULT 'aktiv',
  `beschreibung` text DEFAULT NULL,
  `massnahmen` text DEFAULT NULL,
  `letzte_uebung` date DEFAULT NULL,
  `naechste_uebung` date DEFAULT NULL,
  `ersteller` int(11) DEFAULT NULL,
  `erstellt` date DEFAULT NULL,
  `aenderer` int(11) DEFAULT NULL,
  `geaendert` date DEFAULT NULL,
  `name_en` text DEFAULT NULL,
  `beschreibung_en` text DEFAULT NULL,
  `massnahmen_en` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `bcm_uebungen`
--

CREATE TABLE `bcm_uebungen` (
  `id` int(11) NOT NULL,
  `prozess_id` int(11) DEFAULT NULL,
  `titel` varchar(200) NOT NULL,
  `typ` varchar(60) DEFAULT 'Tabletop',
  `datum` date DEFAULT NULL,
  `ergebnis` varchar(40) DEFAULT 'offen',
  `teilnehmer` text DEFAULT NULL,
  `erkenntnisse` text DEFAULT NULL,
  `ersteller` int(11) DEFAULT NULL,
  `erstellt` date DEFAULT NULL,
  `titel_en` text DEFAULT NULL,
  `erkenntnisse_en` text DEFAULT NULL,
  `asset_id` int(11) DEFAULT NULL,
  `massnahmen` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `bcm_uebung_anhaenge`
--

CREATE TABLE `bcm_uebung_anhaenge` (
  `id` int(11) NOT NULL,
  `uebung_id` int(11) NOT NULL,
  `original_name` varchar(260) NOT NULL,
  `stored_name` varchar(300) NOT NULL,
  `rel_path` varchar(300) NOT NULL,
  `mime_type` varchar(120) DEFAULT NULL,
  `file_size` bigint(20) DEFAULT 0,
  `beschreibung` varchar(300) DEFAULT NULL,
  `ersteller` int(11) DEFAULT NULL,
  `erstellt` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `bedrohungen`
--

CREATE TABLE `bedrohungen` (
  `id` int(11) UNSIGNED NOT NULL,
  `art` varchar(37) DEFAULT NULL,
  `name` varchar(38) DEFAULT NULL,
  `beschreibung` varchar(78) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- Daten für Tabelle `bedrohungen`
--

INSERT INTO `bedrohungen` (`id`, `art`, `name`, `beschreibung`) VALUES
(1, 'Vorsätzliche menschliche Bedrohung', 'Cyberangriff (extern)', 'Gezielter Angriff auf IT-Systeme von außen'),
(2, 'Vorsätzliche menschliche Bedrohung', 'Malware/Ransomware', 'Schadsoftware zur Verschlüsselung, Zerstörung oder zum Diebstahl von Daten'),
(3, 'Vorsätzliche menschliche Bedrohung', 'Phishing/Social Engineering', 'Täuschung von Mitarbeitenden zur Erlangung von Zugangsdaten oder Informationen'),
(4, 'Vorsätzliche menschliche Bedrohung', 'Insiderangriff (vorsätzlich)', 'Missbrauch von Berechtigungen durch interne Personen'),
(5, 'Vorsätzliche menschliche Bedrohung', 'Datendiebstahl', 'Unbefugte Entwendung sensibler Informationen'),
(6, 'Vorsätzliche menschliche Bedrohung', 'Sabotage', 'Gezielte Manipulation oder Zerstörung von Systemen oder Daten'),
(7, 'Vorsätzliche menschliche Bedrohung', 'DDoS-Angriff', 'Überlastung von Diensten zur Herbeiführung eines Ausfalls'),
(8, 'Vorsätzliche menschliche Bedrohung', 'Industriespionage', 'Ausspähen von Geschäfts- oder Betriebsgeheimnissen'),
(9, 'Unbeabsichtigte menschliche Bedrohung', 'Fehlbedienung', 'Falsche Nutzung von IT-Systemen durch Anwender'),
(10, 'Unbeabsichtigte menschliche Bedrohung', 'Fehlkonfiguration', 'Unsachgemäße Konfiguration von Systemen oder Diensten'),
(11, 'Unbeabsichtigte menschliche Bedrohung', 'Unbeabsichtigtes Löschen von Daten', 'Verlust von Informationen durch Bedienfehler'),
(12, 'Unbeabsichtigte menschliche Bedrohung', 'Fehlversand von Informationen', 'Versand sensibler Daten an falsche Empfänger'),
(13, 'Unbeabsichtigte menschliche Bedrohung', 'Verlust von Endgeräten', 'Abhandenkommen von Laptops, Smartphones oder Datenträgern'),
(14, 'Unbeabsichtigte menschliche Bedrohung', 'Unzureichende Sensibilisierung', 'Fehlendes Sicherheitsbewusstsein bei Mitarbeitenden'),
(15, 'Technische Bedrohung', 'Hardwareausfall', 'Defekt oder Versagen von Hardwarekomponenten'),
(16, 'Technische Bedrohung', 'Softwarefehler', 'Fehlerhafte oder instabile Software'),
(17, 'Technische Bedrohung', 'Fehlgeschlagenes Update', 'Störung durch fehlerhafte Aktualisierungen'),
(18, 'Technische Bedrohung', 'Veraltete Systeme', 'Nicht mehr unterstützte Hard- oder Software'),
(19, 'Technische Bedrohung', 'Kapazitätsengpass', 'Überlastung von Systemen oder Diensten'),
(20, 'Technische Bedrohung', 'Datenkorruption', 'Beschädigung von Daten durch technische Fehler'),
(21, 'Technische Bedrohung', 'Ausfall von Backup/Recovery', 'Nicht funktionsfähige Sicherungs- oder Wiederherstellungsprozesse'),
(22, 'Organisatorische Bedrohung', 'Fehlende Prozesse', 'Nicht vorhandene oder unzureichende Regelungen'),
(23, 'Organisatorische Bedrohung', 'Unklare Verantwortlichkeiten', 'Rollen und Zuständigkeiten sind nicht definiert'),
(24, 'Organisatorische Bedrohung', 'Unzureichendes Berechtigungsmanagement', 'Zu weitgehende oder falsch vergebene Zugriffsrechte'),
(25, 'Organisatorische Bedrohung', 'Fehlendes Vier-Augen-Prinzip', 'Kritische Tätigkeiten ohne Kontrolle'),
(26, 'Organisatorische Bedrohung', 'Unzureichendes Change-Management', 'Unkontrollierte Änderungen an Systemen'),
(27, 'Organisatorische Bedrohung', 'Fehlende Notfallplanung', 'Kein oder unzureichender Notfall- und Wiederanlaufplan'),
(28, 'Organisatorische Bedrohung', 'Unzureichende Lieferantensteuerung', 'Sicherheitsanforderungen an Dienstleister fehlen oder werden nicht überwacht'),
(29, 'Physische Bedrohung', 'Brand', 'Feuer im Gebäude oder Serverraum'),
(30, 'Physische Bedrohung', 'Wasser/Leckage', 'Schäden durch Wasser oder Feuchtigkeit'),
(31, 'Physische Bedrohung', 'Stromausfall', 'Unterbrechung der Stromversorgung'),
(32, 'Physische Bedrohung', 'Klimaanlagenausfall', 'Überhitzung von IT-Systemen'),
(33, 'Physische Bedrohung', 'Diebstahl', 'Entwendung von Hardware oder Datenträgern'),
(34, 'Physische Bedrohung', 'Unbefugter Zutritt', 'Physischer Zugriff durch nicht autorisierte Personen'),
(35, 'Höhere Gewalt', 'Naturkatastrophe', 'Sturm, Hochwasser, Erdbeben oder ähnliche Ereignisse'),
(36, 'Höhere Gewalt', 'Pandemie', 'Großflächige Personalausfälle'),
(37, 'Höhere Gewalt', 'Krieg/politische Instabilität', 'Auswirkungen geopolitischer Ereignisse'),
(38, 'Höhere Gewalt', 'Ausfall kritischer Infrastruktur', 'Störungen bei Energie, Wasser oder Telekommunikation'),
(39, 'Höhere Gewalt', 'Lieferkettenstörung', 'Nichtverfügbarkeit von Produkten oder Dienstleistungen'),
(40, 'Rechtliche/Compliance-Bedrohung', 'Gesetzesverstoß', 'Nichteinhaltung gesetzlicher oder regulatorischer Anforderungen'),
(41, 'Rechtliche/Compliance-Bedrohung', 'Datenschutzverstoß', 'Verletzung von Datenschutzvorgaben'),
(42, 'Rechtliche/Compliance-Bedrohung', 'Vertragsverletzung', 'Nichtbeachtung vertraglicher Sicherheitsanforderungen'),
(43, 'Rechtliche/Compliance-Bedrohung', 'Sanktionen/Bußgelder', 'Finanzielle oder rechtliche Konsequenzen'),
(44, 'Rechtliche/Compliance-Bedrohung', 'Reputationsschaden', 'Imageverlust durch Sicherheits- oder Compliance-Vorfälle');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `bedrohung_kategorie`
--

CREATE TABLE `bedrohung_kategorie` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

--
-- Daten für Tabelle `bedrohung_kategorie`
--

INSERT INTO `bedrohung_kategorie` (`id`, `name`) VALUES
(1, 'Höhere Gewalt'),
(2, 'Organisatorische Bedrohung'),
(3, 'Physische Bedrohung'),
(4, 'Rechtliche/Compliance-Bedrohung'),
(5, 'Sonstiges'),
(6, 'Technische Bedrohung'),
(7, 'Umweltbedrohung'),
(8, 'Unbeabsichtigte menschliche Bedrohung'),
(9, 'Vorsätzliche menschliche Bedrohung');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `bericht_art`
--

CREATE TABLE `bericht_art` (
  `id` int(10) UNSIGNED NOT NULL,
  `Bezeichnung` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `bericht_art`
--

INSERT INTO `bericht_art` (`id`, `Bezeichnung`) VALUES
(1, 'ISO/IEC 27001:2022'),
(2, 'Statement of Applicability (SoA)'),
(3, 'Management Summary'),
(4, 'Risikomanagement'),
(5, 'Lieferantenmanagement');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `bpmn_dokumente`
--

CREATE TABLE `bpmn_dokumente` (
  `id` int(11) NOT NULL,
  `Nummer` varchar(50) NOT NULL DEFAULT '',
  `Titel` varchar(255) NOT NULL DEFAULT '',
  `bpmn_xml` longtext NOT NULL,
  `Status` varchar(50) NOT NULL DEFAULT 'Entwurf',
  `Ersteller` int(11) NOT NULL DEFAULT 0,
  `erstellt` date NOT NULL,
  `Änderer` int(11) NOT NULL DEFAULT 0,
  `geändert` date DEFAULT NULL,
  `Typ` varchar(100) NOT NULL DEFAULT 'BPMN'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `chm_changes`
--

CREATE TABLE `chm_changes` (
  `id` int(10) UNSIGNED NOT NULL,
  `nummer` varchar(20) DEFAULT NULL,
  `titel` varchar(200) NOT NULL,
  `beschreibung` text DEFAULT NULL,
  `begruendung` text DEFAULT NULL,
  `typ` varchar(30) NOT NULL DEFAULT 'Normal',
  `kategorie` varchar(60) DEFAULT NULL,
  `status` varchar(30) NOT NULL DEFAULT 'Entwurf',
  `prioritaet` varchar(20) DEFAULT NULL,
  `risiko_stufe` varchar(20) DEFAULT NULL,
  `auswirkung` varchar(20) DEFAULT NULL,
  `geplant_von` datetime DEFAULT NULL,
  `geplant_bis` datetime DEFAULT NULL,
  `ausfallzeit` varchar(100) DEFAULT NULL,
  `umsetzungsplan` text DEFAULT NULL,
  `testplan` text DEFAULT NULL,
  `rueckfallplan` text DEFAULT NULL,
  `assets` text DEFAULT NULL,
  `risiken` text DEFAULT NULL,
  `massnahmen` text DEFAULT NULL,
  `incidents` text DEFAULT NULL,
  `dokumente` text DEFAULT NULL,
  `Besitzer` int(10) UNSIGNED DEFAULT NULL,
  `Umsetzer` int(10) UNSIGNED DEFAULT NULL,
  `Ersteller` int(10) UNSIGNED DEFAULT NULL,
  `erstellt` datetime NOT NULL DEFAULT current_timestamp(),
  `Aenderer` int(10) UNSIGNED DEFAULT NULL,
  `geaendert` datetime DEFAULT NULL,
  `eingereicht` datetime DEFAULT NULL,
  `entschieden` datetime DEFAULT NULL,
  `umgesetzt` datetime DEFAULT NULL,
  `abgeschlossen` datetime DEFAULT NULL,
  `pir_faellig` date DEFAULT NULL,
  `pir_datum` date DEFAULT NULL,
  `pir_ergebnis` varchar(40) DEFAULT NULL,
  `pir_bemerkung` text DEFAULT NULL,
  `pir_durch` int(10) UNSIGNED DEFAULT NULL,
  `titel_en` varchar(200) DEFAULT NULL,
  `beschreibung_en` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `chm_freigaben`
--

CREATE TABLE `chm_freigaben` (
  `id` int(10) UNSIGNED NOT NULL,
  `change_id` int(10) UNSIGNED NOT NULL,
  `user_id` int(10) UNSIGNED NOT NULL,
  `stufe` tinyint(3) UNSIGNED NOT NULL DEFAULT 1,
  `rolle` varchar(80) DEFAULT NULL,
  `votum` varchar(20) NOT NULL DEFAULT 'offen',
  `kommentar` text DEFAULT NULL,
  `entschieden` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `chm_historie`
--

CREATE TABLE `chm_historie` (
  `id` int(10) UNSIGNED NOT NULL,
  `change_id` int(10) UNSIGNED NOT NULL,
  `von_status` varchar(30) DEFAULT NULL,
  `nach_status` varchar(30) DEFAULT NULL,
  `bemerkung` text DEFAULT NULL,
  `user_id` int(10) UNSIGNED DEFAULT NULL,
  `zeit` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `cron_settings`
--

CREATE TABLE `cron_settings` (
  `id` int(10) UNSIGNED NOT NULL,
  `job_key` varchar(64) NOT NULL,
  `bezeichnung` varchar(128) NOT NULL,
  `uhrzeit` time NOT NULL,
  `intervall_tage` smallint(5) UNSIGNED NOT NULL DEFAULT 1,
  `aktiv` tinyint(1) NOT NULL DEFAULT 1,
  `letzter_lauf` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `cron_settings`
--

INSERT INTO `cron_settings` (`id`, `job_key`, `bezeichnung`, `uhrzeit`, `intervall_tage`, `aktiv`, `letzter_lauf`) VALUES
(1, 'aufgaben_mailer', 'Aufgaben-Erinnerung (E-Mail)', '07:00:00', 1, 1, '2026-10-28'),
(2, 'risiko_historie', 'Risikoscore-Historie (Snapshot)', '06:55:00', 7, 1, '2026-10-22');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `Dokumente`
--

CREATE TABLE `Dokumente` (
  `id` int(11) UNSIGNED NOT NULL,
  `Dokumentennummer` varchar(64) NOT NULL,
  `Dokumentenname` varchar(256) NOT NULL,
  `Typ` varchar(256) NOT NULL,
  `Status` varchar(64) NOT NULL,
  `Version` int(11) DEFAULT 0,
  `Klassifizierung` varchar(128) DEFAULT NULL,
  `Text` mediumtext NOT NULL,
  `Ersteller` int(11) DEFAULT 0,
  `Pruefer` int(11) DEFAULT 0,
  `Freigebener` int(11) DEFAULT 0,
  `erstellt` date NOT NULL DEFAULT current_timestamp(),
  `geprueft` date DEFAULT NULL,
  `freigegeben` date DEFAULT NULL,
  `review` date DEFAULT NULL,
  `Änderer` int(11) DEFAULT 0,
  `geändert` date DEFAULT NULL,
  `Subversion` int(11) NOT NULL DEFAULT 0,
  `archiviert` tinyint(1) NOT NULL DEFAULT 0,
  `schreibschutz` tinyint(1) NOT NULL DEFAULT 0,
  `gibtneueversion` tinyint(1) NOT NULL DEFAULT 0,
  `Reviewer` int(10) UNSIGNED DEFAULT NULL,
  `zupruefen` tinyint(1) NOT NULL DEFAULT 0,
  `Dokumentenname_en` varchar(255) DEFAULT NULL,
  `text_en` mediumtext DEFAULT NULL,
  `Typ_en` varchar(256) DEFAULT NULL,
  `Classification` varchar(128) DEFAULT NULL,
  `Status_en` varchar(64) DEFAULT NULL,
  `Besitzer` int(10) UNSIGNED NOT NULL DEFAULT 0,
  `bpmn` varchar(1024) DEFAULT NULL,
  `werpruefen` int(10) DEFAULT NULL,
  `werfreigeben` int(10) DEFAULT NULL,
  `freizugeben` tinyint(1) NOT NULL DEFAULT 0,
  `istfreigegeben` tinyint(1) NOT NULL DEFAULT 0,
  `dok_verknuepfung` text DEFAULT NULL,
  `stamm_id` int(10) UNSIGNED DEFAULT NULL,
  `vorgaenger_id` int(10) UNSIGNED DEFAULT NULL,
  `ist_aktuell` tinyint(1) NOT NULL DEFAULT 1,
  `historisch` tinyint(1) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `dok_anhaenge`
--

CREATE TABLE `dok_anhaenge` (
  `id` int(11) NOT NULL,
  `dok_id` int(11) NOT NULL,
  `original_name` varchar(255) NOT NULL,
  `stored_name` varchar(255) NOT NULL,
  `rel_path` varchar(255) NOT NULL,
  `mime_type` varchar(100) NOT NULL,
  `file_size` int(11) NOT NULL,
  `beschreibung` varchar(255) DEFAULT NULL,
  `ersteller` int(11) DEFAULT NULL,
  `erstellt` date NOT NULL,
  `aenderer` int(11) DEFAULT NULL,
  `geaendert` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `dok_historie`
--

CREATE TABLE `dok_historie` (
  `id` int(10) UNSIGNED NOT NULL,
  `dokument` int(11) NOT NULL,
  `kapitel` text DEFAULT NULL,
  `beschreibung` text DEFAULT NULL,
  `datum` date NOT NULL DEFAULT current_timestamp(),
  `version` int(11) NOT NULL,
  `subversion` int(11) NOT NULL,
  `user` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `dok_lesebestaetigung`
--

CREATE TABLE `dok_lesebestaetigung` (
  `id` int(10) UNSIGNED NOT NULL,
  `user_id` int(11) NOT NULL,
  `dok_id` int(11) NOT NULL,
  `gelesen_am` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `dok_lesepflicht`
--

CREATE TABLE `dok_lesepflicht` (
  `dok_id` int(11) NOT NULL,
  `rolle_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `dok_status`
--

CREATE TABLE `dok_status` (
  `id` int(10) UNSIGNED NOT NULL,
  `status` varchar(64) NOT NULL,
  `status_en` varchar(64) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `dok_status`
--

INSERT INTO `dok_status` (`id`, `status`, `status_en`) VALUES
(1, 'Entwurf', 'Draft'),
(2, 'in Bearbeitung', 'In Progress'),
(3, 'in Review', 'In Review'),
(4, 'in Prüfung', 'under Review'),
(5, 'in Freigabe', 'in release'),
(6, 'Freigegeben', 'Released'),
(7, 'zurückgezogen', 'withdrawn');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `dok_typ`
--

CREATE TABLE `dok_typ` (
  `id` int(10) UNSIGNED NOT NULL,
  `typ` varchar(256) NOT NULL,
  `typ_en` varchar(256) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `dok_typ`
--

INSERT INTO `dok_typ` (`id`, `typ`, `typ_en`) VALUES
(1, 'Governance', 'Governance'),
(2, 'Richtlinien', 'Policies'),
(3, 'Prozesse', 'Processes'),
(4, 'Statement of Applicability (SoA)', 'Statement of Applicability (SoA)'),
(5, 'Nachweisdokumente', 'Evidence documents');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `dok_typ_en`
--

CREATE TABLE `dok_typ_en` (
  `id` int(10) UNSIGNED NOT NULL,
  `typ` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `dok_typ_en`
--

INSERT INTO `dok_typ_en` (`id`, `typ`) VALUES
(1, 'Governance'),
(2, 'Policies'),
(3, 'Procedures');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `Gefaehrdungen`
--

CREATE TABLE `Gefaehrdungen` (
  `id` int(10) UNSIGNED NOT NULL,
  `Bezeichnung` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `Gefaehrdungen`
--

INSERT INTO `Gefaehrdungen` (`id`, `Bezeichnung`) VALUES
(1, 'G 0.1 Feuer'),
(2, 'G 0.2 Ungünstige klimatische Bedingungen'),
(3, 'G 0.3 Wasser'),
(4, 'G 0.4 Verschmutzung, Staub, Korrosion'),
(5, 'G 0.5 Naturkatastrophen'),
(6, 'G 0.6 Katastrophen im Umfeld'),
(7, 'G 0.7 Großereignisse im Umfeld'),
(8, 'G 0.8 Ausfall oder Störung der Stromversorgung'),
(9, 'G 0.9 Ausfall oder Störung von Kommunikationsnetzen'),
(10, 'G 0.10 Ausfall oder Störung von Versorgungsnetzen'),
(11, 'G 0.11 Ausfall oder Störung von Dienstleistern'),
(12, 'G 0.12 Elektromagnetische Störstrahlung'),
(13, 'G 0.13 Abfangen kompromittierender Strahlung'),
(14, 'G 0.14 Ausspähen von Informationen (Spionage) '),
(15, 'G 0.15 Abhören '),
(16, 'G 0.16 Diebstahl von Geräten, Datenträgern oder Dokumenten'),
(17, 'G 0.17 Verlust von Geräten, Datenträgern oder Dokumenten'),
(18, 'G 0.18 Fehlplanung oder fehlende Anpassung'),
(19, 'G 0.19 Offenlegung schützenswerter Informationen'),
(20, 'G 0.20 Informationen oder Produkte aus unzuverlässiger Quelle'),
(21, 'G 0.21 Manipulation von Hard- oder Software'),
(22, 'G 0.22 Manipulation von Informationen'),
(23, 'G 0.23 Unbefugtes Eindringen in IT-Systeme'),
(24, 'G 0.24 Zerstörung von Geräten oder Datenträgern'),
(25, 'G 0.25 Ausfall von Geräten oder Systemen'),
(26, 'G 0.26 Fehlfunktion von Geräten oder Systemen'),
(27, 'G 0.27 Ressourcenmangel '),
(28, 'G 0.28 Software-Schwachstellen oder -Fehler'),
(29, 'G 0.29 Verstoß gegen Gesetze oder Regelungen'),
(30, 'G 0.30 Unberechtigte Nutzung oder Administration von Geräten und Systemen'),
(31, 'G 0.31 Fehlerhafte Nutzung oder Administration von Geräten und Systemen'),
(32, 'G 0.32 Missbrauch von Berechtigungen'),
(33, 'G 0.33 Personalausfall'),
(34, 'G 0.34 Anschlag'),
(35, 'G 0.35 Nötigung, Erpressung oder Korruption'),
(36, 'G 0.36 Identitätsdiebstahl'),
(37, 'G 0.37 Abstreiten von Handlungen'),
(38, 'G 0.38 Missbrauch personenbezogener Daten'),
(39, 'G 0.39 Schadprogramme'),
(40, 'G 0.40 Verhinderung von Diensten (Denial of Service)'),
(41, 'G 0.41 Sabotage'),
(42, 'G 0.42 Social Engineering'),
(43, 'G 0.43 Einspielen von Nachrichten'),
(44, 'G 0.44 Unbefugtes Eindringen in Räumlichkeiten'),
(45, 'G 0.45 Datenverlust'),
(46, 'G 0.46 Integritätsverlust schützenswerter Informationen'),
(47, 'G 0.47 Schädliche Seiteneffekte IT-gestützter Angriffe');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `Incidents`
--

CREATE TABLE `Incidents` (
  `id` int(10) UNSIGNED NOT NULL,
  `nummer` varchar(64) DEFAULT NULL,
  `Titel` varchar(256) DEFAULT NULL,
  `Beschreibung` text DEFAULT NULL,
  `Kategorie` varchar(64) DEFAULT NULL,
  `status` varchar(64) DEFAULT NULL,
  `Prio` varchar(64) DEFAULT NULL,
  `erkannt` date NOT NULL DEFAULT current_timestamp(),
  `gemeldet` date NOT NULL DEFAULT current_timestamp(),
  `beginn` date NOT NULL DEFAULT current_timestamp(),
  `beendet` date NOT NULL DEFAULT current_timestamp(),
  `geschlossen` date NOT NULL DEFAULT current_timestamp(),
  `Melder` int(10) UNSIGNED DEFAULT 0,
  `Owner` int(10) UNSIGNED DEFAULT 0,
  `Bearbeiter` int(10) UNSIGNED DEFAULT 0,
  `Eskalationsstelle` varchar(256) DEFAULT NULL,
  `typ` varchar(64) DEFAULT NULL,
  `ursache` varchar(64) DEFAULT NULL,
  `quelle` varchar(64) DEFAULT NULL,
  `Ersteller` int(10) UNSIGNED DEFAULT 0,
  `erstellt` date NOT NULL DEFAULT current_timestamp(),
  `DSGVO` tinyint(1) NOT NULL DEFAULT 0,
  `NIS2` tinyint(1) NOT NULL DEFAULT 0,
  `CRA` tinyint(1) NOT NULL DEFAULT 0,
  `Meldungwann` date NOT NULL DEFAULT current_timestamp(),
  `Meldungwem` varchar(256) DEFAULT NULL,
  `Rootcause` text DEFAULT NULL,
  `Schwachstelle` varchar(256) DEFAULT NULL,
  `Verbesserung` text DEFAULT NULL,
  `massnahmen` varchar(256) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT NULL,
  `ticketnr` varchar(256) DEFAULT NULL,
  `Änderer` int(10) UNSIGNED NOT NULL DEFAULT 0,
  `geändert` date NOT NULL DEFAULT current_timestamp(),
  `risiken` varchar(256) DEFAULT NULL,
  `assets` varchar(256) DEFAULT NULL,
  `archiviert` tinyint(1) NOT NULL DEFAULT 0,
  `vendor` varchar(256) DEFAULT NULL,
  `Titel_en` text DEFAULT NULL,
  `Beschreibung_en` text DEFAULT NULL,
  `Rootcause_en` text DEFAULT NULL,
  `Schwachstelle_en` text DEFAULT NULL,
  `Verbesserung_en` text DEFAULT NULL,
  `Ticketnummer` text DEFAULT NULL,
  `Massnahmentext` text DEFAULT NULL,
  `Massnahmentext_en` text DEFAULT NULL,
  `sync` tinyint(1) DEFAULT NULL,
  `synctime` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `inc_link`
--

CREATE TABLE `inc_link` (
  `id` int(10) UNSIGNED NOT NULL,
  `incident_id` int(10) UNSIGNED NOT NULL,
  `link` varchar(512) NOT NULL,
  `bezeichnung` varchar(256) NOT NULL,
  `datum` date NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `inc_meldepflicht`
--

CREATE TABLE `inc_meldepflicht` (
  `id` int(10) UNSIGNED NOT NULL,
  `incident_id` int(10) UNSIGNED NOT NULL,
  `regelwerk` varchar(10) NOT NULL,
  `kenntnis` datetime DEFAULT NULL,
  `entscheidung` varchar(30) NOT NULL DEFAULT 'offen',
  `begruendung` text DEFAULT NULL,
  `Aenderer` int(10) UNSIGNED DEFAULT NULL,
  `geaendert` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `inc_meldungen`
--

CREATE TABLE `inc_meldungen` (
  `id` int(10) UNSIGNED NOT NULL,
  `incident_id` int(10) UNSIGNED NOT NULL,
  `regelwerk` varchar(10) NOT NULL,
  `stufe` varchar(20) NOT NULL,
  `gemeldet_am` datetime NOT NULL,
  `stelle` varchar(200) DEFAULT NULL,
  `aktenzeichen` varchar(100) DEFAULT NULL,
  `inhalt` mediumtext DEFAULT NULL,
  `Ersteller` int(10) UNSIGNED DEFAULT NULL,
  `erstellt` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `ismshilfe`
--

CREATE TABLE `ismshilfe` (
  `id` int(10) UNSIGNED NOT NULL,
  `seite` varchar(256) NOT NULL,
  `name` varchar(256) DEFAULT NULL,
  `Text` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `ismshilfe`
--

INSERT INTO `ismshilfe` (`id`, `seite`, `name`, `Text`) VALUES
(10, 'lizenz_de', 'Lizenz', '<div class=\"lizenz-card\" style=\"background:#fff; border:1px solid #d0dde8; border-radius:10px; padding:20px 24px; max-width:820px; margin:0 0 16px; border-top:4px solid #2E5F8A; font-family:Arial, Helvetica, sans-serif; color:#333; line-height:1.55;\">\r\n\r\n  <h2 style=\"color:#2E5F8A; font-size:1.25rem; margin:0 0 4px;\">📄 Lizenzvereinbarung für WolfISMS (Subscription-Modell)</h2>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    1. Präambel\r\n  </div>\r\n  <p style=\"margin:0 0 10px;\">Diese Lizenzvereinbarung regelt die Nutzung der Software WolfISMS (nachfolgend „Software\") durch den Lizenznehmer.</p>\r\n  <p style=\"margin:0 0 10px;\">WolfISMS ist ein proprietäres Informationssicherheits-Management-System zur Unterstützung von Governance-, Risiko- und Compliance-Prozessen (u.&nbsp;a. ISO/IEC 27001, NIS2, BSI-Grundschutz).</p>\r\n  <p style=\"margin:0 0 18px;\">Die Software ist urheberrechtlich geschützt und wird nicht als Open-Source-Software bereitgestellt.</p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    2. Lizenzgeber\r\n  </div>\r\n  <p style=\"margin:0 0 4px;\">WolfInfoSec Wolfgang Schuster</p>\r\n  <p style=\"margin:0 0 4px;\">Inhaber: Wolfgang Schuster</p>\r\n  <p style=\"margin:0 0 4px;\">Deutschland</p>\r\n  <p style=\"margin:0 0 10px;\">(nachfolgend „Lizenzgeber\")</p>\r\n  <p style=\"margin:0 0 18px;\">\r\n    Die Software kann sowohl direkt vom Lizenzgeber als auch über einen vom Lizenzgeber autorisierten Vertriebspartner\r\n    (nachfolgend „Partner\") bezogen werden. Das Nutzungsrecht an der Software wird in beiden Fällen unmittelbar durch diese\r\n    Lizenzvereinbarung zwischen Lizenzgeber und Lizenznehmer begründet; die kommerzielle Abwicklung (Bestellung, Rechnungsstellung,\r\n    ggf. Hosting) kann hiervon unabhängig über den Partner erfolgen. Rechte und Pflichten zwischen Lizenzgeber und Partner richten\r\n    sich nach einem gesonderten Vertriebspartnervertrag.\r\n  </p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    3. Vertragsgegenstand\r\n  </div>\r\n  <p style=\"margin:0 0 18px;\">\r\n    Gegenstand dieser Vereinbarung ist die Überlassung von Nutzungsrechten an der Software WolfISMS im Rahmen eines zeitlich\r\n    befristeten Abonnements (Subscription), einschließlich zugehöriger Module, Datenbankstrukturen, Benutzeroberflächen sowie\r\n    der zur Nutzung erforderlichen Dokumentation.\r\n  </p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    4. Art der Lizenz\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">Der Lizenzgeber räumt dem Lizenznehmer eine:</p>\r\n  <ul style=\"margin:0 0 10px; padding-left:20px;\">\r\n    <li>nicht ausschließliche</li>\r\n    <li>nicht übertragbare</li>\r\n    <li>nicht unterlizenzierbare</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 6px;\">Lizenz zur Nutzung der Software ein.</p>\r\n  <p style=\"margin:0 0 18px;\">Die Lizenz gilt ausschließlich für den internen Einsatz im Unternehmen des Lizenznehmers und nur im Rahmen einer gültigen Subscription.</p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    5. Umfang der Nutzung\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">Sofern nicht ausdrücklich schriftlich anders vereinbart, ist der Lizenznehmer berechtigt:</p>\r\n  <ul style=\"margin:0 0 12px; padding-left:20px;\">\r\n    <li>die Software intern zu betreiben (On-Premise oder Hosting nach Vereinbarung),</li>\r\n    <li>die Software für eigene ISMS-, GRC- und Compliance-Zwecke zu nutzen,</li>\r\n    <li>interne Benutzerkonten im Rahmen der gebuchten Lizenzparameter (z.&nbsp;B. Edition, Benutzeranzahl) anzulegen,</li>\r\n    <li>die Software durch einen vom Lizenzgeber autorisierten Partner betreiben bzw. hosten zu lassen (autorisiertes Hosting).</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 6px;\">Nicht gestattet ist insbesondere:</p>\r\n  <ul style=\"margin:0 0 12px; padding-left:20px;\">\r\n    <li>die entgeltliche oder unentgeltliche Weitergabe an Dritte, die nicht vom Lizenzgeber als Partner autorisiert sind,</li>\r\n    <li>der Betrieb als SaaS-, Cloud- oder Mandantenlösung für externe Organisationen durch den Lizenznehmer selbst oder durch nicht autorisierte Dritte,</li>\r\n    <li>das Anbieten der Software oder von Teilen davon als eigenes Produkt oder als eigene Dienstleistung durch den Lizenznehmer oder nicht autorisierte Dritte.</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 18px;\">\r\n    Ein „autorisierter Partner\" im Sinne dieser Vereinbarung ist ausschließlich ein Vertriebspartner, mit dem der Lizenzgeber\r\n    einen gültigen Vertriebspartnervertrag geschlossen hat, der ihn zum Vertrieb und/oder Hosting der Software berechtigt.\r\n    Erfolgt das Hosting durch einen autorisierten Partner oder den Lizenzgeber und werden dabei personenbezogene Daten des\r\n    Lizenznehmers verarbeitet, ist zwischen dem Lizenznehmer und der hostenden Stelle vor Aufnahme der Verarbeitung ein\r\n    Auftragsverarbeitungsvertrag gemäß Art. 28 DSGVO abzuschließen. Ohne einen solchen Auftragsverarbeitungsvertrag darf keine\r\n    Verarbeitung personenbezogener Daten im Rahmen des Hostings erfolgen.\r\n  </p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    6. Subscription, Vergütung und Zahlungsbedingungen\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">Die Nutzung der Software ist kostenpflichtig und erfolgt ausschließlich im Rahmen einer Subscription.</p>\r\n  <p style=\"margin:0 0 6px;\">Art, Umfang, Laufzeit und Höhe der Vergütung ergeben sich aus:</p>\r\n  <ul style=\"margin:0 0 10px; padding-left:20px;\">\r\n    <li>einem separaten Lizenz- oder Subscription-Vertrag,</li>\r\n    <li>einem Angebot oder</li>\r\n    <li>einer gültigen Preisliste des Lizenzgebers.</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 6px;\">Die Subscription ist im Voraus für den jeweiligen Abrechnungszeitraum zu bezahlen.</p>\r\n  <p style=\"margin:0 0 18px;\">Ohne gültige Subscription und vollständigen Zahlungseingang besteht kein Anspruch auf Updates oder Support.</p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    7. Updates und Weiterentwicklung\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">Während einer aktiven Subscription erhält der Lizenznehmer Zugriff auf:</p>\r\n  <ul style=\"margin:0 0 10px; padding-left:20px;\">\r\n    <li>Fehlerbehebungen (Bugfixes),</li>\r\n    <li>kleinere Verbesserungen und Weiterentwicklungen,</li>\r\n    <li>neue Versionen der Software im Rahmen der gebuchten Edition.</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 6px;\">Ein Anspruch auf bestimmte Funktionen, Erweiterungen oder individuelle Weiterentwicklungen besteht nicht.</p>\r\n  <p style=\"margin:0 0 18px;\">Nach Beendigung der Subscription werden keine Updates mehr bereitgestellt.</p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    8. Supportleistungen\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">Supportleistungen werden ausschließlich während einer aktiven Subscription erbracht.</p>\r\n  <p style=\"margin:0 0 6px;\">Der Support umfasst ausschließlich:</p>\r\n  <ul style=\"margin:0 0 10px; padding-left:20px;\">\r\n    <li>Unterstützung bei der Bedienung der Software,</li>\r\n    <li>Unterstützung bei der Installation und technischen Einrichtung.</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 6px;\">Der Support umfasst nicht:</p>\r\n  <ul style=\"margin:0 0 10px; padding-left:20px;\">\r\n    <li>Beratung zur Informationssicherheit im Allgemeinen,</li>\r\n    <li>Interpretation oder Umsetzung von Normen (z.&nbsp;B. ISO/IEC 27001, NIS2, BSI-Grundschutz),</li>\r\n    <li>fachliche oder organisatorische ISMS-Beratung.</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 18px;\">Weitergehende Support- oder Beratungsleistungen bedürfen einer gesonderten Vereinbarung.</p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    9. Betrieb nach Ende der Subscription\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">Nach Beendigung der Subscription ist der Lizenznehmer berechtigt, die zuletzt bereitgestellte Version der Software ohne Updates und ohne Support weiter zu betreiben.</p>\r\n  <p style=\"margin:0 0 6px;\">Der Weiterbetrieb erfolgt:</p>\r\n  <ul style=\"margin:0 0 18px; padding-left:20px;\">\r\n    <li>auf eigene Verantwortung des Lizenznehmers,</li>\r\n    <li>ohne Anspruch auf Fehlerbehebungen, Sicherheitsupdates oder Weiterentwicklungen,</li>\r\n    <li>ohne jegliche Haftung des Lizenzgebers für daraus resultierende Schäden.</li>\r\n  </ul>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    10. Urheber- und Schutzrechte\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">Alle Rechte an der Software, insbesondere an:</p>\r\n  <ul style=\"margin:0 0 10px; padding-left:20px;\">\r\n    <li>Quellcode und Objektcode,</li>\r\n    <li>Datenbankdesign und Strukturen,</li>\r\n    <li>Benutzeroberflächen,</li>\r\n    <li>Konzepten, Methoden und Logiken,</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 6px;\">verbleiben ausschließlich beim Lizenzgeber.</p>\r\n  <p style=\"margin:0 0 18px;\">Der Lizenznehmer erwirbt kein Eigentum an der Software, sondern lediglich ein Nutzungsrecht im vereinbarten Umfang.</p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    11. Verbotene Handlungen\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">Dem Lizenznehmer ist es untersagt:</p>\r\n  <ul style=\"margin:0 0 18px; padding-left:20px;\">\r\n    <li>die Software zu dekompilieren, zu disassemblieren oder zurückzuentwickeln (Reverse Engineering),</li>\r\n    <li>Quellcode ganz oder teilweise zu verändern oder offenzulegen,</li>\r\n    <li>Lizenz-, Copyright- oder Schutzvermerke zu entfernen,</li>\r\n    <li>Sicherheits- oder Lizenzmechanismen zu umgehen.</li>\r\n  </ul>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    12. Anpassungen und Erweiterungen\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">Individuelle Anpassungen, Erweiterungen oder Integrationen:</p>\r\n  <ul style=\"margin:0 0 10px; padding-left:20px;\">\r\n    <li>bedürfen der Zustimmung des Lizenzgebers,</li>\r\n    <li>können gesondert vergütet werden,</li>\r\n    <li>begründen keine Miturheberschaft des Lizenznehmers.</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 18px;\">Sofern nichts anderes vereinbart ist, verbleiben alle daraus entstehenden Rechte beim Lizenzgeber.</p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    13. Gewährleistung\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">Die Software wird in dem Zustand bereitgestellt, der dem aktuellen Entwicklungsstand entspricht („as is\").</p>\r\n  <p style=\"margin:0 0 6px;\">Der Lizenzgeber übernimmt insbesondere keine Gewähr dafür, dass:</p>\r\n  <ul style=\"margin:0 0 18px; padding-left:20px;\">\r\n    <li>die Software fehlerfrei ist,</li>\r\n    <li>sie jederzeit verfügbar ist,</li>\r\n    <li>sie allen individuellen rechtlichen oder organisatorischen Anforderungen des Lizenznehmers entspricht.</li>\r\n  </ul>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    14. Haftung\r\n  </div>\r\n  <p style=\"margin:0 0 10px;\">\r\n    Der Lizenzgeber haftet unbeschränkt bei Vorsatz und grober Fahrlässigkeit sowie nach den Vorschriften des\r\n    Produkthaftungsgesetzes. Ebenso unbeschränkt haftet der Lizenzgeber bei der Verletzung des Lebens, des Körpers oder der\r\n    Gesundheit, unabhängig vom Grad des Verschuldens.\r\n  </p>\r\n  <p style=\"margin:0 0 10px;\">\r\n    Bei leicht fahrlässiger Verletzung wesentlicher Vertragspflichten (Kardinalpflichten), deren Erfüllung die ordnungsgemäße\r\n    Durchführung des Vertrags überhaupt erst ermöglicht und auf deren Einhaltung der Lizenznehmer regelmäßig vertrauen darf,\r\n    ist die Haftung des Lizenzgebers der Höhe nach auf den bei Vertragsschluss vorhersehbaren, vertragstypischen Schaden begrenzt.\r\n  </p>\r\n  <p style=\"margin:0 0 10px;\">\r\n    Im Übrigen ist eine Haftung des Lizenzgebers für leichte Fahrlässigkeit ausgeschlossen, insbesondere für mittelbare Schäden,\r\n    entgangenen Gewinn und Datenverlust, soweit gesetzlich zulässig.\r\n  </p>\r\n  <p style=\"margin:0 0 18px;\">\r\n    Für Schäden, die im Rahmen eines von einem autorisierten Partner erbrachten Hostings entstehen, haftet der Lizenzgeber nicht,\r\n    soweit die Ursache im Verantwortungsbereich des Partners liegt; insoweit haftet der Partner gemäß dem zwischen ihm und dem\r\n    Lizenznehmer bestehenden Vertragsverhältnis.\r\n  </p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    15. Vertraulichkeit\r\n  </div>\r\n  <p style=\"margin:0 0 18px;\">\r\n    Der Lizenznehmer verpflichtet sich, alle ihm im Zusammenhang mit der Software bekannt gewordenen nicht-öffentlichen\r\n    Informationen vertraulich zu behandeln.\r\n  </p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    16. Anwendbares Recht und Gerichtsstand\r\n  </div>\r\n  <p style=\"margin:0 0 10px;\">Es gilt das Recht der Bundesrepublik Deutschland unter Ausschluss des UN-Kaufrechts (CISG).</p>\r\n  <p style=\"margin:0 0 18px;\">\r\n    Ist der Lizenznehmer Kaufmann im Sinne des Handelsgesetzbuchs, juristische Person des öffentlichen Rechts oder\r\n    öffentlich-rechtliches Sondervermögen, ist Gerichtsstand für alle Streitigkeiten aus oder im Zusammenhang mit dieser\r\n    Vereinbarung der Sitz des Lizenzgebers. Gegenüber Verbrauchern gelten die gesetzlichen Gerichtsstandsregelungen.\r\n  </p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    17. Schlussbestimmungen\r\n  </div>\r\n  <p style=\"margin:0 0 10px;\">Änderungen und Ergänzungen dieser Vereinbarung bedürfen der Textform. Dies gilt auch für einen Verzicht auf dieses Formerfordernis.</p>\r\n  <p style=\"margin:0 0 18px;\">Sollten einzelne Bestimmungen dieser Vereinbarung unwirksam sein oder werden, bleibt die Wirksamkeit der übrigen Regelungen unberührt.</p>\r\n\r\n  <p style=\"font-size:0.8rem; color:#888; margin:10px 0 0; border-top:1px solid #e0e8f0; padding-top:8px; font-style:italic;\">\r\n    © WolfInfoSec Wolfgang Schuster – Alle Rechte vorbehalten\r\n  </p>\r\n\r\n</div>'),
(11, 'isms_de', 'Was ist ein ISMS?', '<div class=\"isms-intro-card\" style=\"background:#fff; border:1px solid #d0dde8; border-radius:10px; padding:20px 24px; max-width:820px; margin:0 0 16px; border-top:4px solid #2E5F8A; font-family:Arial, Helvetica, sans-serif; color:#333; line-height:1.55;\">\r\n\r\n  <h2 style=\"color:#2E5F8A; font-size:1.25rem; margin:0 0 4px;\">🛡️ Informationssicherheits-Managementsystem (ISMS) – Allgemeine Einführung</h2>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    Was ist ein ISMS?\r\n  </div>\r\n  <p style=\"margin:0 0 10px;\">\r\n    Ein Informationssicherheits-Managementsystem (ISMS) ist ein <strong>systematischer, strukturierter Ansatz</strong>,\r\n    um Informationen und informationsverarbeitende Systeme <strong>angemessen zu schützen</strong>.<br>\r\n    Ziel ist es, Risiken für Informationen <strong>kontinuierlich zu erkennen, zu bewerten und zu steuern</strong>.\r\n  </p>\r\n  <p style=\"margin:0 0 18px;\">\r\n    Ein ISMS betrachtet Informationssicherheit <strong>ganzheitlich</strong> – nicht nur technisch, sondern auch organisatorisch und personell.\r\n  </p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    Ziele eines ISMS\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">Ein wirksames ISMS verfolgt insbesondere folgende Ziele:</p>\r\n  <ul style=\"margin:0 0 18px; padding-left:20px;\">\r\n    <li>Schutz von Informationen und IT-Systemen</li>\r\n    <li>Sicherstellung von\r\n      <ul style=\"margin:6px 0 0; padding-left:20px;\">\r\n        <li><strong>Vertraulichkeit</strong> (Zugriff nur für Berechtigte)</li>\r\n        <li><strong>Integrität</strong> (Richtigkeit und Vollständigkeit)</li>\r\n        <li><strong>Verfügbarkeit</strong> (rechtzeitige Nutzbarkeit)</li>\r\n      </ul>\r\n    </li>\r\n    <li>Einhaltung gesetzlicher, regulatorischer und vertraglicher Anforderungen</li>\r\n    <li>Reduzierung von Sicherheitsvorfällen und Schäden</li>\r\n    <li>Transparenz und Nachweisbarkeit gegenüber Management, Kunden und Prüfern</li>\r\n  </ul>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    Warum ein ISMS notwendig ist\r\n  </div>\r\n  <p style=\"margin:0 0 10px;\">\r\n    Informationssicherheit ist heute ein <strong>kritischer Erfolgsfaktor</strong>.<br>\r\n    Organisationen stehen u.&nbsp;a. vor folgenden Herausforderungen:\r\n  </p>\r\n  <ul style=\"margin:0 0 10px; padding-left:20px;\">\r\n    <li>Zunehmende Cyberbedrohungen</li>\r\n    <li>Steigende regulatorische Anforderungen</li>\r\n    <li>Komplexe IT- und Lieferketten</li>\r\n    <li>Abhängigkeit von digitalen Prozessen</li>\r\n    <li>Hohe Anforderungen an Nachweis und Compliance</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 18px;\">\r\n    Ein ISMS sorgt dafür, dass Informationssicherheit <strong>nicht zufällig</strong>, sondern\r\n    <strong>geplant, gesteuert und überprüft</strong> erfolgt.\r\n  </p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    Grundprinzipien eines ISMS\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">Ein ISMS basiert auf klaren Prinzipien:</p>\r\n  <ul style=\"margin:0 0 18px; padding-left:20px;\">\r\n    <li><strong>Risikoorientierung</strong><br>Sicherheitsmaßnahmen werden dort umgesetzt, wo sie notwendig sind</li>\r\n    <li style=\"margin-top:8px;\"><strong>Verantwortlichkeit</strong><br>Rollen und Zuständigkeiten sind eindeutig definiert</li>\r\n    <li style=\"margin-top:8px;\"><strong>Dokumentation &amp; Nachweisbarkeit</strong><br>Entscheidungen und Umsetzungen sind nachvollziehbar dokumentiert</li>\r\n    <li style=\"margin-top:8px;\"><strong>Kontinuierliche Verbesserung</strong><br>Informationssicherheit entwickelt sich laufend weiter</li>\r\n  </ul>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    Der ISMS-Regelkreis (PDCA)\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">Ein ISMS folgt einem kontinuierlichen Verbesserungsprozess, häufig dargestellt als PDCA-Zyklus:</p>\r\n  <ul style=\"margin:0 0 10px; padding-left:20px;\">\r\n    <li><strong>Plan</strong><br>Ziele festlegen, Risiken analysieren, Maßnahmen planen</li>\r\n    <li style=\"margin-top:8px;\"><strong>Do</strong><br>Maßnahmen umsetzen, Prozesse etablieren</li>\r\n    <li style=\"margin-top:8px;\"><strong>Check</strong><br>Wirksamkeit prüfen, Audits durchführen, Kennzahlen bewerten</li>\r\n    <li style=\"margin-top:8px;\"><strong>Act</strong><br>Verbesserungen ableiten, Anpassungen vornehmen</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 18px;\">Dieser Zyklus stellt sicher, dass das ISMS <strong>lebendig und aktuell</strong> bleibt.</p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    Zentrale Bausteine eines ISMS\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">Ein ISMS besteht aus mehreren miteinander verknüpften Bereichen:</p>\r\n  <ul style=\"margin:0 0 10px; padding-left:20px;\">\r\n    <li><strong>Dokumente &amp; Richtlinien</strong> – Vorgaben und Regelwerke</li>\r\n    <li><strong>Assets</strong> – schützenswerte Werte der Organisation</li>\r\n    <li><strong>Risiken</strong> – Bedrohungen und Schwachstellen</li>\r\n    <li><strong>Maßnahmen</strong> – konkrete Schutz- und Verbesserungsmaßnahmen</li>\r\n    <li><strong>Lieferantenmanagement</strong> – Steuerung externer Risiken</li>\r\n    <li><strong>Personalmanagement</strong> – Rollen, Schulung und Sensibilisierung</li>\r\n    <li><strong>Termine</strong> – Fristen, Reviews und wiederkehrende Aufgaben</li>\r\n    <li><strong>Audits</strong> – Überprüfung und Verbesserung</li>\r\n    <li><strong>Normen</strong> – externe und interne Anforderungen</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 18px;\">Diese Bausteine greifen ineinander und bilden gemeinsam das ISMS.</p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    Rollen und Verantwortung im ISMS\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">Ein ISMS ist eine <strong>Gemeinschaftsaufgabe</strong>. Typische Rollen sind:</p>\r\n  <ul style=\"margin:0 0 18px; padding-left:20px;\">\r\n    <li><strong>Management</strong><br>Verantwortung, Zielvorgaben, Freigaben</li>\r\n    <li style=\"margin-top:8px;\"><strong>Informationssicherheitsbeauftragte (ISB / CISO)</strong><br>Steuerung, Koordination und Weiterentwicklung des ISMS</li>\r\n    <li style=\"margin-top:8px;\"><strong>Fach- und IT-Verantwortliche</strong><br>Umsetzung von Maßnahmen in ihren Bereichen</li>\r\n    <li style=\"margin-top:8px;\"><strong>Mitarbeitende</strong><br>Einhaltung der Sicherheitsvorgaben im Arbeitsalltag</li>\r\n  </ul>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    ISMS als Teil der Organisation\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">Ein ISMS ist <strong>kein isoliertes IT-Projekt</strong>, sondern:</p>\r\n  <ul style=\"margin:0 0 10px; padding-left:20px;\">\r\n    <li>Teil der Unternehmensführung</li>\r\n    <li>Unterstützt Geschäftsziele</li>\r\n    <li>Integriert sich in bestehende Prozesse</li>\r\n    <li>Wächst mit der Organisation mit</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 6px;\">Ein gut eingeführtes ISMS erhöht nicht nur die Sicherheit, sondern auch:</p>\r\n  <ul style=\"margin:0 0 18px; padding-left:20px;\">\r\n    <li>Stabilität,</li>\r\n    <li>Vertrauen,</li>\r\n    <li>Professionalität.</li>\r\n  </ul>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    Rolle dieses ISMS-Portals\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">Dieses ISMS-Portal dient als <strong>zentrale Plattform</strong> zur:</p>\r\n  <ul style=\"margin:0 0 10px; padding-left:20px;\">\r\n    <li>Dokumentation aller ISMS-Elemente</li>\r\n    <li>Steuerung von Risiken und Maßnahmen</li>\r\n    <li>Erfüllung von Norm- und Audit-Anforderungen</li>\r\n    <li>Transparenz für Management und Mitarbeitende</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 18px;\">\r\n    Die Hilfeseiten unterstützen dabei, das ISMS <strong>verständlich, einheitlich und effizient</strong> zu nutzen.\r\n  </p>\r\n\r\n  <div style=\"background:#f0f4ff; border:1px solid #c7d4f5; border-left:4px solid #0078d4; border-radius:8px; padding:12px 16px; margin:0 0 4px;\">\r\n    <strong style=\"color:#0078d4;\">Empfohlene nächste Schritte für neue Nutzer:</strong>\r\n    <ol style=\"margin:8px 0 0; padding-left:20px; font-size:0.9rem; color:#333;\">\r\n      <li>Überblick über Dokumente und Richtlinien verschaffen</li>\r\n      <li>Relevante Assets prüfen oder erfassen</li>\r\n      <li>Risiken verstehen und bewerten</li>\r\n      <li>Maßnahmen und Termine verfolgen</li>\r\n      <li>Eigene Rolle im ISMS kennen</li>\r\n    </ol>\r\n  </div>\r\n\r\n</div>'),
(17, 'lizenz_en', 'License', '<div class=\"license-card\" style=\"background:#fff; border:1px solid #d0dde8; border-radius:10px; padding:20px 24px; max-width:820px; margin:0 0 16px; border-top:4px solid #2E5F8A; font-family:Arial, Helvetica, sans-serif; color:#333; line-height:1.55;\">\r\n\r\n  <h2 style=\"color:#2E5F8A; font-size:1.25rem; margin:0 0 4px;\">📄 License Agreement for WolfISMS (Subscription Model)</h2>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    1. Preamble\r\n  </div>\r\n  <p style=\"margin:0 0 10px;\">This license agreement governs the use of the WolfISMS software (hereinafter the \"Software\") by the licensee.</p>\r\n  <p style=\"margin:0 0 10px;\">WolfISMS is a proprietary information security management system supporting governance, risk, and compliance processes (including ISO/IEC 27001, NIS2, BSI IT-Grundschutz).</p>\r\n  <p style=\"margin:0 0 18px;\">The Software is protected by copyright and is not provided as open-source software.</p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    2. Licensor\r\n  </div>\r\n  <p style=\"margin:0 0 4px;\">WolfInfoSec Wolfgang Schuster</p>\r\n  <p style=\"margin:0 0 4px;\">Owner: Wolfgang Schuster</p>\r\n  <p style=\"margin:0 0 4px;\">Germany</p>\r\n  <p style=\"margin:0 0 10px;\">(hereinafter the \"Licensor\")</p>\r\n  <p style=\"margin:0 0 18px;\">\r\n    The Software may be obtained either directly from the Licensor or through a distribution partner authorized by the Licensor\r\n    (hereinafter the \"Partner\"). In either case, the right to use the Software is established directly through this license\r\n    agreement between the Licensor and the Licensee; the commercial handling (ordering, invoicing, and, where applicable, hosting)\r\n    may be carried out independently through the Partner. The rights and obligations between the Licensor and the Partner are\r\n    governed by a separate distribution partner agreement.\r\n  </p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    3. Subject Matter of the Agreement\r\n  </div>\r\n  <p style=\"margin:0 0 18px;\">\r\n    The subject matter of this agreement is the granting of usage rights to the WolfISMS software as part of a fixed-term\r\n    subscription, including associated modules, database structures, user interfaces, and the documentation required for use.\r\n  </p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    4. Type of License\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">The Licensor grants the Licensee a:</p>\r\n  <ul style=\"margin:0 0 10px; padding-left:20px;\">\r\n    <li>non-exclusive</li>\r\n    <li>non-transferable</li>\r\n    <li>non-sublicensable</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 6px;\">license to use the Software.</p>\r\n  <p style=\"margin:0 0 18px;\">The license applies exclusively to internal use within the Licensee\'s organization and only for the duration of a valid subscription.</p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    5. Scope of Use\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">Unless expressly agreed otherwise in writing, the Licensee is entitled to:</p>\r\n  <ul style=\"margin:0 0 12px; padding-left:20px;\">\r\n    <li>operate the Software internally (on-premise or hosted, as agreed),</li>\r\n    <li>use the Software for its own ISMS, GRC, and compliance purposes,</li>\r\n    <li>create internal user accounts within the scope of the licensed parameters (e.g., edition, number of users),</li>\r\n    <li>have the Software operated or hosted by a Partner authorized by the Licensor (authorized hosting).</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 6px;\">In particular, the following is not permitted:</p>\r\n  <ul style=\"margin:0 0 12px; padding-left:20px;\">\r\n    <li>passing the Software on, whether for payment or free of charge, to third parties not authorized by the Licensor as a Partner,</li>\r\n    <li>operating the Software as a SaaS, cloud, or multi-tenant solution for external organizations, whether by the Licensee itself or by unauthorized third parties,</li>\r\n    <li>offering the Software, or parts thereof, as the Licensee\'s own product or service, or that of an unauthorized third party.</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 18px;\">\r\n    An \"authorized Partner\" within the meaning of this agreement is exclusively a distribution partner with whom the Licensor\r\n    has entered into a valid distribution partner agreement entitling it to distribute and/or host the Software. Where hosting\r\n    is provided by an authorized Partner or by the Licensor and personal data of the Licensee is processed in this context, a\r\n    data processing agreement pursuant to Art. 28 GDPR must be concluded between the Licensee and the hosting party before\r\n    processing begins. No processing of personal data may take place as part of the hosting without such a data processing\r\n    agreement in place.\r\n  </p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    6. Subscription, Fees, and Payment Terms\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">Use of the Software is subject to a fee and is provided exclusively under a subscription.</p>\r\n  <p style=\"margin:0 0 6px;\">The type, scope, term, and amount of the fee result from:</p>\r\n  <ul style=\"margin:0 0 10px; padding-left:20px;\">\r\n    <li>a separate license or subscription agreement,</li>\r\n    <li>a quotation, or</li>\r\n    <li>a valid price list of the Licensor.</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 6px;\">The subscription must be paid in advance for the respective billing period.</p>\r\n  <p style=\"margin:0 0 18px;\">Without a valid subscription and full receipt of payment, there is no entitlement to updates or support.</p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    7. Updates and Further Development\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">During an active subscription, the Licensee receives access to:</p>\r\n  <ul style=\"margin:0 0 10px; padding-left:20px;\">\r\n    <li>bug fixes,</li>\r\n    <li>minor improvements and enhancements,</li>\r\n    <li>new versions of the Software within the scope of the licensed edition.</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 6px;\">There is no entitlement to specific features, extensions, or individual further development.</p>\r\n  <p style=\"margin:0 0 18px;\">No further updates will be provided after the subscription ends.</p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    8. Support Services\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">Support services are provided exclusively during an active subscription.</p>\r\n  <p style=\"margin:0 0 6px;\">Support covers exclusively:</p>\r\n  <ul style=\"margin:0 0 10px; padding-left:20px;\">\r\n    <li>assistance with operating the Software,</li>\r\n    <li>assistance with installation and technical setup.</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 6px;\">Support does not cover:</p>\r\n  <ul style=\"margin:0 0 10px; padding-left:20px;\">\r\n    <li>general information security consulting,</li>\r\n    <li>interpretation or implementation of standards (e.g., ISO/IEC 27001, NIS2, BSI IT-Grundschutz),</li>\r\n    <li>substantive or organizational ISMS consulting.</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 18px;\">Any further support or consulting services require a separate agreement.</p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    9. Operation After the End of the Subscription\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">After the subscription ends, the Licensee is entitled to continue operating the last version of the Software provided, without updates and without support.</p>\r\n  <p style=\"margin:0 0 6px;\">Continued operation takes place:</p>\r\n  <ul style=\"margin:0 0 18px; padding-left:20px;\">\r\n    <li>at the Licensee\'s own responsibility,</li>\r\n    <li>without any entitlement to bug fixes, security updates, or further development,</li>\r\n    <li>without any liability of the Licensor for resulting damages.</li>\r\n  </ul>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    10. Copyright and Intellectual Property Rights\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">All rights to the Software, in particular to:</p>\r\n  <ul style=\"margin:0 0 10px; padding-left:20px;\">\r\n    <li>source code and object code,</li>\r\n    <li>database design and structures,</li>\r\n    <li>user interfaces,</li>\r\n    <li>concepts, methods, and logic,</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 6px;\">remain exclusively with the Licensor.</p>\r\n  <p style=\"margin:0 0 18px;\">The Licensee does not acquire ownership of the Software, but only a right of use within the agreed scope.</p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    11. Prohibited Actions\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">The Licensee is prohibited from:</p>\r\n  <ul style=\"margin:0 0 18px; padding-left:20px;\">\r\n    <li>decompiling, disassembling, or reverse engineering the Software,</li>\r\n    <li>modifying or disclosing the source code, in whole or in part,</li>\r\n    <li>removing license, copyright, or other protective notices,</li>\r\n    <li>circumventing security or licensing mechanisms.</li>\r\n  </ul>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    12. Customizations and Extensions\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">Individual customizations, extensions, or integrations:</p>\r\n  <ul style=\"margin:0 0 10px; padding-left:20px;\">\r\n    <li>require the Licensor\'s consent,</li>\r\n    <li>may be subject to separate fees,</li>\r\n    <li>do not establish any co-authorship rights for the Licensee.</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 18px;\">Unless otherwise agreed, all rights arising therefrom remain with the Licensor.</p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    13. Warranty\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">The Software is provided in the condition corresponding to its current state of development (\"as is\").</p>\r\n  <p style=\"margin:0 0 6px;\">In particular, the Licensor gives no warranty that:</p>\r\n  <ul style=\"margin:0 0 18px; padding-left:20px;\">\r\n    <li>the Software is free of errors,</li>\r\n    <li>it is available at all times,</li>\r\n    <li>it meets all of the Licensee\'s individual legal or organizational requirements.</li>\r\n  </ul>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    14. Liability\r\n  </div>\r\n  <p style=\"margin:0 0 10px;\">\r\n    The Licensor is liable without limitation for intent and gross negligence, as well as under the provisions of the German\r\n    Product Liability Act. The Licensor is likewise liable without limitation for injury to life, body, or health, regardless\r\n    of the degree of fault.\r\n  </p>\r\n  <p style=\"margin:0 0 10px;\">\r\n    In the case of slightly negligent breach of material contractual obligations (cardinal obligations), the fulfillment of\r\n    which is essential to the proper performance of the agreement and on the observance of which the Licensee may regularly\r\n    rely, the Licensor\'s liability is limited in amount to the foreseeable damage typical for this type of contract at the\r\n    time the agreement was concluded.\r\n  </p>\r\n  <p style=\"margin:0 0 10px;\">\r\n    Otherwise, the Licensor\'s liability for slight negligence is excluded, in particular for indirect damages, loss of profit,\r\n    and loss of data, to the extent permitted by law.\r\n  </p>\r\n  <p style=\"margin:0 0 18px;\">\r\n    The Licensor is not liable for damages arising in connection with hosting provided by an authorized Partner, insofar as\r\n    the cause lies within the Partner\'s area of responsibility; in that case, the Partner is liable in accordance with the\r\n    contractual relationship existing between it and the Licensee.\r\n  </p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    15. Confidentiality\r\n  </div>\r\n  <p style=\"margin:0 0 18px;\">\r\n    The Licensee undertakes to treat as confidential all non-public information that comes to its knowledge in connection with the Software.\r\n  </p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    16. Governing Law and Jurisdiction\r\n  </div>\r\n  <p style=\"margin:0 0 10px;\">This agreement is governed by the law of the Federal Republic of Germany, excluding the UN Convention on Contracts for the International Sale of Goods (CISG).</p>\r\n  <p style=\"margin:0 0 18px;\">\r\n    If the Licensee is a merchant within the meaning of the German Commercial Code, a legal entity under public law, or a\r\n    special fund under public law, the place of jurisdiction for all disputes arising from or in connection with this agreement\r\n    shall be the registered office of the Licensor. The statutory provisions on jurisdiction apply with respect to consumers.\r\n  </p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    17. Final Provisions\r\n  </div>\r\n  <p style=\"margin:0 0 10px;\">Amendments and additions to this agreement must be made in text form. This also applies to any waiver of this form requirement.</p>\r\n  <p style=\"margin:0 0 18px;\">Should individual provisions of this agreement be or become invalid, the validity of the remaining provisions shall remain unaffected.</p>\r\n\r\n  <p style=\"font-size:0.8rem; color:#888; margin:10px 0 0; border-top:1px solid #e0e8f0; padding-top:8px; font-style:italic;\">\r\n    © WolfInfoSec Wolfgang Schuster – All rights reserved\r\n  </p>\r\n\r\n</div>'),
(18, 'isms_en', 'What is a ISMS?', '<div class=\"isms-intro-card\" style=\"background:#fff; border:1px solid #d0dde8; border-radius:10px; padding:20px 24px; max-width:820px; margin:0 0 16px; border-top:4px solid #2E5F8A; font-family:Arial, Helvetica, sans-serif; color:#333; line-height:1.55;\">\r\n\r\n  <h2 style=\"color:#2E5F8A; font-size:1.25rem; margin:0 0 4px;\">🛡️ Information Security Management System (ISMS) – General Introduction</h2>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    What Is an ISMS?\r\n  </div>\r\n  <p style=\"margin:0 0 10px;\">\r\n    An Information Security Management System (ISMS) is a <strong>systematic, structured approach</strong>\r\n    to <strong>appropriately protecting</strong> information and information-processing systems.<br>\r\n    Its aim is to <strong>continuously identify, assess, and manage</strong> risks to information.\r\n  </p>\r\n  <p style=\"margin:0 0 18px;\">\r\n    An ISMS looks at information security <strong>holistically</strong> – not just technically, but also organizationally and in terms of people.\r\n  </p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    Objectives of an ISMS\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">An effective ISMS pursues, in particular, the following objectives:</p>\r\n  <ul style=\"margin:0 0 18px; padding-left:20px;\">\r\n    <li>Protection of information and IT systems</li>\r\n    <li>Ensuring\r\n      <ul style=\"margin:6px 0 0; padding-left:20px;\">\r\n        <li><strong>Confidentiality</strong> (access only for authorized persons)</li>\r\n        <li><strong>Integrity</strong> (accuracy and completeness)</li>\r\n        <li><strong>Availability</strong> (timely usability)</li>\r\n      </ul>\r\n    </li>\r\n    <li>Compliance with legal, regulatory, and contractual requirements</li>\r\n    <li>Reduction of security incidents and damages</li>\r\n    <li>Transparency and demonstrable evidence toward management, customers, and auditors</li>\r\n  </ul>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    Why an ISMS Is Necessary\r\n  </div>\r\n  <p style=\"margin:0 0 10px;\">\r\n    Information security is today a <strong>critical success factor</strong>.<br>\r\n    Organizations face, among others, the following challenges:\r\n  </p>\r\n  <ul style=\"margin:0 0 10px; padding-left:20px;\">\r\n    <li>Increasing cyber threats</li>\r\n    <li>Growing regulatory requirements</li>\r\n    <li>Complex IT and supply chains</li>\r\n    <li>Dependence on digital processes</li>\r\n    <li>High requirements for evidence and compliance</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 18px;\">\r\n    An ISMS ensures that information security is <strong>not left to chance</strong>, but rather\r\n    <strong>planned, managed, and reviewed</strong>.\r\n  </p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    Core Principles of an ISMS\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">An ISMS is based on clear principles:</p>\r\n  <ul style=\"margin:0 0 18px; padding-left:20px;\">\r\n    <li><strong>Risk orientation</strong><br>Security measures are implemented where they are needed</li>\r\n    <li style=\"margin-top:8px;\"><strong>Accountability</strong><br>Roles and responsibilities are clearly defined</li>\r\n    <li style=\"margin-top:8px;\"><strong>Documentation &amp; traceability</strong><br>Decisions and implementations are documented in a traceable manner</li>\r\n    <li style=\"margin-top:8px;\"><strong>Continuous improvement</strong><br>Information security keeps evolving on an ongoing basis</li>\r\n  </ul>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    The ISMS Control Cycle (PDCA)\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">An ISMS follows a continuous improvement process, often represented as the PDCA cycle:</p>\r\n  <ul style=\"margin:0 0 10px; padding-left:20px;\">\r\n    <li><strong>Plan</strong><br>Define objectives, analyze risks, plan measures</li>\r\n    <li style=\"margin-top:8px;\"><strong>Do</strong><br>Implement measures, establish processes</li>\r\n    <li style=\"margin-top:8px;\"><strong>Check</strong><br>Review effectiveness, conduct audits, evaluate metrics</li>\r\n    <li style=\"margin-top:8px;\"><strong>Act</strong><br>Derive improvements, make adjustments</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 18px;\">This cycle ensures that the ISMS remains <strong>alive and up to date</strong>.</p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    Core Building Blocks of an ISMS\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">An ISMS consists of several interlinked areas:</p>\r\n  <ul style=\"margin:0 0 10px; padding-left:20px;\">\r\n    <li><strong>Documents &amp; policies</strong> – requirements and rule sets</li>\r\n    <li><strong>Assets</strong> – valuable assets of the organization worth protecting</li>\r\n    <li><strong>Risks</strong> – threats and vulnerabilities</li>\r\n    <li><strong>Measures</strong> – concrete protective and improvement measures</li>\r\n    <li><strong>Supplier management</strong> – managing external risks</li>\r\n    <li><strong>Personnel management</strong> – roles, training, and awareness</li>\r\n    <li><strong>Deadlines</strong> – due dates, reviews, and recurring tasks</li>\r\n    <li><strong>Audits</strong> – review and improvement</li>\r\n    <li><strong>Standards</strong> – external and internal requirements</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 18px;\">These building blocks interlock and together form the ISMS.</p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    Roles and Responsibility in the ISMS\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">An ISMS is a <strong>shared responsibility</strong>. Typical roles include:</p>\r\n  <ul style=\"margin:0 0 18px; padding-left:20px;\">\r\n    <li><strong>Management</strong><br>Accountability, setting objectives, approvals</li>\r\n    <li style=\"margin-top:8px;\"><strong>Information Security Officers (ISO / CISO)</strong><br>Steering, coordination, and further development of the ISMS</li>\r\n    <li style=\"margin-top:8px;\"><strong>Subject-matter and IT owners</strong><br>Implementation of measures within their areas</li>\r\n    <li style=\"margin-top:8px;\"><strong>Employees</strong><br>Compliance with security requirements in day-to-day work</li>\r\n  </ul>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    ISMS as Part of the Organization\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">An ISMS is <strong>not an isolated IT project</strong>, but rather:</p>\r\n  <ul style=\"margin:0 0 10px; padding-left:20px;\">\r\n    <li>Part of corporate governance</li>\r\n    <li>Supports business objectives</li>\r\n    <li>Integrates into existing processes</li>\r\n    <li>Grows together with the organization</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 6px;\">A well-implemented ISMS increases not only security, but also:</p>\r\n  <ul style=\"margin:0 0 18px; padding-left:20px;\">\r\n    <li>Stability,</li>\r\n    <li>Trust,</li>\r\n    <li>Professionalism.</li>\r\n  </ul>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    Role of This ISMS Portal\r\n  </div>\r\n  <p style=\"margin:0 0 6px;\">This ISMS portal serves as a <strong>central platform</strong> for:</p>\r\n  <ul style=\"margin:0 0 10px; padding-left:20px;\">\r\n    <li>Documenting all ISMS elements</li>\r\n    <li>Managing risks and measures</li>\r\n    <li>Meeting standards and audit requirements</li>\r\n    <li>Providing transparency for management and employees</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 18px;\">\r\n    The help pages support using the ISMS in a way that is <strong>understandable, consistent, and efficient</strong>.\r\n  </p>\r\n\r\n  <div style=\"background:#f0f4ff; border:1px solid #c7d4f5; border-left:4px solid #0078d4; border-radius:8px; padding:12px 16px; margin:0 0 4px;\">\r\n    <strong style=\"color:#0078d4;\">Recommended next steps for new users:</strong>\r\n    <ol style=\"margin:8px 0 0; padding-left:20px; font-size:0.9rem; color:#333;\">\r\n      <li>Get an overview of documents and policies</li>\r\n      <li>Review or record relevant assets</li>\r\n      <li>Understand and assess risks</li>\r\n      <li>Track measures and deadlines</li>\r\n      <li>Know your own role within the ISMS</li>\r\n    </ol>\r\n  </div>\r\n\r\n</div>');
INSERT INTO `ismshilfe` (`id`, `seite`, `name`, `Text`) VALUES
(19, 'kitext_de', 'KI-Nutzung', '<div class=\"ki-hinweis-card\" style=\"background:#fff; border:1px solid #d0dde8; border-radius:10px; padding:20px 24px; max-width:820px; margin:0 0 16px; border-top:4px solid #2E5F8A; font-family:Arial, Helvetica, sans-serif; color:#333; line-height:1.55;\">\r\n\r\n  <h2 style=\"color:#2E5F8A; font-size:1.25rem; margin:0 0 4px;\">🤖 Hinweis zur KI-Nutzung bei der Entwicklung von WolfISMS</h2>\r\n  <p style=\"font-size:0.82rem; color:#888; margin:0 0 18px;\">Transparenzhinweis gemäß EU KI-Verordnung (Verordnung (EU) 2024/1689)</p>\r\n\r\n  <p style=\"margin:0 0 16px;\">\r\n    Im Rahmen der Entwicklung und des Betriebs der Software WolfISMS wird KI in zwei unterschiedlichen Kontexten eingesetzt.\r\n    Zur Wahrung von Transparenz und Nachvollziehbarkeit wird hierzu Folgendes festgehalten:\r\n  </p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    1. KI-Nutzung während der Softwareentwicklung\r\n  </div>\r\n  <ul style=\"margin:0 0 10px; padding-left:20px;\">\r\n    <li>Die KI-Unterstützung erfolgte ausschließlich <strong>fragmentweise und anlassbezogen</strong>, d.&nbsp;h. es wurden einzelne, klar abgegrenzte Code-Abschnitte, Funktionen oder Teilprobleme zur Bearbeitung angefragt.</li>\r\n    <li>Es fand <strong>kein autonomes Coding</strong> statt. Die KI hatte zu keinem Zeitpunkt eigenständigen, unüberwachten Zugriff auf das Gesamtsystem, die Produktivumgebung oder die Codebasis als Ganzes.</li>\r\n    <li>Sämtliche Architektur-, Sicherheits- und Designentscheidungen wurden durch den Entwickler getroffen und verantwortet.</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 6px;\"><strong>Qualitätssicherung:</strong></p>\r\n  <p style=\"margin:0 0 18px;\">\r\n    Jeder von der KI vorgeschlagene oder mitgestaltete Code-Abschnitt wurde vor der Übernahme durch den Entwickler manuell geprüft und freigegeben.\r\n    Es erfolgen regelmäßige Sicherheitsüberprüfungen des Gesamtcodes (u.&nbsp;a. Review auf Schwachstellen, Prüfung von Abhängigkeiten,\r\n    Kontrolle sicherheitsrelevanter Funktionen wie Authentifizierung, Rechteverwaltung und Datenverarbeitung).\r\n    Die Verantwortung für Korrektheit, Sicherheit und Konformität des Endprodukts verbleibt vollständig beim menschlichen Entwickler.\r\n  </p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    2. KI-Funktion innerhalb des Produkts (Laufzeit-Nutzung durch Anwender)\r\n  </div>\r\n  <p style=\"margin:0 0 10px;\">\r\n    WolfISMS enthält zusätzlich ein <strong>optionales, standardmäßig deaktiviertes</strong> KI-Modul zur unterstützenden Überarbeitung von\r\n    Dokumententexten (z.&nbsp;B. Richtlinien im Kontext ISO 27001/NIS2). Dieses ist von der oben beschriebenen Entwicklungsunterstützung strikt\r\n    zu unterscheiden: Hier wird zur <strong>Laufzeit des Produkts</strong>, durch den <strong>Anwender selbst ausgelöst</strong>, ein externes\r\n    KI-Modell angebunden.\r\n  </p>\r\n  <ul style=\"margin:0 0 18px; padding-left:20px;\">\r\n    <li>Die Funktion muss durch die Administration aktiv eingeschaltet werden (Opt-in).</li>\r\n    <li>Auslösung erfolgt ausschließlich durch explizite Nutzeraktion; es gibt keinen automatisierten Hintergrundlauf.</li>\r\n    <li>Der Dokumententext wird an das konfigurierte externe KI-Modell übertragen; der Vorschlag wird erst nach expliziter Bestätigung durch den Nutzer übernommen.</li>\r\n    <li>Konfigurierbare Anbieter: Anthropic, Microsoft Azure OpenAI (Azure AI Foundry / Copilot-Deployments), sowie benutzerdefinierte/kompatible Endpunkte.</li>\r\n  </ul>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    3. Verantwortlichkeit bei Anbindung externer Modelle\r\n  </div>\r\n  <p style=\"margin:0 0 10px;\">\r\n    Die Anbindung externer KI-Modelle wirft eine <strong>geteilte Verantwortung</strong> zwischen Softwarehersteller (WolfISMS) und Betreiber\r\n    der Instanz auf. Diese lässt sich wie folgt abgrenzen:\r\n  </p>\r\n\r\n  <table style=\"width:100%; border-collapse:collapse; margin:0 0 18px; font-size:0.88rem;\">\r\n    <thead>\r\n      <tr style=\"background:#f5f8fb;\">\r\n        <th style=\"text-align:left; padding:8px 10px; border:1px solid #d0dde8; width:22%;\">Verantwortungsbereich</th>\r\n        <th style=\"text-align:left; padding:8px 10px; border:1px solid #d0dde8; width:15%;\">Zuständig</th>\r\n        <th style=\"text-align:left; padding:8px 10px; border:1px solid #d0dde8;\">Beschreibung</th>\r\n      </tr>\r\n    </thead>\r\n    <tbody>\r\n      <tr>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Bereitstellung der Schnittstelle</td>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">WolfISMS (Hersteller)</td>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Bereitstellung einer technisch sicheren Anbindungsmöglichkeit (Konfigurationsoberfläche, Speicherung der Zugangsdaten, Übertragungsmechanismus), Sicherstellung, dass die Funktion standardmäßig deaktiviert ist und ohne explizite Bestätigung nichts übernommen wird.</td>\r\n      </tr>\r\n      <tr>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Auswahl des Anbieters</td>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Betreiber (Kunde/Admin)</td>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Entscheidung, welcher externe KI-Anbieter genutzt wird; Prüfung von dessen AGB, Datenschutzbestimmungen und Sicherheitsniveau.</td>\r\n      </tr>\r\n      <tr>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Rechtsgrundlage der Datenübermittlung</td>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Betreiber</td>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Sicherstellung einer wirksamen Auftragsverarbeitungsvereinbarung (AVV) mit dem gewählten KI-Anbieter, insbesondere bei personenbezogenen Daten in den übertragenen Dokumenten; Prüfung von Drittlandtransfers (z.&nbsp;B. USA) und ggf. erforderlicher Garantien (SCCs).</td>\r\n      </tr>\r\n      <tr>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Inhaltliche Freigabe der KI-Ausgabe</td>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Anwender (Nutzer im System)</td>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Prüfung und explizite Bestätigung des von der KI vorgeschlagenen Textes vor Übernahme in das Managementsystem.</td>\r\n      </tr>\r\n      <tr>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Betrieb und Verhalten des KI-Modells selbst</td>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Externer KI-Anbieter</td>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Trainingsdaten, Modellverhalten, Verfügbarkeit, Sicherheit der eigenen Infrastruktur – liegt vollständig außerhalb des Einflussbereichs von WolfISMS.</td>\r\n      </tr>\r\n      <tr>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Klassifizierung als Hochrisiko-KI-System (falls einschlägig)</td>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Betreiber, ggf. in Abstimmung mit Anbieter</td>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">WolfISMS selbst stuft die Funktion als Unterstützungswerkzeug mit obligatorischer menschlicher Bestätigung ein (kein autonomer Entscheid). Der Betreiber bleibt jedoch verantwortlich für die eigene Einordnung im jeweiligen Einsatzkontext, insbesondere wenn Dokumente mit hoher Kritikalität verarbeitet werden.</td>\r\n      </tr>\r\n    </tbody>\r\n  </table>\r\n\r\n  <div style=\"background:#f0f4ff; border:1px solid #c7d4f5; border-left:4px solid #0078d4; border-radius:8px; padding:12px 16px; margin:0 0 14px;\">\r\n    <strong style=\"color:#0078d4;\">Kernaussage:</strong>\r\n    <span style=\"font-size:0.9rem; color:#333;\">\r\n      WolfISMS als Software stellt lediglich die technische Anbindung und die Sicherheitsvorkehrungen (Opt-in, Bestätigungspflicht,\r\n      maskierte Speicherung der Zugangsdaten) bereit. Die <strong>datenschutzrechtliche und vertragliche Verantwortung für die konkrete\r\n      Datenübermittlung an den gewählten externen KI-Anbieter liegt beim Betreiber der Instanz</strong>, nicht beim Softwarehersteller.\r\n      Der Softwarehersteller haftet nicht für das Verhalten, die Trainingsdaten oder die Sicherheit der Infrastruktur des vom Kunden\r\n      gewählten KI-Anbieters.\r\n    </span>\r\n  </div>\r\n\r\n  <p style=\"font-size:0.8rem; color:#888; margin:10px 0 0; border-top:1px solid #e0e8f0; padding-top:8px;\">\r\n    Stand: [Datum einfügen] &nbsp;·&nbsp; Verantwortlich: [Name/Funktion einfügen]\r\n  </p>\r\n\r\n</div>'),
(20, 'kitext_en', 'Use of AI', '<div class=\"ai-notice-card\" style=\"background:#fff; border:1px solid #d0dde8; border-radius:10px; padding:20px 24px; max-width:820px; margin:0 0 16px; border-top:4px solid #2E5F8A; font-family:Arial, Helvetica, sans-serif; color:#333; line-height:1.55;\">\r\n\r\n  <h2 style=\"color:#2E5F8A; font-size:1.25rem; margin:0 0 4px;\">🤖 Notice on the Use of AI in the Development of WolfISMS</h2>\r\n  <p style=\"font-size:0.82rem; color:#888; margin:0 0 18px;\">Transparency notice pursuant to the EU AI Act (Regulation (EU) 2024/1689)</p>\r\n\r\n  <p style=\"margin:0 0 16px;\">\r\n    AI is used in two distinct contexts in connection with the development and operation of the WolfISMS software.\r\n    In the interest of transparency and traceability, the following is documented:\r\n  </p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    1. Use of AI During Software Development\r\n  </div>\r\n  <ul style=\"margin:0 0 10px; padding-left:20px;\">\r\n    <li>AI assistance was used exclusively on a <strong>fragmentary, case-by-case basis</strong>, meaning individual, clearly scoped code sections, functions, or sub-problems were submitted for processing.</li>\r\n    <li><strong>No autonomous coding</strong> took place. At no point did the AI have independent, unsupervised access to the overall system, the production environment, or the codebase as a whole.</li>\r\n    <li>All architectural, security, and design decisions were made and remain the responsibility of the developer.</li>\r\n  </ul>\r\n  <p style=\"margin:0 0 6px;\"><strong>Quality assurance:</strong></p>\r\n  <p style=\"margin:0 0 18px;\">\r\n    Every code section suggested or co-authored by the AI was manually reviewed and approved by the developer before being adopted.\r\n    Regular security reviews of the overall codebase are carried out (including review for vulnerabilities, dependency checks,\r\n    and targeted review of security-relevant functions such as authentication, access control, and data processing).\r\n    Responsibility for the correctness, security, and compliance of the final product remains entirely with the human developer.\r\n  </p>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    2. AI Feature Within the Product (Runtime Use by Users)\r\n  </div>\r\n  <p style=\"margin:0 0 10px;\">\r\n    WolfISMS additionally includes an <strong>optional, disabled-by-default</strong> AI module for assisting with the revision of\r\n    document texts (e.g., policies in the context of ISO 27001/NIS2). This must be strictly distinguished from the development\r\n    support described above: here, an external AI model is connected <strong>at product runtime</strong>, triggered\r\n    <strong>by the user themselves</strong>.\r\n  </p>\r\n  <ul style=\"margin:0 0 18px; padding-left:20px;\">\r\n    <li>The feature must be actively enabled by the administration (opt-in).</li>\r\n    <li>It is triggered exclusively by an explicit user action; there is no automated background execution.</li>\r\n    <li>The document text is transmitted to the configured external AI model; the suggestion is only adopted after explicit confirmation by the user.</li>\r\n    <li>Configurable providers: Anthropic, Microsoft Azure OpenAI (Azure AI Foundry / Copilot deployments), as well as custom/compatible endpoints.</li>\r\n  </ul>\r\n\r\n  <div style=\"background:#eef2f7; border-left:4px solid #2E5F8A; padding:6px 12px; margin:18px 0 10px; font-weight:bold;\">\r\n    3. Responsibility When Connecting External Models\r\n  </div>\r\n  <p style=\"margin:0 0 10px;\">\r\n    Connecting external AI models results in a <strong>shared responsibility</strong> between the software manufacturer (WolfISMS)\r\n    and the operator of the instance. This can be broken down as follows:\r\n  </p>\r\n\r\n  <table style=\"width:100%; border-collapse:collapse; margin:0 0 18px; font-size:0.88rem;\">\r\n    <thead>\r\n      <tr style=\"background:#f5f8fb;\">\r\n        <th style=\"text-align:left; padding:8px 10px; border:1px solid #d0dde8; width:22%;\">Area of responsibility</th>\r\n        <th style=\"text-align:left; padding:8px 10px; border:1px solid #d0dde8; width:15%;\">Responsible party</th>\r\n        <th style=\"text-align:left; padding:8px 10px; border:1px solid #d0dde8;\">Description</th>\r\n      </tr>\r\n    </thead>\r\n    <tbody>\r\n      <tr>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Provision of the interface</td>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">WolfISMS (manufacturer)</td>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Provision of a technically secure connection mechanism (configuration interface, storage of credentials, transmission mechanism), ensuring the feature is disabled by default and that nothing is adopted without explicit confirmation.</td>\r\n      </tr>\r\n      <tr>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Choice of provider</td>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Operator (customer/admin)</td>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Decision on which external AI provider is used; review of that provider\'s terms of service, data protection provisions, and security posture.</td>\r\n      </tr>\r\n      <tr>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Legal basis for the data transfer</td>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Operator</td>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Ensuring a valid data processing agreement (DPA) with the chosen AI provider, particularly where personal data is contained in the transmitted documents; review of third-country transfers (e.g., to the USA) and any required safeguards (SCCs).</td>\r\n      </tr>\r\n      <tr>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Substantive approval of the AI output</td>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">User (person using the system)</td>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Review and explicit confirmation of the text suggested by the AI before it is adopted into the management system.</td>\r\n      </tr>\r\n      <tr>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Operation and behavior of the AI model itself</td>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">External AI provider</td>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Training data, model behavior, availability, and security of its own infrastructure — entirely outside WolfISMS\'s sphere of influence.</td>\r\n      </tr>\r\n      <tr>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Classification as a high-risk AI system (if applicable)</td>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">Operator, if applicable in coordination with the provider</td>\r\n        <td style=\"padding:8px 10px; border:1px solid #d0dde8;\">WolfISMS itself classifies the feature as a supporting tool with mandatory human confirmation (no autonomous decision-making). However, the operator remains responsible for its own classification in the respective context of use, particularly when documents of high criticality are processed.</td>\r\n      </tr>\r\n    </tbody>\r\n  </table>\r\n\r\n  <div style=\"background:#f0f4ff; border:1px solid #c7d4f5; border-left:4px solid #0078d4; border-radius:8px; padding:12px 16px; margin:0 0 14px;\">\r\n    <strong style=\"color:#0078d4;\">Key statement:</strong>\r\n    <span style=\"font-size:0.9rem; color:#333;\">\r\n      WolfISMS as a software product only provides the technical connection and the associated safeguards (opt-in, confirmation\r\n      requirement, masked storage of credentials). The <strong>data protection and contractual responsibility for the actual\r\n      transmission of data to the chosen external AI provider lies with the operator of the instance</strong>, not with the software\r\n      manufacturer. The software manufacturer is not liable for the behavior, training data, or infrastructure security of the\r\n      AI provider selected by the customer.\r\n    </span>\r\n  </div>\r\n\r\n  <p style=\"font-size:0.8rem; color:#888; margin:10px 0 0; border-top:1px solid #e0e8f0; padding-top:8px;\">\r\n    Version date: [insert date] &nbsp;·&nbsp; Responsible: [insert name/role]\r\n  </p>\r\n\r\n</div>');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `isms_kontext`
--

CREATE TABLE `isms_kontext` (
  `schluessel` varchar(60) NOT NULL COMMENT 'Feldschluessel aus setup_leitfaden.py',
  `wert` mediumtext NOT NULL COMMENT 'Wert als JSON',
  `benutzer` varchar(255) NOT NULL DEFAULT '',
  `geaendert` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `isms_module`
--

CREATE TABLE `isms_module` (
  `modul` varchar(32) NOT NULL,
  `aktiv` tinyint(1) NOT NULL DEFAULT 1,
  `sortierung` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

--
-- Daten für Tabelle `isms_module`
--

INSERT INTO `isms_module` (`modul`, `aktiv`, `sortierung`) VALUES
('assets', 1, 30),
('audit', 1, 180),
('aufgaben', 1, 170),
('bcm', 1, 250),
('change', 1, 50),
('custom', 1, 270),
('dokumente', 1, 20),
('incidents', 1, 200),
('kontakte', 1, 90),
('massnahmen', 1, 150),
('mreview', 1, 190),
('netzwerkzonen', 1, 120),
('normen', 1, 220),
('op_plan', 1, 160),
('organigramm', 1, 100),
('personal', 1, 80),
('plaene', 1, 130),
('playbooks', 1, 240),
('portal', 1, 10),
('projekte', 1, 140),
('prozesslandkarte', 1, 110),
('rechtsregister', 1, 230),
('risiko', 1, 60),
('schwachstellen', 1, 210),
('vendor', 1, 70),
('ziele', 1, 260),
('zugriff', 1, 40);

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `isms_settings`
--

CREATE TABLE `isms_settings` (
  `key` varchar(64) NOT NULL,
  `value` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `isms_settings`
--

INSERT INTO `isms_settings` (`key`, `value`) VALUES
('bcm_verantwortlich_user_migriert', '1'),
('dok_besitzer_user_migriert', '1'),
('dok_typ_prozesse_migriert', '1'),
('dok_versionierung_migriert', '1'),
('ki_api_base_url', ''),
('ki_api_key', ''),
('ki_api_version', ''),
('ki_azure_auth', ''),
('ki_copilot_deployment', ''),
('ki_enabled', '1'),
('ki_entra_client_id', ''),
('ki_entra_tenant', ''),
('ki_model', 'claude-opus-5-5'),
('ki_preise', '{\"claude-fable-5\": [10.0, 50.0], \"claude-haiku-4-5\": [1.0, 5.0], \"claude-mythos-5\": [10.0, 50.0], \"claude-opus-4-5\": [5.0, 25.0], \"claude-opus-4-6\": [5.0, 25.0], \"claude-opus-4-7\": [5.0, 25.0], \"claude-opus-4-8\": [5.0, 25.0], \"claude-sonnet-4-6\": [3.0, 15.0], \"claude-sonnet-5\": [2.0, 10.0], \"gemini-2.0-flash\": [0.1, 0.4], \"gemini-2.5-flash\": [0.3, 2.5], \"gemini-2.5-flash-lite\": [0.1, 0.4], \"gemini-2.5-pro\": [1.25, 10.0], \"magistral-medium\": [2.0, 5.0], \"magistral-small\": [0.5, 1.5], \"ministral-8b\": [0.1, 0.1], \"mistral-large\": [2.0, 6.0], \"mistral-medium\": [0.4, 2.0], \"mistral-small\": [0.1, 0.3], \"open-mistral-nemo\": [0.15, 0.15]}'),
('ki_prompt_addendum', ''),
('ki_provider', 'anthropic'),
('ki_waehrung', 'EUR'),
('ki_zusatz_assets', ''),
('ki_zusatz_audit', ''),
('ki_zusatz_dokumente', ''),
('ki_zusatz_dokumente_link', ''),
('ki_zusatz_dokumente_uebersetzung', ''),
('ki_zusatz_incidents', ''),
('ki_zusatz_risiken', ''),
('ki_zusatz_schutzbedarf', ''),
('ki_zusatz_schwachstellen', ''),
('ki_zusatz_setup', ''),
('modus_u18', 'hell'),
('modus_u29', 'hell'),
('pdf_briefpapier_dir', '/var/www/isms/uploads/briefpapier'),
('pdf_briefpapier_margin_bottom', '2.5'),
('pdf_briefpapier_margin_left', '2.5'),
('pdf_briefpapier_margin_right', '2.5'),
('pdf_briefpapier_margin_top', '5'),
('pdf_briefpapier_path', ''),
('theme_akzent', '0'),
('theme_grau', '5'),
('theme_hue', '235'),
('theme_kontrast', '10'),
('theme_kopf_bg', '#42717b'),
('theme_menu_bg', '#11181f'),
('theme_name', 'petrol'),
('theme_sat', '40'),
('theme_sat_max', '55'),
('theme_spread', '26'),
('tooltips_aktiv', '1'),
('totp_required', '0');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `ki_dialog`
--

CREATE TABLE `ki_dialog` (
  `bereich` varchar(40) NOT NULL COMMENT 'Assistent, z. B. asset (siehe ki_dialog_bausteine.py)',
  `benutzer` varchar(64) NOT NULL COMMENT 'users.id',
  `daten` mediumtext NOT NULL COMMENT 'Dialogstand als JSON: Aufgabe, Vorschläge, Verlauf',
  `geaendert` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `ki_jobs`
--

CREATE TABLE `ki_jobs` (
  `id` varchar(36) NOT NULL,
  `bereich` varchar(40) NOT NULL DEFAULT '',
  `nutzer` varchar(64) NOT NULL DEFAULT '',
  `status` varchar(10) NOT NULL DEFAULT 'laeuft',
  `ergebnis` mediumtext DEFAULT NULL,
  `angelegt` datetime NOT NULL,
  `geaendert` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `ki_prompts`
--

CREATE TABLE `ki_prompts` (
  `schluessel` varchar(64) NOT NULL,
  `text` mediumtext DEFAULT NULL,
  `geaendert` datetime DEFAULT NULL,
  `geaendert_von` varchar(64) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `ki_verbrauch`
--

CREATE TABLE `ki_verbrauch` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `zeitpunkt` datetime NOT NULL,
  `nutzer` varchar(64) NOT NULL DEFAULT '',
  `bereich` varchar(40) NOT NULL DEFAULT '',
  `provider` varchar(20) NOT NULL DEFAULT '',
  `modell` varchar(80) NOT NULL DEFAULT '',
  `tok_ein` int(10) UNSIGNED NOT NULL DEFAULT 0,
  `tok_aus` int(10) UNSIGNED NOT NULL DEFAULT 0,
  `tok_c_neu` int(10) UNSIGNED NOT NULL DEFAULT 0,
  `tok_c_les` int(10) UNSIGNED NOT NULL DEFAULT 0,
  `anfragen` smallint(5) UNSIGNED NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `klassifizierung`
--

CREATE TABLE `klassifizierung` (
  `id` int(10) UNSIGNED NOT NULL,
  `klassifizierung` varchar(256) NOT NULL,
  `klassifizierung_en` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `klassifizierung`
--

INSERT INTO `klassifizierung` (`id`, `klassifizierung`, `klassifizierung_en`) VALUES
(1, 'öffentlich', 'public'),
(2, 'intern', 'internal'),
(3, 'vertraulich', 'confidential'),
(4, 'streng vertraulich', 'high confidential');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `klassifizierung_en`
--

CREATE TABLE `klassifizierung_en` (
  `id` int(10) UNSIGNED NOT NULL,
  `klassifizierung` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `klassifizierung_en`
--

INSERT INTO `klassifizierung_en` (`id`, `klassifizierung`) VALUES
(1, 'public'),
(2, 'internal'),
(3, 'confidential'),
(4, 'high confidential');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `kommentare`
--

CREATE TABLE `kommentare` (
  `id` int(11) NOT NULL,
  `bereich` varchar(20) NOT NULL,
  `objekt_id` int(11) NOT NULL,
  `parent_id` int(11) DEFAULT NULL,
  `text` text NOT NULL,
  `ersteller` varchar(20) NOT NULL,
  `erstellt` datetime NOT NULL,
  `geaendert` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `kontakte_behoerden`
--

CREATE TABLE `kontakte_behoerden` (
  `id` int(11) NOT NULL,
  `behoerde` varchar(200) NOT NULL,
  `ansprechpartner` varchar(150) DEFAULT NULL,
  `telefon` varchar(60) DEFAULT NULL,
  `email` varchar(200) DEFAULT NULL,
  `website` varchar(300) DEFAULT NULL,
  `zustaendigkeit` varchar(200) DEFAULT NULL,
  `bemerkung` text DEFAULT NULL,
  `ersteller` int(11) DEFAULT NULL,
  `erstellt` date DEFAULT NULL,
  `aenderer` int(11) DEFAULT NULL,
  `geaendert` date DEFAULT NULL,
  `bemerkung_en` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `kontakte_dienstleister`
--

CREATE TABLE `kontakte_dienstleister` (
  `id` int(11) NOT NULL,
  `firma` varchar(200) NOT NULL,
  `ansprechpartner` varchar(150) DEFAULT NULL,
  `position` varchar(150) DEFAULT NULL,
  `telefon` varchar(60) DEFAULT NULL,
  `mobil` varchar(60) DEFAULT NULL,
  `email` varchar(200) DEFAULT NULL,
  `website` varchar(300) DEFAULT NULL,
  `kategorie` varchar(100) DEFAULT NULL,
  `bemerkung` text DEFAULT NULL,
  `ersteller` int(11) DEFAULT NULL,
  `erstellt` date DEFAULT NULL,
  `aenderer` int(11) DEFAULT NULL,
  `geaendert` date DEFAULT NULL,
  `bemerkung_en` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `kontakte_interessensgruppen`
--

CREATE TABLE `kontakte_interessensgruppen` (
  `id` int(11) NOT NULL,
  `name` varchar(200) NOT NULL,
  `ansprechpartner` varchar(150) DEFAULT NULL,
  `typ` varchar(100) DEFAULT NULL,
  `telefon` varchar(60) DEFAULT NULL,
  `email` varchar(200) DEFAULT NULL,
  `website` varchar(300) DEFAULT NULL,
  `relevanz` varchar(100) DEFAULT NULL,
  `bemerkung` text DEFAULT NULL,
  `ersteller` int(11) DEFAULT NULL,
  `erstellt` date DEFAULT NULL,
  `aenderer` int(11) DEFAULT NULL,
  `geaendert` date DEFAULT NULL,
  `bemerkung_en` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `kontakte_kunden`
--

CREATE TABLE `kontakte_kunden` (
  `id` int(11) NOT NULL,
  `kundenname` varchar(200) NOT NULL,
  `kundennr` varchar(60) DEFAULT NULL,
  `ansprechpartner` varchar(150) DEFAULT NULL,
  `meldeadresse` varchar(300) DEFAULT NULL,
  `bemerkung` text DEFAULT NULL,
  `ersteller` int(11) DEFAULT NULL,
  `erstellt` date DEFAULT NULL,
  `aenderer` int(11) DEFAULT NULL,
  `geaendert` date DEFAULT NULL,
  `bemerkung_en` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `kontakte_mitarbeiter`
--

CREATE TABLE `kontakte_mitarbeiter` (
  `id` int(11) NOT NULL,
  `vorname` varchar(100) DEFAULT NULL,
  `nachname` varchar(100) NOT NULL,
  `abteilung` varchar(100) DEFAULT NULL,
  `position` varchar(150) DEFAULT NULL,
  `telefon` varchar(60) DEFAULT NULL,
  `mobil` varchar(60) DEFAULT NULL,
  `email` varchar(200) DEFAULT NULL,
  `standort` varchar(150) DEFAULT NULL,
  `bemerkung` text DEFAULT NULL,
  `ersteller` int(11) DEFAULT NULL,
  `erstellt` date DEFAULT NULL,
  `aenderer` int(11) DEFAULT NULL,
  `geaendert` date DEFAULT NULL,
  `bemerkung_en` text DEFAULT NULL,
  `abteilung_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `kritikalität`
--

CREATE TABLE `kritikalität` (
  `id` int(10) UNSIGNED NOT NULL,
  `kritikalität` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `kritikalität`
--

INSERT INTO `kritikalität` (`id`, `kritikalität`) VALUES
(1, 'niedrig'),
(2, 'normal'),
(3, 'hoch'),
(4, 'kritisch');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `Links`
--

CREATE TABLE `Links` (
  `id` int(10) UNSIGNED NOT NULL,
  `bereich_id` int(10) UNSIGNED DEFAULT NULL,
  `bereich` varchar(256) DEFAULT NULL,
  `link` varchar(512) DEFAULT NULL,
  `bezeichnung` varchar(256) DEFAULT NULL,
  `ersteller` int(10) UNSIGNED NOT NULL,
  `datum` date NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `Massnahmen`
--

CREATE TABLE `Massnahmen` (
  `id` int(10) UNSIGNED NOT NULL,
  `Nummer` varchar(64) DEFAULT NULL,
  `Name` varchar(128) DEFAULT NULL,
  `Besitzer` int(10) UNSIGNED NOT NULL DEFAULT 0,
  `Abteilung` varchar(128) DEFAULT NULL,
  `status` varchar(64) DEFAULT NULL,
  `Enddatum` date NOT NULL DEFAULT current_timestamp(),
  `text` mediumtext DEFAULT NULL,
  `Ersteller` int(10) UNSIGNED NOT NULL,
  `Erstelldatum` date NOT NULL DEFAULT current_timestamp(),
  `Aenderer` int(10) UNSIGNED DEFAULT NULL,
  `Aenderungsdatum` date NOT NULL DEFAULT current_timestamp(),
  `Reviewer` int(10) UNSIGNED DEFAULT NULL,
  `review` date NOT NULL DEFAULT current_timestamp(),
  `archiviert` tinyint(1) NOT NULL DEFAULT 0,
  `erledigt` int(11) NOT NULL DEFAULT 0,
  `interner_aufwand` decimal(10,2) DEFAULT NULL COMMENT 'Interner Aufwand in Manntagen (MT), z.B. 1.5',
  `kosten` decimal(12,2) DEFAULT NULL COMMENT 'Kosten in EUR, z.B. 1000.00',
  `prioritaet` varchar(20) DEFAULT NULL COMMENT 'Priorität: niedrig, mittel, hoch, sehr hoch',
  `Name_en` text DEFAULT NULL,
  `text_en` text DEFAULT NULL,
  `abteilung_id` int(11) DEFAULT NULL,
  `Ticketnummer` text DEFAULT NULL,
  `sync` tinyint(1) DEFAULT NULL,
  `synctime` datetime DEFAULT NULL,
  `dokumente` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `mass_anhaenge`
--

CREATE TABLE `mass_anhaenge` (
  `id` int(11) NOT NULL,
  `mass_id` int(11) NOT NULL,
  `original_name` varchar(255) NOT NULL,
  `stored_name` varchar(255) NOT NULL,
  `rel_path` varchar(255) NOT NULL,
  `mime_type` varchar(100) NOT NULL,
  `file_size` int(11) NOT NULL,
  `beschreibung` varchar(255) DEFAULT NULL,
  `ersteller` int(11) DEFAULT NULL,
  `erstellt` date NOT NULL,
  `aenderer` int(11) DEFAULT NULL,
  `geaendert` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `mgmt_review`
--

CREATE TABLE `mgmt_review` (
  `id` int(10) UNSIGNED NOT NULL,
  `titel` varchar(255) DEFAULT NULL,
  `von_datum` date DEFAULT NULL,
  `bis_datum` date DEFAULT NULL,
  `status_frueherer_massnahmen` mediumtext DEFAULT NULL,
  `aenderungen_themen` mediumtext DEFAULT NULL,
  `aenderungen_parteien` mediumtext DEFAULT NULL,
  `nichtkonformitaeten` mediumtext DEFAULT NULL,
  `ueberwachung_messung` mediumtext DEFAULT NULL,
  `interne_audits` mediumtext DEFAULT NULL,
  `rueckmeldungen_parteien` mediumtext DEFAULT NULL,
  `chancen_verbesserung` mediumtext DEFAULT NULL,
  `ersteller` int(10) UNSIGNED DEFAULT NULL,
  `erstellt_am` datetime NOT NULL DEFAULT current_timestamp(),
  `aenderer` int(10) UNSIGNED DEFAULT NULL,
  `geaendert_am` datetime DEFAULT NULL ON UPDATE current_timestamp(),
  `aenderungen_geschaeftsfelder` mediumtext DEFAULT NULL,
  `massnahmen` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `netzwerkzonen`
--

CREATE TABLE `netzwerkzonen` (
  `id` int(11) NOT NULL,
  `name` varchar(150) NOT NULL,
  `kategorie` varchar(20) NOT NULL DEFAULT 'intern',
  `parent_id` int(11) DEFAULT NULL,
  `verantwortlich_id` int(11) DEFAULT NULL,
  `abteilung_id` int(11) DEFAULT NULL,
  `dokument_id` int(11) DEFAULT NULL,
  `vlan` varchar(40) DEFAULT NULL,
  `ip_bereich` varchar(120) DEFAULT NULL,
  `schutzbedarf` varchar(20) NOT NULL DEFAULT 'normal',
  `beschreibung` text DEFAULT NULL,
  `sortierung` int(11) NOT NULL DEFAULT 0,
  `farbe` varchar(7) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `Normen`
--

CREATE TABLE `Normen` (
  `id` int(11) UNSIGNED NOT NULL,
  `Norm` varchar(256) NOT NULL,
  `Kapitel` varchar(256) DEFAULT NULL,
  `Nummer` varchar(24) DEFAULT NULL,
  `Titel` varchar(256) DEFAULT NULL,
  `Beschreibung` text DEFAULT NULL,
  `status` varchar(64) DEFAULT NULL,
  `anwendbar` tinyint(1) DEFAULT NULL,
  `Grund` text DEFAULT NULL,
  `Reviewer` int(10) UNSIGNED DEFAULT NULL,
  `review` date DEFAULT current_timestamp(),
  `Besitzer` int(10) UNSIGNED DEFAULT NULL,
  `dokumente` varchar(256) DEFAULT NULL,
  `massnahmen` varchar(256) DEFAULT NULL,
  `Änderer` int(10) UNSIGNED DEFAULT NULL,
  `geändert` date DEFAULT current_timestamp(),
  `Umsetzung` text DEFAULT NULL,
  `verwandte_normen` text DEFAULT NULL,
  `gelöscht` tinyint(1) NOT NULL DEFAULT 0,
  `Grund_en` text DEFAULT NULL,
  `Umsetzung_en` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `norm_status`
--

CREATE TABLE `norm_status` (
  `id` int(10) UNSIGNED NOT NULL,
  `status` varchar(64) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `norm_status`
--

INSERT INTO `norm_status` (`id`, `status`) VALUES
(1, 'unbearbeitet'),
(2, 'nicht implementiert'),
(3, 'teilweise implementiert'),
(4, 'implementiert'),
(5, 'alternative Umsetzung'),
(6, 'in Bearbeitung'),
(7, 'nicht anwendbar');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `objekt_besitzer`
--

CREATE TABLE `objekt_besitzer` (
  `tabelle` varchar(64) NOT NULL,
  `objekt_id` int(10) UNSIGNED NOT NULL,
  `user_id` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `op_plan`
--

CREATE TABLE `op_plan` (
  `id` int(10) UNSIGNED NOT NULL,
  `kette_id` int(10) UNSIGNED NOT NULL,
  `aufgabe` text NOT NULL,
  `wer` int(10) UNSIGNED NOT NULL,
  `naechstes_datum` date NOT NULL,
  `frequenz_tage` smallint(5) UNSIGNED NOT NULL DEFAULT 30,
  `status` varchar(20) NOT NULL DEFAULT 'offen',
  `erledigt_am` date DEFAULT NULL,
  `erledigt_von` int(10) UNSIGNED DEFAULT NULL,
  `notiz` text DEFAULT NULL,
  `ist_aktuell` tinyint(1) NOT NULL DEFAULT 1,
  `ersteller` int(10) UNSIGNED NOT NULL,
  `erstellt_am` datetime NOT NULL DEFAULT current_timestamp(),
  `geaendert_am` datetime DEFAULT NULL ON UPDATE current_timestamp(),
  `link` varchar(500) DEFAULT NULL,
  `aufgabe_en` text DEFAULT NULL,
  `notiz_en` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `Personal`
--

CREATE TABLE `Personal` (
  `id` int(11) UNSIGNED NOT NULL,
  `Personalnummer` varchar(64) NOT NULL,
  `Vorname` varchar(64) NOT NULL,
  `Nachname` varchar(64) NOT NULL,
  `Geburtsdatum` date NOT NULL,
  `Eintrittsdatum` date NOT NULL,
  `Austrittsdatum` date NOT NULL,
  `Abteilung` varchar(64) NOT NULL,
  `Rollen` varchar(256) NOT NULL,
  `Ersteller` int(11) UNSIGNED NOT NULL,
  `Datum` date NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `pers_onboarding`
--

CREATE TABLE `pers_onboarding` (
  `id` int(10) UNSIGNED NOT NULL,
  `art` varchar(3) NOT NULL DEFAULT 'on',
  `vorname` varchar(80) NOT NULL DEFAULT '',
  `nachname` varchar(80) NOT NULL DEFAULT '',
  `email` varchar(255) DEFAULT NULL,
  `firmenemail` varchar(255) DEFAULT NULL,
  `abteilung` varchar(80) DEFAULT NULL,
  `abteilung_id` int(11) DEFAULT NULL,
  `aufgabe` varchar(255) DEFAULT NULL,
  `datum` date DEFAULT NULL,
  `user_id` int(11) DEFAULT NULL,
  `s_vertrag` tinyint(1) NOT NULL DEFAULT 0,
  `s_mail` tinyint(1) NOT NULL DEFAULT 0,
  `s_isms` tinyint(1) NOT NULL DEFAULT 0,
  `bemerkung` text DEFAULT NULL,
  `abgeschlossen` tinyint(1) NOT NULL DEFAULT 0,
  `ersteller` int(10) UNSIGNED DEFAULT NULL,
  `erstellt_am` datetime NOT NULL DEFAULT current_timestamp(),
  `aenderer` int(10) UNSIGNED DEFAULT NULL,
  `geaendert_am` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `pers_onb_equipment`
--

CREATE TABLE `pers_onb_equipment` (
  `id` int(10) UNSIGNED NOT NULL,
  `vorgang_id` int(10) UNSIGNED NOT NULL,
  `bezeichnung` varchar(160) NOT NULL,
  `benutzername` varchar(160) DEFAULT NULL,
  `erledigt` tinyint(1) NOT NULL DEFAULT 0,
  `erledigt_am` date DEFAULT NULL,
  `bemerkung` varchar(255) DEFAULT NULL,
  `sortierung` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `pers_onb_zugaenge`
--

CREATE TABLE `pers_onb_zugaenge` (
  `id` int(10) UNSIGNED NOT NULL,
  `vorgang_id` int(10) UNSIGNED NOT NULL,
  `bezeichnung` varchar(160) NOT NULL,
  `benutzername` varchar(160) DEFAULT NULL,
  `erledigt` tinyint(1) NOT NULL DEFAULT 0,
  `erledigt_am` date DEFAULT NULL,
  `bemerkung` varchar(255) DEFAULT NULL,
  `sortierung` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `pers_schulungen`
--

CREATE TABLE `pers_schulungen` (
  `id` int(10) UNSIGNED NOT NULL,
  `titel` varchar(200) NOT NULL DEFAULT '',
  `datum` date DEFAULT NULL,
  `ort` varchar(160) DEFAULT NULL,
  `referent` varchar(160) DEFAULT NULL,
  `beschreibung` text DEFAULT NULL,
  `ersteller` int(10) UNSIGNED DEFAULT NULL,
  `erstellt_am` datetime NOT NULL DEFAULT current_timestamp(),
  `aenderer` int(10) UNSIGNED DEFAULT NULL,
  `geaendert_am` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `pers_schulung_teilnehmer`
--

CREATE TABLE `pers_schulung_teilnehmer` (
  `id` int(10) UNSIGNED NOT NULL,
  `schulung_id` int(10) UNSIGNED NOT NULL,
  `user_id` int(11) NOT NULL,
  `besucht` tinyint(1) NOT NULL DEFAULT 0,
  `besucht_am` date DEFAULT NULL,
  `zugewiesen_am` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `plaene_dateien`
--

CREATE TABLE `plaene_dateien` (
  `id` int(11) NOT NULL,
  `art` varchar(20) NOT NULL,
  `titel` varchar(150) NOT NULL,
  `beschreibung` text DEFAULT NULL,
  `version` varchar(40) DEFAULT NULL,
  `stand` date DEFAULT NULL,
  `original_name` varchar(255) NOT NULL,
  `stored_name` varchar(255) NOT NULL,
  `rel_path` varchar(255) NOT NULL,
  `mime_type` varchar(120) NOT NULL,
  `file_size` bigint(20) NOT NULL DEFAULT 0,
  `importiert_am` datetime DEFAULT NULL,
  `ersteller` int(11) DEFAULT NULL,
  `erstellt` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `playbooks`
--

CREATE TABLE `playbooks` (
  `id` int(11) NOT NULL,
  `original_name` varchar(255) NOT NULL,
  `stored_name` varchar(255) NOT NULL,
  `rel_path` varchar(255) NOT NULL,
  `mime_type` varchar(100) NOT NULL,
  `file_size` int(11) NOT NULL,
  `beschreibung` varchar(255) DEFAULT NULL,
  `ersteller` int(11) DEFAULT NULL,
  `erstellt` date NOT NULL,
  `aenderer` int(11) DEFAULT NULL,
  `geaendert` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `Projekte`
--

CREATE TABLE `Projekte` (
  `id` int(10) UNSIGNED NOT NULL,
  `Nummer` varchar(64) DEFAULT NULL,
  `Name` varchar(128) DEFAULT NULL,
  `Besitzer` int(10) UNSIGNED NOT NULL DEFAULT 0,
  `status` varchar(64) DEFAULT NULL,
  `Startdatum` date NOT NULL DEFAULT current_timestamp(),
  `Enddatum` date NOT NULL DEFAULT current_timestamp(),
  `Bezeichnung` mediumtext DEFAULT NULL,
  `Ersteller` int(10) UNSIGNED NOT NULL,
  `Erstelldatum` date NOT NULL DEFAULT current_timestamp(),
  `Aenderer` int(10) UNSIGNED DEFAULT NULL,
  `Aenderungsdatum` date NOT NULL DEFAULT current_timestamp(),
  `archiviert` tinyint(1) NOT NULL DEFAULT 0,
  `erledigt` int(11) NOT NULL DEFAULT 0,
  `massnahmen` varchar(4096) NOT NULL,
  `Name_en` text DEFAULT NULL,
  `Bezeichnung_en` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `prozesslandkarte`
--

CREATE TABLE `prozesslandkarte` (
  `id` int(11) NOT NULL,
  `name` varchar(150) NOT NULL,
  `kategorie` varchar(20) NOT NULL DEFAULT 'kern',
  `parent_id` int(11) DEFAULT NULL,
  `verantwortlich_id` int(11) DEFAULT NULL,
  `abteilung_id` int(11) DEFAULT NULL,
  `dokument_id` int(11) DEFAULT NULL,
  `beschreibung` text DEFAULT NULL,
  `sortierung` int(11) NOT NULL DEFAULT 0,
  `farbe` varchar(7) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `pw_reset_tokens`
--

CREATE TABLE `pw_reset_tokens` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `token` varchar(64) NOT NULL,
  `erstellt` datetime NOT NULL,
  `ablauf` datetime NOT NULL,
  `verwendet` tinyint(1) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `rechtsregister`
--

CREATE TABLE `rechtsregister` (
  `id` int(11) NOT NULL,
  `nummer` varchar(20) NOT NULL DEFAULT '',
  `rechtsgrundlage` varchar(255) NOT NULL DEFAULT '',
  `kuerzel` varchar(50) NOT NULL DEFAULT '',
  `kategorie` varchar(100) NOT NULL DEFAULT '',
  `themenbereich` varchar(100) NOT NULL DEFAULT '',
  `anforderung` text NOT NULL,
  `relevanz` text DEFAULT NULL,
  `bereiche` varchar(255) DEFAULT NULL,
  `verantwortlicher` varchar(255) DEFAULT NULL,
  `massnahme` text DEFAULT NULL,
  `dokumentenreferenz` varchar(255) DEFAULT NULL,
  `status` varchar(50) NOT NULL DEFAULT 'Zu prüfen',
  `faelligkeit` varchar(50) DEFAULT NULL,
  `letzte_pruefung` date DEFAULT NULL,
  `anmerkungen` text DEFAULT NULL,
  `ersteller` int(11) DEFAULT NULL,
  `erstellt` date DEFAULT NULL,
  `aenderer` int(11) DEFAULT NULL,
  `geaendert` date DEFAULT NULL,
  `anforderung_en` text DEFAULT NULL,
  `relevanz_en` text DEFAULT NULL,
  `massnahme_en` text DEFAULT NULL,
  `anmerkungen_en` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Daten für Tabelle `rechtsregister`
--

INSERT INTO `rechtsregister` (`id`, `nummer`, `rechtsgrundlage`, `kuerzel`, `kategorie`, `themenbereich`, `anforderung`, `relevanz`, `bereiche`, `verantwortlicher`, `massnahme`, `dokumentenreferenz`, `status`, `faelligkeit`, `letzte_pruefung`, `anmerkungen`, `ersteller`, `erstellt`, `aenderer`, `geaendert`, `anforderung_en`, `relevanz_en`, `massnahme_en`, `anmerkungen_en`) VALUES
(1, '1.1', 'Datenschutz-Grundverordnung (EU) 2016/679', 'DSGVO', 'Datenschutz', 'Grundsätze', 'Art. 5: Verarbeitung personenbezogener Daten nach den Grundsätzen Rechtmäßigkeit, Zweckbindung, Datenminimierung, Richtigkeit, Speicherbegrenzung, Integrität & Vertraulichkeit', 'Verarbeitung von Kunden-, Lieferanten- und Mitarbeiterdaten', 'Alle Abteilungen', 'Datenschutzbeauftragter (DSB)', 'Datenschutzrichtlinie, Verzeichnis von Verarbeitungstätigkeiten (VVT)', 'DSB-POL-001', 'Konform', '31.12.2025', '2026-03-10', '', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(2, '1.2', 'Datenschutz-Grundverordnung (EU) 2016/679', 'DSGVO', 'Datenschutz', 'Verzeichnis der Verarbeitungstätigkeiten', 'Art. 30: Führung eines Verzeichnisses aller Verarbeitungstätigkeiten (VVT) durch Verantwortlichen und Auftragsverarbeiter', 'Pflicht für Unternehmen >250 MA oder bei risikoreicher Verarbeitung', 'IT, HR, Vertrieb, Einkauf', 'DSB', 'VVT erstellen und aktuell halten; mind. jährlich überprüfen', 'DSB-VVT-001', 'Konform', '31.12.2025', '2026-03-10', 'VVT liegt vor', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(3, '1.3', 'Datenschutz-Grundverordnung (EU) 2016/679', 'DSGVO', 'Datenschutz', 'Betroffenenrechte', 'Art. 12-23: Informationspflicht, Auskunftsrecht, Recht auf Löschung, Widerspruchsrecht, Datenportabilität – Frist 1 Monat', 'Anfragen von Mitarbeitern, Kunden, Bewerbern', 'HR, Vertrieb, IT', 'DSB', 'Prozess für Betroffenenanfragen, Schulung Mitarbeiter', 'DSB-PROC-002', 'In Umsetzung', '30.06.2025', '2026-03-10', 'Prozessvorlage in Erstellung', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(4, '1.4', 'Datenschutz-Grundverordnung (EU) 2016/679', 'DSGVO', 'Datenschutz', 'Datenschutz-Folgenabschätzung', 'Art. 35: DSFA bei voraussichtlich hohem Risiko (z.B. Videoüberwachung, umfangreiche Mitarbeiterüberwachung, neue Technologien)', 'Einsatz von Kamera-/Zugangskontrollsystemen, ERP-Einführung', 'IT, Werksleitung', 'DSB / CISO', 'DSFA-Verfahren definieren, bei Bedarf Aufsichtsbehörde konsultieren', 'DSB-DSFA-001', 'In Umsetzung', '30.09.2025', '2026-03-10', 'DSFA-Template vorhanden', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(5, '1.5', 'Datenschutz-Grundverordnung (EU) 2016/679', 'DSGVO', 'Datenschutz', 'Meldepflicht Datenpannen', 'Art. 33-34: Meldung von Datenschutzverletzungen an Aufsichtsbehörde binnen 72 Stunden; ggf. Benachrichtigung Betroffener', 'Jede Datenpanne (Verlust, unbefugter Zugriff, Offenlegung)', 'IT, DSB, Geschäftsführung', 'DSB / CISO', 'Incident-Response-Plan mit DSB-Meldepfad, Kommunikationsvorlage', 'ISM-IRP-001', 'Konform', '31.12.2025', '2026-03-10', 'Meldeweg definiert; Testübung ausstehend', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(6, '1.6', 'Datenschutz-Grundverordnung (EU) 2016/679', 'DSGVO', 'Datenschutz', 'Auftragsverarbeitung', 'Art. 28: Abschluss von Auftragsverarbeitungsverträgen (AVV) mit allen Dienstleistern, die personenbezogene Daten verarbeiten', 'Cloud-Dienste, externe IT-Dienstleister, Lohnabrechnung', 'Einkauf, IT, Recht', 'DSB', 'AVV-Vorlage, Dienstleisterliste pflegen', 'DSB-AVV-001', 'Konform', '31.12.2025', '2026-03-10', 'Alle aktiven AVV abgeschlossen', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(7, '1.7', 'Datenschutz-Grundverordnung (EU) 2016/679', 'DSGVO', 'Datenschutz', 'Datenschutzbeauftragter', 'Art. 37: Benennung eines DSB; Meldung an Aufsichtsbehörde', 'Je nach Unternehmensgröße und Verarbeitungsumfang', 'Geschäftsführung', 'Geschäftsführung', 'DSB benennen/bestellen, Kontaktdaten veröffentlichen', 'DSB-BESTELLUNG-001', 'Konform', '31.12.2025', '2026-03-10', 'DSB intern bestellt und gemeldet', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(8, '2.1', 'ISO/IEC 27001:2022', 'ISO27001', 'Norm', 'ISMS-Kontext', 'Kap. 4: Verstehen der Organisation, interne/externe Themen, interessierte Parteien und Geltungsbereich des ISMS', 'Grundlage für das gesamte ISMS', 'Geschäftsführung, CISO', 'CISO', 'Kontextanalyse, Scoping-Dokument erstellen', 'ISM-KON-001', 'In Umsetzung', '31.03.2025', '2026-03-10', 'Stakeholder-Analyse läuft', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(9, '2.2', 'ISO/IEC 27001:2022', 'ISO27001', 'Norm', 'Risikobeurteilung', 'Kap. 6.1 / A 8.2: Informationssicherheits-Risikobeurteilung; Risikobehandlungsplan (RTP)', 'Identifikation aller Informationsrisiken im Unternehmen', 'CISO, IT, Fachabteilungen', 'CISO', 'Risikobewertungsmethodik, Asset-Inventar, Risikoregister', 'ISM-RISK-001', 'In Umsetzung', '30.06.2025', '2026-03-10', 'Risikobewertungs-Workshop geplant', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(10, '2.3', 'ISO/IEC 27001:2022', 'ISO27001', 'Norm', 'IS-Leitlinie', 'Kap. 5.2 / A 5.1: Informationssicherheitsleitlinie durch Geschäftsführung verabschiedet und kommuniziert', 'Grundsatzdokument für alle IS-Maßnahmen', 'Alle Mitarbeiter', 'CISO / Geschäftsführung', 'IS-Leitlinie erstellen, genehmigen, veröffentlichen', 'ISM-POL-001', 'Konform', '31.12.2025', '2026-03-10', 'Leitlinie v1.0 verabschiedet', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(11, '2.4', 'ISO/IEC 27001:2022', 'ISO27001', 'Norm', 'Asset Management', 'A 5.9-5.12: Inventar aller Informationswerte, Klassifizierung, Kennzeichnung und sicherer Umgang', 'Hardware, Software, Daten, Dienste, Personen', 'IT, Einkauf', 'IT-Leiter', 'Asset-Inventar anlegen und pflegen, Klassifizierungsschema', 'ISM-ASSET-001', 'In Umsetzung', '31.07.2025', '2026-03-10', 'Asset-Inventar in Aufbau', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(12, '2.5', 'ISO/IEC 27001:2022', 'ISO27001', 'Norm', 'Zugangs- und Zugriffskontrolle', 'A 5.15-5.18: Need-to-know-Prinzip, Benutzerregistrierung/-abmeldung, privilegierte Zugriffsrechte, Passwortverwaltung', 'Alle IT-Systeme, ERP, CAD-Umgebung', 'IT', 'IT-Leiter / CISO', 'IAM-Richtlinie, RBAC, Review mind. jährlich', 'ISM-IAM-001', 'In Umsetzung', '31.08.2025', '2026-03-10', 'AD-Gruppen-Review ausstehend', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(13, '2.6', 'ISO/IEC 27001:2022', 'ISO27001', 'Norm', 'Kryptographie', 'A 8.24: Richtlinie für kryptographische Maßnahmen (Verschlüsselung, Schlüsselmanagement)', 'Datenübertragung, Datenspeicherung, E-Mail', 'IT', 'IT-Leiter', 'Krypto-Richtlinie, TLS 1.2+, Festplattenverschlüsselung', 'ISM-KRYPTO-001', 'In Umsetzung', '30.09.2025', '2026-03-10', '', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(14, '2.7', 'ISO/IEC 27001:2022', 'ISO27001', 'Norm', 'Physische Sicherheit', 'A 7.1-7.14: Physische Zutrittskontrollen, Schutz vor Umweltbedrohungen, sicheres Arbeiten in Sicherheitsbereichen', 'Serverräume, Produktionshalle, Büros', 'Facility Management, IT', 'Werksleiter / IT-Leiter', 'Zutrittskonzept, Schließanlage, CCTV, Clean-Desk-Policy', 'ISM-PHYS-001', 'Konform', '31.12.2025', '2026-03-10', 'Serverraum-Zugang protokolliert', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(15, '2.8', 'ISO/IEC 27001:2022', 'ISO27001', 'Norm', 'Betriebssicherheit', 'A 8.1-8.23: Change Management, Schutz vor Malware, Logging, Schwachstellenmanagement, Backups', 'IT-Betrieb, Produktionssysteme (OT/IT-Konvergenz)', 'IT', 'IT-Leiter', 'Change-Management-Prozess, AV-Lösung, SIEM, Backup-Konzept', 'ISM-OPS-001', 'In Umsetzung', '31.10.2025', '2026-03-10', 'SIEM-Einführung in Planung', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(16, '2.9', 'ISO/IEC 27001:2022', 'ISO27001', 'Norm', 'Lieferantenbeziehungen', 'A 5.19-5.22: IS-Anforderungen in Lieferantenverträgen, Überwachung Lieferanten-Leistung', 'IT-Dienstleister, Maschinenzulieferer mit Fernwartungszugang', 'Einkauf, IT', 'CISO / Einkaufsleiter', 'Lieferanten-IS-Fragebogen, Vertragsklauseln, Audit-Rechte', 'ISM-SUPP-001', 'In Umsetzung', '30.11.2025', '2026-03-10', 'Kritische Lieferanten identifizieren', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(17, '2.10', 'ISO/IEC 27001:2022', 'ISO27001', 'Norm', 'Incident Management', 'A 5.24-5.28: IS-Vorfallmanagement, Vorfallmeldung, Reaktion und Lessons Learned', 'Alle IS-Vorfälle (Cyberangriffe, Datenverlust, Systemausfall)', 'IT, CISO', 'CISO', 'Incident-Response-Plan, Meldeweg, regelmäßige Übungen', 'ISM-IRP-001', 'In Umsetzung', '31.12.2025', '2026-03-10', 'IRP v0.9 – Freigabe ausstehend', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(18, '2.11', 'ISO/IEC 27001:2022', 'ISO27001', 'Norm', 'Business Continuity', 'A 5.29-5.30: IS-Aspekte im BCM, Redundanzen, Wiederherstellungszeiten (RTO/RPO)', 'Kritische Geschäftsprozesse, Produktion, ERP', 'IT, Geschäftsführung', 'CISO / Geschäftsführer', 'BCP/DRP erstellen, RTO/RPO definieren, Tests durchführen', 'ISM-BCP-001', 'Nicht begonnen', '31.03.2026', '2026-03-10', 'Hohe Priorität – BCM-Projekt einplanen', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(19, '2.12', 'ISO/IEC 27001:2022', 'ISO27001', 'Norm', 'Compliance / Rechtsregister', 'A 5.31 / 18.1: Identifizierung gesetzlicher, regulatorischer und vertraglicher Anforderungen; Rechtsregister pflegen', 'Alle Compliance-relevanten Bereiche', 'CISO, DSB, Recht', 'CISO', 'Dieses Rechtsregister, jährliche Überprüfung, Änderungsmanagement', 'ISM-RR-001', 'Konform', '31.12.2025', '2026-03-10', 'Vorliegendes Dokument', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(20, '2.13', 'ISO/IEC 27001:2022', 'ISO27001', 'Norm', 'Internes Audit', 'Kap. 9.2: Regelmäßige interne ISMS-Audits nach geplantem Auditprogramm', 'Gesamtes ISMS', 'CISO, interne Auditoren', 'CISO', 'Auditprogramm erstellen, Auditoren schulen, Berichte dokumentieren', 'ISM-AUDIT-001', 'In Umsetzung', '30.06.2025', '2026-03-10', 'Erstaudit für Q2 geplant', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(21, '2.14', 'ISO/IEC 27001:2022', 'ISO27001', 'Norm', 'Managementbewertung', 'Kap. 9.3: Jährliche Managementbewertung des ISMS durch die Geschäftsführung', 'Gesamtes ISMS', 'Geschäftsführung', 'CISO', 'Management-Review-Protokoll, Kennzahlen, Verbesserungsmaßnahmen', 'ISM-MGR-001', 'In Umsetzung', '31.12.2025', '2026-03-10', 'Termin mit GF festlegen', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(22, '3.1', 'NIS-2-Richtlinie (EU) 2022/2555 / BSIG', 'NIS-2', 'Cybersicherheit', 'Registrierung', 'Art. 27: Registrierungspflicht wesentlicher und wichtiger Einrichtungen beim BSI', 'Maschinenbau i.d.R. Kategorie Wichtige Einrichtung (Verarbeitendes Gewerbe)', 'Geschäftsführung', 'Geschäftsführer / CISO', 'Selbsteinstufung vornehmen, ggf. Registrierung beim BSI', 'ISM-NIS2-001', 'In Umsetzung', 'Gemäß KRITIS-DachG', '2026-03-10', 'Branchenspezifische Schwellenwerte prüfen', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(23, '3.2', 'NIS-2-Richtlinie (EU) 2022/2555 / BSIG', 'NIS-2', 'Cybersicherheit', 'Risikomanagement', 'Art. 21: Geeignete TOM: Sicherheitskonzept, Netzwerksicherheit, Kryptographie, Zugriffskontrolle, Supply-Chain-Sicherheit', 'Gesamte IT-/OT-Infrastruktur, Produktionsnetzwerke', 'IT, OT, CISO', 'CISO', 'NIS-2-konforme Sicherheitsmaßnahmen auf Basis ISO 27001 implementieren', 'ISM-NIS2-002', 'In Umsetzung', '31.10.2025', '2026-03-10', 'Synergie mit ISO-27001-Maßnahmen nutzen', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(24, '3.3', 'NIS-2-Richtlinie (EU) 2022/2555 / BSIG', 'NIS-2', 'Cybersicherheit', 'Meldepflicht Sicherheitsvorfälle', 'Art. 23: Erstmeldung 24h, Folgemeldung 72h, Abschlussbericht 1 Monat an BSI', 'Alle erheblichen Cyber-Vorfälle', 'IT, CISO, Geschäftsführung', 'CISO', 'NIS-2-Meldeprozess in IRP integrieren, BSI-Meldeformular bereithalten', 'ISM-IRP-001', 'In Umsetzung', '31.08.2025', '2026-03-10', 'BSI-Meldeportal einrichten', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(25, '3.4', 'NIS-2-Richtlinie (EU) 2022/2555 / BSIG', 'NIS-2', 'Cybersicherheit', 'Lieferkettensicherheit', 'Art. 21 Abs. 2d: Sicherheit in der Lieferkette – Bewertung von Lieferanten und Dienstleistern', 'Zulieferer mit IT-Zugang, Cloud-Dienstleister, Fernwartungsanbieter', 'Einkauf, IT', 'CISO / Einkaufsleiter', 'Lieferanten-Sicherheitsbewertung, Vertragsklauseln, IS-Anforderungen', 'ISM-SUPP-001', 'In Umsetzung', '30.11.2025', '2026-03-10', '', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(26, '3.5', 'NIS-2-Richtlinie (EU) 2022/2555 / BSIG', 'NIS-2', 'Cybersicherheit', 'Schulung Geschäftsleitung', 'Art. 20: Leitungsorgane müssen IS-Schulungen absolvieren; persönliche Haftung bei Pflichtverletzungen', 'Gesamte Geschäftsführung und Führungsebene', 'Geschäftsführung', 'CISO', 'Jährliche IS-Schulung für GF/Management, Teilnahmenachweis', 'ISM-TRAIN-001', 'Nicht begonnen', '30.06.2025', '2026-03-10', 'DRINGEND: Schulungsplan erstellen', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(27, '3.6', 'NIS-2-Richtlinie (EU) 2022/2555 / BSIG', 'NIS-2', 'Cybersicherheit', 'Netzwerksicherheit', 'Art. 21: Netzwerksicherheit, Sicherheitsmonitoring, Perimeterschutz, Segmentierung IT/OT', 'Produktionsnetzwerk, Büronetzwerk, Fernwartungszugänge', 'IT', 'IT-Leiter / CISO', 'Firewall, IDS/IPS, Netzwerksegmentierung, Monitoring-Konzept', 'ISM-NET-001', 'In Umsetzung', '30.09.2025', '2026-03-10', 'OT/IT-Segmentierung prioritär', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(28, '3.7', 'NIS-2-Richtlinie (EU) 2022/2555 / BSIG', 'NIS-2', 'Cybersicherheit', 'Multi-Faktor-Authentifizierung', 'Art. 21 Abs. 2j: Einsatz von MFA oder kontinuierlicher Authentifizierung', 'Alle kritischen Systeme, Remote-Zugänge, Admin-Konten', 'IT', 'IT-Leiter', 'MFA für VPN, Admin-Konten, Cloud-Dienste einführen', 'ISM-IAM-001', 'In Umsetzung', '31.07.2025', '2026-03-10', 'MFA für VPN bereits aktiv; weitere Systeme ausstehend', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(29, '3.8', 'NIS-2-Richtlinie (EU) 2022/2555 / BSIG', 'NIS-2', 'Cybersicherheit', 'Business Continuity / Krisenmanagement', 'Art. 21 Abs. 2c: Aufrechterhaltung des Betriebs, Backupmanagement, Wiederherstellung, Krisenmanagement', 'Kritische Produktionssysteme, ERP, Kommunikation', 'IT, Produktion', 'CISO / Werksleiter', 'BCP, DRP, Backup-Tests, Krisenplan, Krisenübung', 'ISM-BCP-001', 'Nicht begonnen', '31.03.2026', '2026-03-10', 'Gemeinsam mit ISO-27001 BCP adressieren', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(30, '4.1', 'Bundesdatenschutzgesetz (BDSG)', 'BDSG', 'Datenschutz', 'Beschäftigtendatenschutz', 'SS 26, 88 ff. BDSG: Verarbeitung von Beschäftigtendaten nur für Zwecke des Beschäftigungsverhältnisses', 'HR-Prozesse, Zeiterfassung, Videoüberwachung am Arbeitsplatz', 'HR', 'DSB / HR-Leiter', 'Betriebsvereinbarungen prüfen/schließen, Löschkonzept für HR-Daten', 'DSB-HR-001', 'In Umsetzung', '30.09.2025', '2026-03-10', 'BV Videoüberwachung erforderlich', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(31, '4.2', 'IT-Sicherheitsgesetz 2.0 / BSIG', 'BSIG', 'Cybersicherheit', 'KRITIS-Pflichten', 'SS 8a ff. BSIG: Betreiber kritischer Infrastrukturen: angemessene Sicherheitsmaßnahmen, Meldepflichten, Nachweise alle 2 Jahre', 'Ggf. relevant wenn Schwellenwerte (500 Mio. EUR Umsatz, systemrelevant) erreicht', 'IT, CISO', 'CISO', 'Schwellenwert-Prüfung, ggf. BSI-Registrierung', 'ISM-NIS2-001', 'Zu prüfen', '31.12.2025', '2026-03-10', 'Schwellenwert aktuell unterschritten', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(32, '4.3', 'TTDSG', 'TTDSG', 'Datenschutz', 'Cookie-Einwilligung / Website', 'S 25 TTDSG: Einwilligung vor Setzen nicht-essenzieller Cookies; technischer Datenschutz bei Telemedien', 'Unternehmens-Website, Online-Kundenportal', 'Marketing, IT', 'DSB', 'Cookie-Banner, Datenschutzerklärung aktualisieren', 'DSB-WEB-001', 'Konform', '31.12.2025', '2026-03-10', '', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(33, '4.4', 'Handelsgesetzbuch (HGB) / AO', 'HGB/AO', 'Compliance', 'Aufbewahrungspflichten', 'S 257 HGB, S 147 AO: Geschäftliche Unterlagen 6-10 Jahre aufbewahren; elektronische Archivierung revisionssicher (GoBD)', 'Geschäftsbriefe, Buchhaltung, Verträge, Rechnungen', 'Buchhaltung, IT', 'CFO / IT-Leiter', 'DMS/Archivierungssystem (GoBD-konform), Löschkonzept', 'ISM-ARCH-001', 'Konform', '31.12.2025', '2026-03-10', 'Revisionssicheres Archiv im Einsatz', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(34, '4.5', 'Maschinenverordnung (EU) 2023/1230', 'ProdHaftG/MVO', 'Produktsicherheit', 'Cybersicherheit in Maschinen', 'MVO Art. 10 / Anhang I Kap. 1.1.9: Cybersicherheit als integraler Bestandteil der Maschinensicherheit (ab 20.01.2027)', 'Alle neu entwickelten Maschinen und Steuerungssysteme (SPS, HMI)', 'Entwicklung, Konstruktion', 'Entwicklungsleiter / CISO', 'Security-by-Design in Entwicklungsprozess integrieren, Risikobeurteilung erweitern', 'ISM-DEV-001', 'In Umsetzung', '20.01.2027', '2026-03-10', 'Umsetzungsfrist beachten!', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(35, '4.6', 'Cyber Resilience Act (EU) 2024/2847', 'CRA', 'Produktsicherheit', 'Cybersicherheitsanforderungen Produkte', 'CRA: Hersteller von Produkten mit digitalen Elementen müssen Cybersicherheitsanforderungen über den Lebenszyklus erfüllen; SBOM; CE', 'Vernetzte Maschinen, Steuerungen, IoT-Komponenten', 'Entwicklung, Konstruktion, Vertrieb', 'Entwicklungsleiter / CISO', 'CRA-Produktanalyse, SBOM erstellen, Update-Prozess definieren', 'ISM-DEV-002', 'Nicht begonnen', '11.12.2027', '2026-03-10', 'CRA-Taskforce einrichten', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(36, '5.1', 'EASA Part 21 – Zulassung (Verordnung (EU) Nr. 748/2012)', 'Part 21', 'Luftfahrt / Regulatorisch', 'Design & Produktion', 'Part 21 Subpart G (POA): Produktionsgenehmigung; Qualitätssicherungssystem, Konformitätsnachweise, EASA Form 1 / FAA 8130-3', 'Alle gefertigten Luftfahrtkomponenten und -baugruppen', 'Produktion, Qualität, Entwicklung', 'Qualitätsmanager / Accountable Manager', 'POA-Handbuch (POE), QM-System nach Part 21G, interne Audits, EASA-Überwachung', 'QM-POA-001', 'Konform', '31.12.2025', '2026-03-10', 'POA-Zertifikat vorhanden', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(37, '5.2', 'EASA Part 145 – Instandhaltungsbetriebe (Verordnung (EU) Nr. 1321/2014)', 'Part 145', 'Luftfahrt / Regulatorisch', 'Instandhaltung', 'Part 145: Genehmigung für Instandhaltung/Reparatur an Luftfahrtteilen; MOE, Certifying Staff, Quality System', 'Nur relevant falls Instandhaltungsleistungen erbracht werden', 'Produktion, Qualität', 'Accountable Manager / QM', 'Prüfen ob Part-145-Tätigkeit vorliegt; ggf. Genehmigung beantragen', 'QM-M145-001', 'Zu prüfen', '31.12.2025', '2026-03-10', 'Relevanz anhand Tätigkeitsprofil prüfen', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(38, '5.3', 'AS9100 Rev. D – QMS Luft- und Raumfahrt', 'AS9100D', 'Luftfahrt / Norm', 'Qualitätsmanagement', 'AS9100D: QMS für Luft- und Raumfahrt; Risikomanagement, Konfigurationsmanagement, FAI (AS9102), FOD-Prävention, Lieferantenmanagement', 'Gesamte Wertschöpfungskette Luftfahrtkomponenten', 'Alle Bereiche', 'Qualitätsmanager', 'AS9100-Zertifizierung anstreben/aufrechterhalten; QMS-Handbuch, interne Audits', 'QM-AS9100-001', 'Konform', '31.12.2025', '2026-03-10', 'Zertifikat vorhanden – Rezertifizierungsaudit prüfen', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(39, '5.4', 'EASA CS-25 / CS-23 – Zulassungsspezifikationen', 'CS-25/CS-23', 'Luftfahrt / Norm', 'Technische Normen', 'Certification Specifications: Komponenten müssen CS-Anforderungen und AMC genügen; Nachweise durch Analysen, Tests, Berechnungen', 'Alle sicherheitsrelevanten Bauteile (Primary/Secondary Structure, Systeme)', 'Entwicklung, Qualität', 'Chief Engineer / Entwicklungsleiter', 'Compliance-Matrix erstellen, Nachweisdokumentation (DDP), Koordination mit TC-Inhaber', 'QM-CS-001', 'In Umsetzung', '31.12.2025', '2026-03-10', 'Anforderungen je Kundenprojekt spezifisch', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(40, '5.5', 'DO-178C – Software Airborne Systems Certification', 'DO-178C', 'Luftfahrt / Norm', 'Software-Entwicklung', 'DO-178C: Entwicklungsstandard für sicherheitskritische Luftfahrtsoftware; DAL A-E; Pläne, Anforderungen, Design, Code, Test, CM', 'Alle Softwarekomponenten in Luftfahrtprodukten (Steuerung, Embedded)', 'Softwareentwicklung', 'Software-Entwicklungsleiter / DER', 'SW-Entwicklungspläne (PSAC, SDP, SVP), Tool Qualification, Reviews & Audits', 'QM-SW178-001', 'In Umsetzung', '31.12.2025', '2026-03-10', 'DAL-Einstufung je Funktion dokumentieren', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(41, '5.6', 'DO-254 – Design Assurance Airborne Electronic Hardware', 'DO-254', 'Luftfahrt / Norm', 'Hardware-Entwicklung', 'DO-254: Entwicklungsstandard für komplexe elektronische Hardware (FPGA, ASIC, PLDs); DAL; Validierung, Verifikation, CM', 'Elektronische Baugruppen, FPGAs, PLDs in Luftfahrtprodukten', 'Hardwareentwicklung', 'Hardware-Entwicklungsleiter', 'Hardware-Entwicklungspläne (PHAC, HDP, HVP), Hardware-Reviews', 'QM-HW254-001', 'Zu prüfen', '31.12.2025', '2026-03-10', 'Prüfen ob komplexe Elektronik im Portfolio', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(42, '5.7', 'ARP4754A – Development of Civil Aircraft and Systems', 'ARP4754A', 'Luftfahrt / Norm', 'Systementwicklung', 'ARP4754A: Systementwicklungsprozess; FHA, SSA, FMEA, FTA; Anforderungsmanagement, Verifikation & Validierung', 'Systemintegration Luftfahrtkomponenten', 'Entwicklung, Systems Engineering', 'Systems Engineer / Entwicklungsleiter', 'System Safety Plan, FHA/SSA-Dokumente, FMEA, Anforderungsmanagement-Tool', 'QM-ARP4754-001', 'In Umsetzung', '31.12.2025', '2026-03-10', 'Abstimmung mit Systemintegrator erforderlich', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(43, '5.8', 'Verordnung (EU) 2018/1139 – EASA Basisverordnung', 'EASA-BVO', 'Luftfahrt / Regulatorisch', 'Grundlegende Anforderungen', 'EASA Basisverordnung: Grundlegende Sicherheitsanforderungen; Rechtsrahmen für alle delegierten Verordnungen (Part 21, 145 etc.)', 'Alle Luftfahrtaktivitäten des Unternehmens', 'Geschäftsführung, QM', 'Accountable Manager', 'Einhaltung aller Part-Vorschriften; Accountable Manager benennen', 'QM-EASA-001', 'Konform', '31.12.2025', '2026-03-10', '', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(44, '5.9', 'ITAR (22 CFR 120-130) / EAR (15 CFR 730-774)', 'ITAR/EAR', 'Luftfahrt / Export-Kontrolle', 'Exportkontrolle', 'ITAR: US-Exportkontrolle Rüstungsgüter (USML); EAR: Dual-Use-Güter (CCL/ECCN); Genehmigungen, TCP, Mitarbeiterschulungen, Re-Export-Verbote', 'Alle Lieferungen von Komponenten in Luftfahrtanwendungen (v.a. USA, NATO)', 'Exportkontrollbeauftragter, Vertrieb, Einkauf', 'Exportkontrollbeauftragter (EKB)', 'Exportkontroll-Klassifizierung aller Produkte (ECCN/USML), TCP, Schulungen, Genehmigungen', 'EKB-ITAR-001', 'In Umsetzung', '30.09.2025', '2026-03-10', 'Rechtliche Prüfung durch Exportkontroll-Anwalt empfohlen', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(45, '5.10', 'Dual-Use-Verordnung (EU) 2021/821 / AWG / AWV', 'DualUse', 'Luftfahrt / Export-Kontrolle', 'Exportkontrolle', 'EU Dual-Use-VO: Genehmigungspflicht für Export; AWG/AWV: Außenwirtschaftsrecht; BAFA-Genehmigungen; Catch-All-Klausel', 'Alle Exporte von Produkten und Technologie in Drittländer', 'Exportkontrollbeauftragter, Vertrieb', 'EKB', 'Güterklassifizierung, BAFA-Genehmigungen, Endverbleibserklärungen, Schulungen', 'EKB-DUAL-001', 'In Umsetzung', '31.12.2025', '2026-03-10', 'BAFA-Liste und Sanktionslisten regelmäßig prüfen', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(46, '5.11', 'EN 9120 – QMS Luft- und Raumfahrt-Händler', 'EN9120', 'Luftfahrt / Norm', 'Lieferkette', 'EN 9120: Anforderungen an Rückverfolgbarkeit, Echtheitsprüfung (Counterfeit Parts, AS6081), Dokumentenmanagement, CoC, EASA Form 1', 'Einkauf und Weiterlieferung von Zukaufteilen für Luftfahrt', 'Einkauf, Lager, QM', 'Qualitätsmanager / Einkaufsleiter', 'Counterfeit-Parts-Prozess (AS6081), Lieferantenqualifizierung, CoC-Prüfung, Rückverfolgbarkeit', 'QM-EN9120-001', 'Zu prüfen', '31.12.2025', '2026-03-10', 'Relevanz prüfen je nach Lieferkettenfunktion', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(47, '5.12', 'NADCAP – National Aerospace and Defense Contractors Accreditation', 'NADCAP', 'Luftfahrt / Akkreditierung', 'Sonderverfahren', 'NADCAP-Akkreditierung für Sonderverfahren (Schweißen, Wärmebehandlung, NDT, Beschichtungen, Composites, Elektronik)', 'Fertigungsverfahren je nach Produktspektrum', 'Produktion, QM', 'Fertigungsleiter / Qualitätsmanager', 'Prüfen welche NADCAP-Kategorien kundenseitig gefordert werden; Akkreditierung beantragen', 'QM-NADCAP-001', 'Zu prüfen', '31.12.2025', '2026-03-10', 'Kundenanforderungen je Projekt prüfen', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(48, '5.13', 'Cybersicherheit Luftfahrt – EASA Part-IS / ED-202A / DO-326A', 'EASA-IS / DO-326A', 'Luftfahrt / Cybersicherheit', 'Informationssicherheit Luftfahrt', 'EASA Part-IS: Cybersicherheitspflichten für Organisationen; DO-326A/ED-202A: IS-Risikobeurteilung Flugzeugsysteme; AMC 20-42', 'Vernetzte Luftfahrtkomponenten, Software, Steuerungssysteme', 'IT, Entwicklung, CISO', 'CISO / Entwicklungsleiter', 'IS-Risikobeurteilung für Luftfahrtprodukte, Security-by-Design, Koordination mit ISMS', 'ISM-AV-001', 'Nicht begonnen', '31.12.2025', '2026-03-10', 'Synergie mit ISO 27001 / NIS-2 nutzen; EASA-Leitlinien konsultieren', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(49, '5.14', 'Produkthaftung Luftfahrt – ProdHaftG / Strict Liability', 'ProdHaftG-Luft', 'Luftfahrt / Recht', 'Produkthaftung', 'Verschärfte Produkthaftung; Dokumentationspflichten 30+ Jahre; Rückverfolgbarkeit jeder Komponente (Serial Number, Batch)', 'Alle gelieferten Luftfahrtkomponenten', 'QM, Recht, Geschäftsführung', 'Qualitätsmanager / Recht', 'Lückenlose Dokumentation (Serialisierung, CoC, Prüfprotokolle), 30-Jahre-Archivierung, Produkthaftpflichtversicherung', 'QM-HAFT-001', 'In Umsetzung', '31.12.2025', '2026-03-10', 'Versicherungsschutz und Deckungssumme prüfen', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL),
(50, '5.15', 'EASA Part 145 / Air OPS – Betriebliche Anforderungen', 'Air OPS', 'Luftfahrt / Regulatorisch', 'Betriebliche Anforderungen', 'Falls Komponenten für Betreiber (Airlines) geliefert: Air-OPS-Anforderungen können technische Spezifikationen beeinflussen; ETOPS, MEL', 'Bauteile für Airlinekunden (Ersatzteile, LRUs)', 'Entwicklung, Vertrieb', 'Entwicklungsleiter', 'Technische Spezifikationen auf Air-OPS-Konformität prüfen, Kundenvorgaben beachten', 'QM-AIROPS-001', 'Zu prüfen', '31.12.2025', '2026-03-10', 'Je nach Kundenanforderung', NULL, '2026-03-10', NULL, NULL, NULL, NULL, NULL, NULL);

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `rest_console_log`
--

CREATE TABLE `rest_console_log` (
  `id` int(11) NOT NULL,
  `ts` datetime NOT NULL DEFAULT current_timestamp(),
  `user_id` int(11) DEFAULT NULL,
  `user_email` varchar(255) DEFAULT NULL,
  `method` varchar(10) NOT NULL,
  `url` text NOT NULL,
  `req_headers` mediumtext DEFAULT NULL,
  `req_body` mediumtext DEFAULT NULL,
  `status_code` int(11) DEFAULT NULL,
  `resp_size` int(11) DEFAULT NULL,
  `success` tinyint(1) NOT NULL DEFAULT 0,
  `error_text` text DEFAULT NULL,
  `duration_ms` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `Risiko`
--

CREATE TABLE `Risiko` (
  `id` int(11) UNSIGNED NOT NULL,
  `Nummer` varchar(64) DEFAULT NULL,
  `Name` varchar(256) DEFAULT NULL,
  `Besitzer` int(11) UNSIGNED DEFAULT 0,
  `Abteilung` varchar(64) DEFAULT NULL,
  `status` varchar(64) DEFAULT NULL,
  `Businessimpact` text DEFAULT NULL,
  `Beschreibung` text DEFAULT NULL,
  `Kategorie` varchar(64) DEFAULT NULL,
  `Maßnahme` text DEFAULT NULL,
  `wahrvm` int(11) NOT NULL DEFAULT 1,
  `auswvm` int(11) NOT NULL DEFAULT 1,
  `wahrnm` int(11) NOT NULL DEFAULT 1,
  `auswnm` int(11) NOT NULL DEFAULT 1,
  `Ersteller` int(11) NOT NULL DEFAULT 0,
  `Erstelldatum` date NOT NULL DEFAULT current_timestamp(),
  `Behandlung` varchar(64) DEFAULT NULL,
  `umgesetzt` tinyint(1) NOT NULL DEFAULT 0,
  `Aenderer` int(11) NOT NULL DEFAULT 0,
  `geaendert` date NOT NULL DEFAULT current_timestamp(),
  `Reviewer` int(10) UNSIGNED NOT NULL DEFAULT 0,
  `review` date NOT NULL DEFAULT current_timestamp(),
  `risiko` varchar(64) DEFAULT NULL,
  `massnahmen` varchar(256) DEFAULT NULL,
  `assets` varchar(256) DEFAULT NULL,
  `archiviert` tinyint(1) NOT NULL DEFAULT 0,
  `ra` varchar(255) DEFAULT NULL,
  `riskscore` int(11) NOT NULL DEFAULT 0,
  `bedrohungen` varchar(255) DEFAULT NULL,
  `schwachstellen` varchar(255) DEFAULT NULL,
  `ausw_vm_detail` varchar(20) DEFAULT NULL COMMENT 'Auswirkung vm je Faktor, kommasepariert (vm0,vm1,vm2,vm3,vm4)',
  `ausw_nm_detail` varchar(20) DEFAULT NULL COMMENT 'Auswirkung nm je Faktor, kommasepariert (nm0,nm1,nm2,nm3,nm4)',
  `dokumente` text DEFAULT NULL COMMENT 'Kommagetrennte IDs verknüpfter Dokumente (aus Tabelle Dokumente)',
  `normen` varchar(256) DEFAULT NULL COMMENT 'Kommagetrennte IDs verknüpfter Normen/Controls (aus Tabelle Normen)',
  `Name_en` text DEFAULT NULL,
  `Beschreibung_en` text DEFAULT NULL,
  `Businessimpact_en` text DEFAULT NULL,
  `Maßnahme_en` text DEFAULT NULL,
  `abteilung_id` int(11) DEFAULT NULL,
  `lieferanten` text DEFAULT NULL,
  `sync` tinyint(1) DEFAULT NULL,
  `synctime` datetime DEFAULT NULL,
  `Chancen` text DEFAULT NULL,
  `Chancen_en` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `Risiko_historie`
--

CREATE TABLE `Risiko_historie` (
  `id` int(11) UNSIGNED NOT NULL,
  `risiko_id` int(10) UNSIGNED DEFAULT NULL,
  `status` varchar(64) DEFAULT NULL,
  `wahrvm` int(11) NOT NULL DEFAULT 1,
  `auswvm` int(11) NOT NULL DEFAULT 1,
  `wahrnm` int(11) NOT NULL DEFAULT 1,
  `auswnm` int(11) NOT NULL DEFAULT 1,
  `Behandlung` varchar(64) DEFAULT NULL,
  `umgesetzt` tinyint(1) NOT NULL DEFAULT 0,
  `Aenderer` int(11) NOT NULL DEFAULT 0,
  `geaendert` date NOT NULL DEFAULT current_timestamp(),
  `risiko` varchar(64) DEFAULT NULL,
  `riskscore` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `risiko_kategorie`
--

CREATE TABLE `risiko_kategorie` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `risiko_kategorie`
--

INSERT INTO `risiko_kategorie` (`id`, `name`) VALUES
(1, 'Technische Risiken'),
(2, 'Organisatorische Risiken'),
(3, 'Personenbezogene Risiken'),
(4, 'Physische Risiken'),
(5, 'Rechtliche und regulatorische Risiken'),
(6, 'Betriebliche Risiken'),
(7, 'Externe Risiken / Umweltrisiken'),
(8, 'Strategische Risiken');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `risiko_score`
--

CREATE TABLE `risiko_score` (
  `id` int(10) UNSIGNED NOT NULL,
  `risiko` varchar(64) NOT NULL,
  `score` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `risiko_score`
--

INSERT INTO `risiko_score` (`id`, `risiko`, `score`) VALUES
(1, 'nicht bewertet', 0),
(2, 'niedrig', 5),
(3, 'mittel', 10),
(4, 'hoch', 20),
(5, 'kritisch', 255);

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `risiko_score_historie`
--

CREATE TABLE `risiko_score_historie` (
  `id` int(11) NOT NULL,
  `datum` date NOT NULL,
  `score_offen` decimal(5,1) DEFAULT NULL,
  `score_alle` decimal(5,1) DEFAULT NULL,
  `score_vendor` decimal(5,1) DEFAULT NULL,
  `n_offen` int(11) DEFAULT 0,
  `n_alle` int(11) DEFAULT 0,
  `n_vendor` int(11) DEFAULT 0,
  `erstellt_am` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `risiko_status`
--

CREATE TABLE `risiko_status` (
  `id` int(10) UNSIGNED NOT NULL,
  `status` varchar(64) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `risiko_status`
--

INSERT INTO `risiko_status` (`id`, `status`) VALUES
(1, 'Nicht bewertet'),
(2, 'in Bewertung'),
(3, 'Bewertet'),
(4, 'benötigt Neubewertung'),
(5, 'archiviert'),
(6, 'behandelt'),
(7, 'in Behandlung');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `Rollen`
--

CREATE TABLE `Rollen` (
  `id` int(10) UNSIGNED NOT NULL,
  `rolle` varchar(256) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `schwachstellen`
--

CREATE TABLE `schwachstellen` (
  `id` int(11) NOT NULL,
  `art` varchar(25) DEFAULT NULL,
  `name` varchar(53) DEFAULT NULL,
  `beschreibung` varchar(84) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- Daten für Tabelle `schwachstellen`
--

INSERT INTO `schwachstellen` (`id`, `art`, `name`, `beschreibung`) VALUES
(1, 'Organisation & Governance', 'Fehlende Sicherheitsrichtlinien', 'Es existieren keine oder unvollständige Informationssicherheitsrichtlinien'),
(2, 'Organisation & Governance', 'Unklare Verantwortlichkeiten', 'Rollen und Zuständigkeiten für Informationssicherheit sind nicht eindeutig definiert'),
(3, 'Organisation & Governance', 'Fehlende Risikoanalyse', 'Risiken werden nicht systematisch identifiziert oder bewertet'),
(4, 'Organisation & Governance', 'Unzureichendes Management-Commitment', 'Informationssicherheit wird nicht ausreichend unterstützt oder gesteuert'),
(5, 'Organisation & Governance', 'Fehlende Schulungsprogramme', 'Mitarbeitende sind nicht ausreichend sensibilisiert'),
(6, 'Personal', 'Unzureichende Sicherheitsawareness', 'Mitarbeitende erkennen Sicherheitsrisiken nicht oder handeln unsicher'),
(7, 'Personal', 'Fehlende Verpflichtung auf Vertraulichkeit', 'Keine oder unzureichende Vertraulichkeitsvereinbarungen'),
(8, 'Personal', 'Unzureichender On-/Offboarding-Prozess', 'Berechtigungen werden nicht korrekt vergeben oder entzogen'),
(9, 'Personal', 'Fehlende Vertretungsregelungen', 'Abhängigkeit von einzelnen Personen'),
(10, 'Personal', 'Unzureichende Hintergrundprüfung', 'Sicherheitsrelevante Prüfungen fehlen'),
(11, 'Zugriffskontrolle', 'Fehlende Multi-Faktor-Authentisierung', 'Zugriffe sind nur durch Benutzername/Passwort geschützt'),
(12, 'Zugriffskontrolle', 'Zu weitreichende Berechtigungen', 'Benutzer haben mehr Rechte als erforderlich'),
(13, 'Zugriffskontrolle', 'Gemeinsam genutzte Benutzerkonten', 'Keine eindeutige Benutzerzuordnung'),
(14, 'Zugriffskontrolle', 'Fehlende regelmäßige Rechteüberprüfung', 'Berechtigungen werden nicht regelmäßig geprüft'),
(15, 'Zugriffskontrolle', 'Unzureichende Passwortregeln', 'Schwache oder wiederverwendete Passwörter'),
(16, 'Technik & Systeme', 'Veraltete Systeme', 'Systeme oder Software werden nicht mehr unterstützt'),
(17, 'Technik & Systeme', 'Fehlendes Patch-Management', 'Sicherheitsupdates werden nicht zeitnah eingespielt'),
(18, 'Technik & Systeme', 'Unsichere Systemkonfiguration', 'Standards fehlen oder werden nicht eingehalten'),
(19, 'Technik & Systeme', 'Fehlende Protokollierung', 'Sicherheitsrelevante Ereignisse werden nicht geloggt'),
(20, 'Technik & Systeme', 'Unzureichende Malware-Schutzmaßnahmen', 'Kein oder veralteter Schutz vor Schadsoftware'),
(21, 'Technik & Systeme', 'Fehlende Systemhärtung', 'Unnötige Dienste oder Schnittstellen sind aktiv'),
(22, 'Technik & Systeme', 'Single Point of Failure', 'Keine Redundanz kritischer Komponenten'),
(23, 'Netzwerk & Kommunikation', 'Unzureichende Netzsegmentierung', 'Kritische Systeme sind nicht getrennt'),
(24, 'Netzwerk & Kommunikation', 'Fehlende Verschlüsselung', 'Daten werden unverschlüsselt übertragen oder gespeichert'),
(25, 'Netzwerk & Kommunikation', 'Unsichere Fernzugriffe', 'Remote-Zugriffe sind unzureichend abgesichert'),
(26, 'Netzwerk & Kommunikation', 'Fehlende Firewall-Regelnprüfung', 'Regeln sind veraltet oder zu weit gefasst'),
(27, 'Netzwerk & Kommunikation', 'Unzureichender Schutz vor Angriffen', 'Keine oder unzureichende Intrusion-Detection/-Prevention'),
(28, 'Betrieb & Wartung', 'Fehlende Datensicherung', 'Backups werden nicht oder unzureichend durchgeführt'),
(29, 'Betrieb & Wartung', 'Unzureichende Wiederherstellungstests', 'Backups werden nicht regelmäßig getestet'),
(30, 'Betrieb & Wartung', 'Fehlende Notfallpläne', 'Keine dokumentierten Notfall- oder Wiederanlaufkonzepte'),
(31, 'Betrieb & Wartung', 'Unzureichendes Monitoring', 'Störungen oder Angriffe werden nicht rechtzeitig erkannt'),
(32, 'Betrieb & Wartung', 'Unkontrollierte Änderungen', 'Änderungen erfolgen ohne Freigabe oder Dokumentation'),
(33, 'Lieferanten & Cloud', 'Unzureichende Sicherheitsanforderungen an Lieferanten', 'Sicherheitsanforderungen sind nicht vertraglich geregelt'),
(34, 'Lieferanten & Cloud', 'Fehlende Lieferantenbewertung', 'Sicherheitsniveau von Dienstleistern wird nicht geprüft'),
(35, 'Lieferanten & Cloud', 'Unklare Verantwortlichkeiten bei Cloud-Diensten', 'Shared-Responsibility-Modell ist nicht definiert'),
(36, 'Lieferanten & Cloud', 'Fehlende SLA/Sicherheitsvereinbarungen', 'Vertragliche Regelungen zu Verfügbarkeit und Sicherheit fehlen'),
(37, 'Lieferanten & Cloud', 'Unzureichende Überwachung von Dienstleistern', 'Kontrollen und Reviews fehlen'),
(38, 'Physische Sicherheit', 'Unzureichende Zutrittskontrolle', 'Unbefugte können Gebäude oder Serverräume betreten'),
(39, 'Physische Sicherheit', 'Fehlender Schutz vor Umwelteinflüssen', 'Kein ausreichender Brand-, Wasser- oder Klimaschutz'),
(40, 'Physische Sicherheit', 'Unsichere Aufbewahrung von Datenträgern', 'Datenträger sind ungeschützt zugänglich'),
(41, 'Physische Sicherheit', 'Fehlende Besucherregelungen', 'Besucher werden nicht kontrolliert oder begleitet'),
(42, 'Physische Sicherheit', 'Unzureichende Entsorgung von Datenträgern', 'Daten können rekonstruiert werden');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `schwachstelle_kategorie`
--

CREATE TABLE `schwachstelle_kategorie` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

--
-- Daten für Tabelle `schwachstelle_kategorie`
--

INSERT INTO `schwachstelle_kategorie` (`id`, `name`) VALUES
(1, 'Betrieb & Wartung'),
(2, 'Datenschutz & Compliance'),
(3, 'Lieferanten & Cloud'),
(4, 'Lieferanten & Dritte'),
(5, 'Netzwerk & Infrastruktur'),
(6, 'Netzwerk & Kommunikation'),
(7, 'Organisation & Governance'),
(8, 'Personal'),
(9, 'Physische Sicherheit'),
(10, 'Sonstiges'),
(11, 'Technik & Systeme'),
(12, 'Zugriffskontrolle');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `setup_angelegt`
--

CREATE TABLE `setup_angelegt` (
  `id` int(10) UNSIGNED NOT NULL,
  `teil` varchar(16) NOT NULL DEFAULT 'master' COMMENT 'Durchlauf aus TEILE in setup_assistent.py',
  `tabelle` varchar(64) NOT NULL,
  `eintrag_id` int(11) DEFAULT NULL COMMENT 'Zeile der Fachtabelle; NULL bei Normen',
  `name` varchar(255) NOT NULL DEFAULT '',
  `benutzer` varchar(255) NOT NULL DEFAULT '',
  `angelegt` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `setup_fortschritt`
--

CREATE TABLE `setup_fortschritt` (
  `schritt` varchar(40) NOT NULL COMMENT 'Schluessel aus SCHRITTE in setup_assistent.py',
  `status` varchar(16) NOT NULL DEFAULT 'offen' COMMENT 'begonnen | erledigt | uebersprungen',
  `benutzer` varchar(255) NOT NULL DEFAULT '',
  `geaendert` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `position` varchar(40) NOT NULL DEFAULT '',
  `merker` varchar(255) NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `setup_ki_dialog`
--

CREATE TABLE `setup_ki_dialog` (
  `schritt` varchar(40) NOT NULL COMMENT 'Schluessel aus SCHRITTE_KI in setup_assistent_ki.py',
  `daten` mediumtext NOT NULL COMMENT 'Dialogstand als JSON: Phase, Beschreibung, Verlauf, Felder',
  `benutzer` varchar(255) NOT NULL DEFAULT '',
  `geaendert` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `smtp_settings`
--

CREATE TABLE `smtp_settings` (
  `id` int(11) NOT NULL,
  `smtp_host` varchar(255) NOT NULL DEFAULT '',
  `smtp_port` int(11) NOT NULL DEFAULT 587,
  `smtp_user` varchar(255) NOT NULL DEFAULT '',
  `smtp_pass` varchar(255) NOT NULL DEFAULT '',
  `smtp_tls` tinyint(1) NOT NULL DEFAULT 1 COMMENT '1=STARTTLS, 2=SSL, 0=plain',
  `smtp_ssl` tinyint(1) NOT NULL DEFAULT 0 COMMENT '1=direktes SSL/SMTPS (Port 465)',
  `from_addr` varchar(255) NOT NULL DEFAULT '',
  `from_name` varchar(255) NOT NULL DEFAULT 'WolfISMS',
  `aktiv` tinyint(1) NOT NULL DEFAULT 0,
  `geaendert` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `sql_console_log`
--

CREATE TABLE `sql_console_log` (
  `id` int(11) NOT NULL,
  `ts` datetime NOT NULL DEFAULT current_timestamp(),
  `user_id` int(11) DEFAULT NULL,
  `user_email` varchar(255) DEFAULT NULL,
  `stmt_type` varchar(20) NOT NULL,
  `sql_text` mediumtext NOT NULL,
  `success` tinyint(1) NOT NULL DEFAULT 0,
  `row_count` int(11) DEFAULT NULL,
  `error_text` text DEFAULT NULL,
  `duration_ms` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `sso_settings`
--

CREATE TABLE `sso_settings` (
  `id` int(11) NOT NULL,
  `db_aktiv` tinyint(1) NOT NULL DEFAULT 0 COMMENT '1 = diese Zeile ueberschreibt .env/secret.env',
  `ms_auth` tinyint(1) NOT NULL DEFAULT 0,
  `ms_tenant_id` varchar(255) NOT NULL DEFAULT '',
  `ms_client_id` varchar(255) NOT NULL DEFAULT '',
  `ms_client_secret` varchar(1024) NOT NULL DEFAULT '',
  `google_auth` tinyint(1) NOT NULL DEFAULT 0,
  `google_client_id` varchar(255) NOT NULL DEFAULT '',
  `google_client_secret` varchar(1024) NOT NULL DEFAULT '',
  `google_redirect_uri` varchar(255) NOT NULL DEFAULT '',
  `sso_allowed_domains` varchar(1024) NOT NULL DEFAULT '',
  `sso_auto_create` tinyint(1) NOT NULL DEFAULT 0,
  `geaendert` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `Stammdaten`
--

CREATE TABLE `Stammdaten` (
  `Nummer` int(11) NOT NULL,
  `Art` text CHARACTER SET utf16 COLLATE utf16_german2_ci NOT NULL,
  `Bezeichnung` text CHARACTER SET utf16 COLLATE utf16_german2_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `stamm_kategorie`
--

CREATE TABLE `stamm_kategorie` (
  `id` int(11) NOT NULL,
  `bereich` varchar(40) NOT NULL,
  `schluessel` varchar(20) DEFAULT NULL,
  `name` varchar(100) NOT NULL,
  `name_en` varchar(100) NOT NULL DEFAULT '',
  `farbe` varchar(7) DEFAULT NULL,
  `sortierung` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

--
-- Daten für Tabelle `stamm_kategorie`
--

INSERT INTO `stamm_kategorie` (`id`, `bereich`, `schluessel`, `name`, `name_en`, `farbe`, `sortierung`) VALUES
(1, 'incidents', NULL, 'Malware', '', NULL, 60),
(2, 'incidents', NULL, 'Phishing', '', NULL, 70),
(3, 'incidents', NULL, 'Datenabfluss', 'Data leakage', NULL, 10),
(4, 'incidents', NULL, 'DoS', '', NULL, 30),
(5, 'incidents', NULL, 'Fehlkonfiguration', 'Misconfiguration', NULL, 40),
(6, 'incidents', NULL, 'Datenschutzverletzung', 'Data breach', NULL, 20),
(7, 'incidents', NULL, 'Sonstiges', 'Other', NULL, 80),
(8, 'change', NULL, 'Software', 'Software', NULL, 10),
(9, 'change', NULL, 'Hardware', 'Hardware', NULL, 20),
(10, 'change', NULL, 'Netzwerk', 'Network', NULL, 30),
(11, 'change', NULL, 'Konfiguration', 'Configuration', NULL, 40),
(12, 'change', NULL, 'Berechtigungen', 'Permissions', NULL, 50),
(13, 'change', NULL, 'Dienstleister', 'Service provider', NULL, 60),
(14, 'change', NULL, 'Organisation/Prozess', 'Organisation/process', NULL, 70),
(15, 'change', NULL, 'Sonstige', 'Other', NULL, 80),
(16, 'rechtsregister', NULL, 'Datenschutz', 'Data Protection', '#7a1c00', 10),
(17, 'rechtsregister', NULL, 'Norm', 'Standard', '#0d3a6a', 20),
(18, 'rechtsregister', NULL, 'Cybersicherheit', 'Cybersecurity', '#6d4c00', 30),
(19, 'rechtsregister', NULL, 'Compliance', 'Compliance', '#4a1a7a', 40),
(20, 'rechtsregister', NULL, 'Produktsicherheit', 'Product Safety', '#1a5c1a', 50),
(21, 'rechtsregister', NULL, 'Luftfahrt / Regulatorisch', 'Aviation / Regulatory', '#4a008a', 60),
(22, 'rechtsregister', NULL, 'Luftfahrt / Norm', 'Aviation / Standard', '#4a008a', 70),
(23, 'rechtsregister', NULL, 'Luftfahrt / Cybersicherheit', 'Aviation / Cybersecurity', '#4a008a', 80),
(24, 'rechtsregister', NULL, 'Luftfahrt / Export-Kontrolle', 'Aviation / Export Control', '#7a3a00', 90),
(25, 'rechtsregister', NULL, 'Luftfahrt / Akkreditierung', 'Aviation / Accreditation', '#4a008a', 100),
(26, 'rechtsregister', NULL, 'Luftfahrt / Recht', 'Aviation / Law', '#4a008a', 110),
(27, 'incidents', NULL, 'Lieferant', 'vendor', NULL, 50),
(28, 'netzwerkzonen', 'extern', 'Externe Netze', 'External networks', '#A6483E', 10),
(29, 'netzwerkzonen', 'dmz', 'DMZ / Perimeter', 'DMZ / perimeter', '#B0762E', 20),
(30, 'netzwerkzonen', 'intern', 'Interne Netze', 'Internal networks', '#2E6FA6', 30),
(31, 'netzwerkzonen', 'ot', 'OT / Produktion', 'OT / production', '#5A7D3E', 40),
(32, 'netzwerkzonen', 'sicher', 'Hochsicherheit / Management', 'High security / management', '#4B4E8A', 50),
(33, 'prozesslandkarte', 'fuehrung', 'Führungsprozesse', 'Management processes', '#3E6EA6', 10),
(34, 'prozesslandkarte', 'kern', 'Kernprozesse', 'Core processes', '#2E7D6B', 20),
(35, 'prozesslandkarte', 'unterstuetzung', 'Unterstützungsprozesse', 'Support processes', '#8A7040', 30);

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `stamm_kategorie_bereich`
--

CREATE TABLE `stamm_kategorie_bereich` (
  `bereich` varchar(40) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

--
-- Daten für Tabelle `stamm_kategorie_bereich`
--

INSERT INTO `stamm_kategorie_bereich` (`bereich`) VALUES
('change'),
('incidents'),
('kontakte'),
('netzwerkzonen'),
('prozesslandkarte'),
('rechtsregister');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `swm_schwachstellen`
--

CREATE TABLE `swm_schwachstellen` (
  `id` int(10) UNSIGNED NOT NULL,
  `nummer` varchar(20) DEFAULT NULL,
  `titel` varchar(200) NOT NULL,
  `beschreibung` text DEFAULT NULL,
  `score` decimal(4,1) DEFAULT NULL,
  `quelle` varchar(100) DEFAULT NULL,
  `status` varchar(50) NOT NULL DEFAULT 'Neu',
  `assets` text DEFAULT NULL,
  `incidents` text DEFAULT NULL,
  `risiken` text DEFAULT NULL,
  `massnahmen` text DEFAULT NULL,
  `Besitzer` int(10) UNSIGNED DEFAULT NULL,
  `Ersteller` int(10) UNSIGNED DEFAULT NULL,
  `erstellt` datetime NOT NULL DEFAULT current_timestamp(),
  `Aenderer` int(10) UNSIGNED DEFAULT NULL,
  `geaendert` datetime DEFAULT NULL,
  `titel_en` varchar(200) DEFAULT NULL,
  `beschreibung_en` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `tooltip_texte`
--

CREATE TABLE `tooltip_texte` (
  `id` int(11) NOT NULL,
  `bereich` varchar(100) NOT NULL,
  `art` varchar(10) NOT NULL,
  `schluessel` varchar(150) NOT NULL,
  `kopf_en` varchar(150) DEFAULT NULL,
  `text_de` text DEFAULT NULL,
  `text_en` text DEFAULT NULL,
  `aus` tinyint(1) NOT NULL DEFAULT 0,
  `geaendert` datetime DEFAULT NULL,
  `geaendert_von` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `unternehmen`
--

CREATE TABLE `unternehmen` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL DEFAULT '',
  `adresse` text DEFAULT NULL,
  `rechtsform` varchar(100) NOT NULL DEFAULT '',
  `mitarbeiterzahl` int(11) DEFAULT NULL,
  `umsatzklasse` varchar(32) NOT NULL DEFAULT '',
  `standorte` text DEFAULT NULL COMMENT 'Standorte und Länder, eine Zeile je Standort',
  `branche` varchar(255) NOT NULL DEFAULT '',
  `nace_code` varchar(20) NOT NULL DEFAULT '',
  `geaendert` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `mitarbeiterklasse` varchar(16) NOT NULL DEFAULT '',
  `branche_text` varchar(255) NOT NULL DEFAULT '',
  `hq_land` varchar(2) NOT NULL DEFAULT '',
  `hq_region` varchar(100) NOT NULL DEFAULT '',
  `geschaeftsfuehrer` varchar(255) NOT NULL DEFAULT '',
  `isb` varchar(255) NOT NULL DEFAULT '',
  `datenschutzbeauftragter` varchar(255) NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `email` varchar(255) NOT NULL,
  `password_hash` varchar(255) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `Vorname` varchar(80) NOT NULL,
  `Nachname` varchar(80) NOT NULL,
  `admin` tinyint(1) NOT NULL,
  `readonly` tinyint(1) NOT NULL DEFAULT 1,
  `master` tinyint(1) NOT NULL DEFAULT 0,
  `assets` tinyint(1) NOT NULL DEFAULT 0,
  `dok` tinyint(1) NOT NULL DEFAULT 0,
  `mass` tinyint(1) NOT NULL DEFAULT 0,
  `risk` tinyint(1) NOT NULL DEFAULT 0,
  `vendor` tinyint(1) NOT NULL DEFAULT 0,
  `audit` tinyint(1) NOT NULL DEFAULT 0,
  `abteilung` varchar(80) NOT NULL,
  `norm` tinyint(1) NOT NULL DEFAULT 0,
  `pers` tinyint(1) NOT NULL DEFAULT 0,
  `sso_provider` varchar(20) DEFAULT NULL,
  `sso_sub` varchar(255) DEFAULT NULL,
  `aufgabe` varchar(255) DEFAULT NULL,
  `persnr` varchar(11) DEFAULT NULL,
  `lang` varchar(2) NOT NULL DEFAULT 'de',
  `dok_read` varchar(1024) DEFAULT ' ',
  `dok_date` date DEFAULT NULL,
  `play` tinyint(1) NOT NULL DEFAULT 0,
  `incidents` tinyint(1) DEFAULT 0,
  `bcm` tinyint(4) DEFAULT 0,
  `custom` tinyint(4) DEFAULT 0,
  `rolle` varchar(50) DEFAULT NULL,
  `totp_secret` varchar(64) DEFAULT NULL,
  `totp_active` tinyint(1) NOT NULL DEFAULT 0,
  `kontakte` tinyint(4) DEFAULT 0,
  `ziele` tinyint(4) DEFAULT 0,
  `aktiv` tinyint(1) NOT NULL DEFAULT 1,
  `abteilung_id` int(11) DEFAULT NULL,
  `no_mail` tinyint(1) NOT NULL DEFAULT 0,
  `totp_fehlversuche` tinyint(3) UNSIGNED NOT NULL DEFAULT 0,
  `totp_gesperrt_bis` datetime DEFAULT NULL,
  `schwachstellen` tinyint(4) NOT NULL DEFAULT 0,
  `abwesend_von` date DEFAULT NULL,
  `abwesend_bis` date DEFAULT NULL,
  `vertreter_id` int(11) DEFAULT NULL,
  `login_fehlversuche` tinyint(3) UNSIGNED NOT NULL DEFAULT 0,
  `login_gesperrt_bis` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf16 COLLATE=utf16_german2_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `user_rollen`
--

CREATE TABLE `user_rollen` (
  `user_id` int(11) NOT NULL,
  `rolle_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `vendor`
--

CREATE TABLE `vendor` (
  `id` int(10) UNSIGNED NOT NULL,
  `nummer` varchar(64) DEFAULT NULL,
  `name` varchar(64) DEFAULT NULL,
  `personendaten` int(10) UNSIGNED DEFAULT 0,
  `vertrag` int(10) UNSIGNED DEFAULT 0,
  `recht` int(10) UNSIGNED DEFAULT 0,
  `zert` int(10) UNSIGNED DEFAULT 0,
  `sicher` int(10) UNSIGNED DEFAULT 0,
  `status` varchar(255) DEFAULT NULL,
  `typ` int(11) DEFAULT NULL,
  `tier` int(10) UNSIGNED DEFAULT 0,
  `besitzer` int(10) UNSIGNED DEFAULT 0,
  `Ersteller` int(10) UNSIGNED NOT NULL,
  `erstellt` date NOT NULL DEFAULT current_timestamp(),
  `Änderer` int(10) UNSIGNED DEFAULT 0,
  `geändert` date NOT NULL DEFAULT current_timestamp(),
  `fragebogen` int(11) DEFAULT 0,
  `Ansprechpartner` varchar(256) DEFAULT NULL,
  `email` varchar(64) DEFAULT NULL,
  `Reviewer` int(11) NOT NULL DEFAULT 0,
  `review` date NOT NULL DEFAULT current_timestamp(),
  `schutz` int(10) UNSIGNED DEFAULT 0,
  `risiko` varchar(16) DEFAULT NULL,
  `frueher` int(10) UNSIGNED NOT NULL DEFAULT 0,
  `massnahmen` varchar(256) DEFAULT NULL,
  `risikoscore` decimal(11,0) DEFAULT 0,
  `typ_old` varchar(255) DEFAULT NULL,
  `assets` text DEFAULT NULL,
  `cloud_exit` mediumtext DEFAULT NULL,
  `beschreibung` mediumtext DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `vendor_anhaenge`
--

CREATE TABLE `vendor_anhaenge` (
  `id` int(11) NOT NULL,
  `vendor_id` int(11) NOT NULL,
  `original_name` varchar(255) NOT NULL,
  `stored_name` varchar(255) NOT NULL,
  `rel_path` varchar(255) NOT NULL,
  `mime_type` varchar(100) NOT NULL,
  `file_size` int(11) NOT NULL,
  `beschreibung` varchar(255) DEFAULT NULL,
  `ersteller` int(11) DEFAULT NULL,
  `erstellt` date NOT NULL,
  `aenderer` int(11) DEFAULT NULL,
  `geaendert` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `vendor_fragebogen`
--

CREATE TABLE `vendor_fragebogen` (
  `id` int(11) NOT NULL,
  `vendor_id` int(11) NOT NULL,
  `token` varchar(64) NOT NULL,
  `empfaenger` varchar(255) NOT NULL DEFAULT '',
  `ansprechpartner` varchar(256) NOT NULL DEFAULT '',
  `sprache` varchar(2) NOT NULL DEFAULT 'de',
  `status` varchar(20) NOT NULL DEFAULT 'versendet',
  `erstellt` datetime NOT NULL,
  `ablauf` datetime NOT NULL,
  `versendet_von` int(11) NOT NULL DEFAULT 0,
  `versendet_am` datetime DEFAULT NULL,
  `beantwortet_am` datetime DEFAULT NULL,
  `beantwortet_von` varchar(256) NOT NULL DEFAULT '',
  `quelle` varchar(20) NOT NULL DEFAULT 'link',
  `erfasst_von` int(11) NOT NULL DEFAULT 0,
  `eingang_am` date DEFAULT NULL,
  `bemerkung` varchar(500) NOT NULL DEFAULT '',
  `anhang_id` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `vendor_fragebogen_antwort`
--

CREATE TABLE `vendor_fragebogen_antwort` (
  `id` int(11) NOT NULL,
  `fragebogen_id` int(11) NOT NULL,
  `frage_id` int(11) NOT NULL DEFAULT 0,
  `reihenfolge` int(11) NOT NULL DEFAULT 0,
  `kategorie` varchar(120) NOT NULL DEFAULT '',
  `frage` varchar(500) NOT NULL,
  `norm_ref` varchar(200) NOT NULL DEFAULT '',
  `antworttyp` varchar(20) NOT NULL DEFAULT 'ja_nein',
  `pflicht` tinyint(1) NOT NULL DEFAULT 0,
  `antwort` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `vendor_frage_katalog`
--

CREATE TABLE `vendor_frage_katalog` (
  `id` int(11) NOT NULL,
  `reihenfolge` int(11) NOT NULL DEFAULT 0,
  `kategorie` varchar(120) NOT NULL DEFAULT '',
  `kategorie_en` varchar(120) NOT NULL DEFAULT '',
  `frage` varchar(500) NOT NULL,
  `frage_en` varchar(500) NOT NULL DEFAULT '',
  `norm_ref` varchar(200) NOT NULL DEFAULT '',
  `antworttyp` varchar(20) NOT NULL DEFAULT 'ja_nein',
  `pflicht` tinyint(1) NOT NULL DEFAULT 0,
  `aktiv` tinyint(1) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

--
-- Daten für Tabelle `vendor_frage_katalog`
--

INSERT INTO `vendor_frage_katalog` (`id`, `reihenfolge`, `kategorie`, `kategorie_en`, `frage`, `frage_en`, `norm_ref`, `antworttyp`, `pflicht`, `aktiv`) VALUES
(1, 10, '1. Angaben zum Unternehmen', '1. Company details', 'Firmenname und Rechtsform Ihres Unternehmens', 'Company name and legal form', '', 'text', 1, 1),
(2, 20, '1. Angaben zum Unternehmen', '1. Company details', 'Anschrift des Hauptsitzes', 'Address of the head office', '', 'text', 1, 1),
(3, 30, '1. Angaben zum Unternehmen', '1. Company details', 'Welche Leistungen erbringen Sie für unser Unternehmen?', 'Which services do you provide to our company?', '', 'langtext', 1, 1),
(4, 40, '1. Angaben zum Unternehmen', '1. Company details', 'Name, Funktion und Kontaktdaten der/des Verantwortlichen für Informationssicherheit', 'Name, role and contact details of the person responsible for information security', 'ISO/IEC 27001:2022 5.3', 'text', 1, 1),
(5, 50, '1. Angaben zum Unternehmen', '1. Company details', 'In welchen Ländern werden Daten unseres Unternehmens verarbeitet oder gespeichert?', 'In which countries is our company data processed or stored?', 'DSGVO Art. 44 ff.', 'text', 0, 1),
(6, 60, '2. Informationssicherheits-Managementsystem', '2. Information security management system', 'Ist ein dokumentiertes Informationssicherheits-Managementsystem (ISMS) eingeführt?', 'Has a documented information security management system (ISMS) been established?', 'ISO/IEC 27001:2022 Kap. 4–10; NIS2 Art. 21(2)(a)', 'ja_nein', 1, 1),
(7, 70, '2. Informationssicherheits-Managementsystem', '2. Information security management system', 'Besteht eine gültige Zertifizierung nach ISO/IEC 27001?', 'Do you hold a valid ISO/IEC 27001 certification?', 'ISO/IEC 27001:2022', 'ja_nein', 1, 1),
(8, 80, '2. Informationssicherheits-Managementsystem', '2. Information security management system', 'Falls zertifiziert: Zertifikatsnummer, Zertifizierungsstelle und Gültigkeit bis', 'If certified: certificate number, certification body and validity', 'ISO/IEC 27001:2022', 'text', 0, 1),
(9, 90, '2. Informationssicherheits-Managementsystem', '2. Information security management system', 'Bestehen weitere Zertifizierungen oder Testate (z. B. TISAX, SOC 2 Typ II, BSI IT-Grundschutz, ISO 22301)?', 'Do you hold further certifications or attestations (e.g. TISAX, SOC 2 Type II, BSI IT-Grundschutz, ISO 22301)?', '', 'text', 0, 1),
(10, 100, '2. Informationssicherheits-Managementsystem', '2. Information security management system', 'Gibt es eine von der Leitung verabschiedete Informationssicherheitsleitlinie?', 'Is there an information security policy approved by top management?', 'ISO/IEC 27001:2022 5.2, A.5.1; NIS2 Art. 21(2)(a)', 'ja_nein', 0, 1),
(11, 110, '2. Informationssicherheits-Managementsystem', '2. Information security management system', 'Ist die Geschäftsleitung nachweislich in die Steuerung der Informationssicherheit eingebunden (Rollen, Ressourcen, Schulung)?', 'Is top management demonstrably involved in steering information security (roles, resources, training)?', 'NIS2 Art. 20', 'ja_nein', 0, 1),
(12, 120, '2. Informationssicherheits-Managementsystem', '2. Information security management system', 'Wann fand das letzte interne Audit bzw. die letzte Managementbewertung statt?', 'When did the last internal audit or management review take place?', 'ISO/IEC 27001:2022 9.2, 9.3', 'datum', 0, 1),
(13, 130, '3. Risikomanagement', '3. Risk management', 'Wird ein dokumentiertes Risikomanagement für Informationssicherheit betrieben?', 'Do you operate a documented information security risk management process?', 'ISO/IEC 27001:2022 6.1; NIS2 Art. 21(2)(a)', 'ja_nein', 0, 1),
(14, 140, '3. Risikomanagement', '3. Risk management', 'Werden Risiken mindestens jährlich neu bewertet und die Maßnahmen nachverfolgt?', 'Are risks reassessed at least annually and the measures tracked?', 'ISO/IEC 27001:2022 8.2, 8.3', 'ja_nein', 0, 1),
(15, 150, '4. Zugriffssteuerung und Identitäten', '4. Access control and identities', 'Existiert eine dokumentierte Zugriffssteuerungsrichtlinie nach dem Need-to-know-Prinzip?', 'Is there a documented access control policy following the need-to-know principle?', 'ISO/IEC 27001:2022 A.5.15', 'ja_nein', 0, 1),
(16, 160, '4. Zugriffssteuerung und Identitäten', '4. Access control and identities', 'Werden privilegierte Zugänge gesondert vergeben, dokumentiert und regelmäßig überprüft?', 'Are privileged access rights granted separately, documented and reviewed regularly?', 'ISO/IEC 27001:2022 A.8.2', 'ja_nein', 0, 1),
(17, 170, '4. Zugriffssteuerung und Identitäten', '4. Access control and identities', 'Wird Multi-Faktor-Authentifizierung für Fernzugriffe und administrative Zugänge eingesetzt?', 'Is multi-factor authentication used for remote and administrative access?', 'ISO/IEC 27001:2022 A.8.5; NIS2 Art. 21(2)(j)', 'ja_nein', 0, 1),
(18, 180, '4. Zugriffssteuerung und Identitäten', '4. Access control and identities', 'Werden Zugangsberechtigungen beim Ausscheiden von Mitarbeitenden unverzüglich entzogen?', 'Are access rights revoked immediately when staff leave the organisation?', 'ISO/IEC 27001:2022 A.5.11, A.6.5', 'ja_nein', 0, 1),
(19, 190, '5. Kryptographie und Datenschutz', '5. Cryptography and data protection', 'Werden unsere Daten bei der Übertragung verschlüsselt (mindestens TLS 1.2)?', 'Is our data encrypted in transit (TLS 1.2 or higher)?', 'ISO/IEC 27001:2022 A.8.24; NIS2 Art. 21(2)(h)', 'ja_nein', 0, 1),
(20, 200, '5. Kryptographie und Datenschutz', '5. Cryptography and data protection', 'Werden unsere Daten bei der Speicherung verschlüsselt?', 'Is our data encrypted at rest?', 'ISO/IEC 27001:2022 A.8.24; NIS2 Art. 21(2)(h)', 'ja_nein', 0, 1),
(21, 210, '5. Kryptographie und Datenschutz', '5. Cryptography and data protection', 'Besteht eine Richtlinie zum Einsatz kryptographischer Verfahren einschließlich Schlüsselmanagement?', 'Is there a policy on the use of cryptography including key management?', 'ISO/IEC 27001:2022 A.8.24', 'ja_nein', 0, 1),
(22, 220, '5. Kryptographie und Datenschutz', '5. Cryptography and data protection', 'Werden im Rahmen der Leistung personenbezogene Daten verarbeitet, und liegt ein Auftragsverarbeitungsvertrag vor?', 'Is personal data processed as part of the service, and is a data processing agreement in place?', 'DSGVO Art. 28', 'ja_nein', 0, 1),
(23, 230, '5. Kryptographie und Datenschutz', '5. Cryptography and data protection', 'Wie werden Datenträger und Dokumente nach Ablauf der Aufbewahrungsfrist sicher gelöscht oder vernichtet?', 'How are media and documents securely erased or destroyed at the end of the retention period?', 'ISO/IEC 27001:2022 A.7.14, A.8.10', 'langtext', 0, 1),
(24, 240, '6. Physische Sicherheit', '6. Physical security', 'Sind Rechenzentren und Büroräume durch Zutrittskontrollen geschützt?', 'Are data centres and office premises protected by physical access controls?', 'ISO/IEC 27001:2022 A.7.1–A.7.4', 'ja_nein', 0, 1),
(25, 250, '6. Physische Sicherheit', '6. Physical security', 'An welchen Standorten (Ort und Land) befinden sich die Rechenzentren, in denen unsere Daten liegen?', 'At which locations (city and country) are the data centres holding our data?', 'ISO/IEC 27001:2022 A.7.5', 'text', 0, 1),
(26, 260, '7. Betrieb, Verfügbarkeit und Notfallmanagement', '7. Operations, availability and continuity', 'Werden Datensicherungen regelmäßig erstellt, geschützt aufbewahrt und die Wiederherstellung getestet?', 'Are backups created regularly, stored securely and restore tests performed?', 'ISO/IEC 27001:2022 A.8.13; NIS2 Art. 21(2)(c)', 'ja_nein', 0, 1),
(27, 270, '7. Betrieb, Verfügbarkeit und Notfallmanagement', '7. Operations, availability and continuity', 'Existiert ein getestetes Notfall- und Wiederanlaufkonzept für die für uns erbrachten Leistungen?', 'Is there a tested business continuity and disaster recovery plan for the services provided to us?', 'ISO/IEC 27001:2022 A.5.29, A.5.30; NIS2 Art. 21(2)(c)', 'ja_nein', 0, 1),
(28, 280, '7. Betrieb, Verfügbarkeit und Notfallmanagement', '7. Operations, availability and continuity', 'Welche Wiederanlaufzeit (RTO) und welcher maximal tolerierbare Datenverlust (RPO) werden zugesichert?', 'Which recovery time objective (RTO) and recovery point objective (RPO) do you commit to?', 'ISO/IEC 27001:2022 A.5.30', 'text', 0, 1),
(29, 290, '7. Betrieb, Verfügbarkeit und Notfallmanagement', '7. Operations, availability and continuity', 'Werden Systeme protokolliert und die Protokolle zentral ausgewertet (Monitoring/SIEM)?', 'Are systems logged and the logs centrally evaluated (monitoring/SIEM)?', 'ISO/IEC 27001:2022 A.8.15, A.8.16', 'ja_nein', 0, 1),
(30, 300, '7. Betrieb, Verfügbarkeit und Notfallmanagement', '7. Operations, availability and continuity', 'Besteht auf allen relevanten Systemen ein Schutz gegen Schadsoftware?', 'Is protection against malware in place on all relevant systems?', 'ISO/IEC 27001:2022 A.8.7', 'ja_nein', 0, 1),
(31, 310, '8. Schwachstellen- und Änderungsmanagement', '8. Vulnerability and change management', 'Werden Schwachstellen systematisch erfasst und innerhalb definierter Fristen behoben (Patch-Management)?', 'Are vulnerabilities recorded systematically and remediated within defined deadlines (patch management)?', 'ISO/IEC 27001:2022 A.8.8; NIS2 Art. 21(2)(e)', 'ja_nein', 0, 1),
(32, 320, '8. Schwachstellen- und Änderungsmanagement', '8. Vulnerability and change management', 'Werden regelmäßig Schwachstellenscans oder Penetrationstests durchgeführt?', 'Are vulnerability scans or penetration tests carried out regularly?', 'ISO/IEC 27001:2022 A.8.8', 'ja_nein', 0, 1),
(33, 330, '8. Schwachstellen- und Änderungsmanagement', '8. Vulnerability and change management', 'Besteht ein dokumentiertes Änderungsmanagement für produktive Systeme?', 'Is there a documented change management process for production systems?', 'ISO/IEC 27001:2022 A.8.32', 'ja_nein', 0, 1),
(34, 340, '8. Schwachstellen- und Änderungsmanagement', '8. Vulnerability and change management', 'Werden bei Eigenentwicklungen Grundsätze der sicheren Entwicklung angewandt?', 'Are secure development principles applied to in-house software development?', 'ISO/IEC 27001:2022 A.8.25–A.8.28; NIS2 Art. 21(2)(e)', 'ja_nein', 0, 1),
(35, 350, '9. Sicherheitsvorfälle und Meldepflichten', '9. Security incidents and reporting duties', 'Existiert ein dokumentierter Prozess zur Behandlung von Sicherheitsvorfällen mit benannten Verantwortlichen?', 'Is there a documented incident handling process with designated responsibilities?', 'ISO/IEC 27001:2022 A.5.24–A.5.26; NIS2 Art. 21(2)(b)', 'ja_nein', 1, 1),
(36, 360, '9. Sicherheitsvorfälle und Meldepflichten', '9. Security incidents and reporting duties', 'Sagen Sie zu, uns Sicherheitsvorfälle mit Auswirkung auf unsere Daten oder Leistungen unverzüglich, spätestens innerhalb von 24 Stunden, zu melden?', 'Do you commit to reporting security incidents affecting our data or services without undue delay, at the latest within 24 hours?', 'NIS2 Art. 23; ISO/IEC 27001:2022 A.5.5', 'ja_nein', 1, 1),
(37, 370, '9. Sicherheitsvorfälle und Meldepflichten', '9. Security incidents and reporting duties', 'Über welche Adresse und Rufnummer können wir Sicherheitsvorfälle rund um die Uhr melden?', 'Which address and phone number can we use to report security incidents around the clock?', 'ISO/IEC 27001:2022 A.5.24', 'text', 1, 1),
(38, 380, '9. Sicherheitsvorfälle und Meldepflichten', '9. Security incidents and reporting duties', 'Gab es in den letzten 24 Monaten meldepflichtige Sicherheitsvorfälle mit Auswirkung auf Kundendaten?', 'Were there any reportable security incidents affecting customer data in the last 24 months?', 'NIS2 Art. 23', 'ja_nein', 0, 1),
(39, 390, '9. Sicherheitsvorfälle und Meldepflichten', '9. Security incidents and reporting duties', 'Falls ja: Bitte beschreiben Sie den Vorfall und die ergriffenen Maßnahmen.', 'If yes: please describe the incident and the measures taken.', '', 'langtext', 0, 1),
(40, 400, '10. Lieferkette und Subunternehmer', '10. Supply chain and subcontractors', 'Setzen Sie zur Erbringung der Leistung Subunternehmer oder Cloud-Dienste ein?', 'Do you use subcontractors or cloud services to deliver the service?', 'ISO/IEC 27001:2022 A.5.21; NIS2 Art. 21(2)(d)', 'ja_nein', 0, 1),
(41, 410, '10. Lieferkette und Subunternehmer', '10. Supply chain and subcontractors', 'Falls ja: Welche Subunternehmer bzw. Dienste sind das, und in welchen Ländern sind sie tätig?', 'If yes: which subcontractors or services are these, and in which countries do they operate?', 'ISO/IEC 27001:2022 A.5.21', 'langtext', 0, 1),
(42, 420, '10. Lieferkette und Subunternehmer', '10. Supply chain and subcontractors', 'Werden Ihre Subunternehmer vertraglich auf gleichwertige Sicherheitsanforderungen verpflichtet und regelmäßig überprüft?', 'Are your subcontractors contractually bound to equivalent security requirements and reviewed regularly?', 'ISO/IEC 27001:2022 A.5.19–A.5.22; NIS2 Art. 21(2)(d)', 'ja_nein', 0, 1),
(43, 430, '11. Personal und Sensibilisierung', '11. Personnel and awareness', 'Werden Mitarbeitende vor Aufnahme der Tätigkeit überprüft, soweit rechtlich zulässig?', 'Are staff screened before employment, as far as legally permitted?', 'ISO/IEC 27001:2022 A.6.1', 'ja_nein', 0, 1),
(44, 440, '11. Personal und Sensibilisierung', '11. Personnel and awareness', 'Sind alle Mitarbeitenden zur Vertraulichkeit verpflichtet (Geheimhaltungsvereinbarung)?', 'Are all staff bound by confidentiality (non-disclosure agreement)?', 'ISO/IEC 27001:2022 A.6.6', 'ja_nein', 0, 1),
(45, 450, '11. Personal und Sensibilisierung', '11. Personnel and awareness', 'Finden mindestens jährlich Schulungen zur Informationssicherheit statt?', 'Are information security awareness trainings held at least annually?', 'ISO/IEC 27001:2022 A.6.3; NIS2 Art. 21(2)(g)', 'ja_nein', 0, 1),
(46, 460, '12. Nachweise und Abschluss', '12. Evidence and completion', 'Gewähren Sie uns oder einem von uns beauftragten Dritten auf Anfrage Audit- und Nachweisrechte?', 'Do you grant us or a third party appointed by us audit and evidence rights on request?', 'ISO/IEC 27001:2022 A.5.22', 'ja_nein', 0, 1),
(47, 470, '12. Nachweise und Abschluss', '12. Evidence and completion', 'Welche Nachweise können Sie zu diesem Fragebogen vorlegen (Zertifikate, Auditberichte, Erklärung zur Anwendbarkeit)?', 'Which evidence can you provide alongside this questionnaire (certificates, audit reports, statement of applicability)?', '', 'langtext', 0, 1),
(48, 480, '12. Nachweise und Abschluss', '12. Evidence and completion', 'Ergänzende Anmerkungen', 'Additional remarks', '', 'langtext', 0, 1),
(49, 490, '12. Nachweise und Abschluss', '12. Evidence and completion', 'Name und Funktion der ausfüllenden Person', 'Name and role of the person completing this questionnaire', '', 'text', 1, 1);

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `vendor_gewichte`
--

CREATE TABLE `vendor_gewichte` (
  `id` int(10) UNSIGNED NOT NULL,
  `bereich` varchar(32) NOT NULL,
  `parameter` varchar(64) NOT NULL,
  `bezeichnung` varchar(128) NOT NULL,
  `wert_ja` tinyint(4) NOT NULL DEFAULT 0,
  `wert_teilweise` tinyint(4) NOT NULL DEFAULT 2,
  `wert_nein` tinyint(4) NOT NULL DEFAULT 5,
  `reihenfolge` tinyint(4) NOT NULL DEFAULT 0,
  `bezeichnung_en` varchar(128) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `vendor_gewichte`
--

INSERT INTO `vendor_gewichte` (`id`, `bereich`, `parameter`, `bezeichnung`, `wert_ja`, `wert_teilweise`, `wert_nein`, `reihenfolge`, `bezeichnung_en`) VALUES
(1, 'vendor_eintritt', 'zert', 'Zertifizierung vorhanden? (ISO 27001, SOC2 etc.)', 0, 2, 5, 1, NULL),
(2, 'vendor_eintritt', 'frage', 'Sicherheitsfragebogen ausgefüllt?', 0, 2, 5, 2, NULL),
(3, 'vendor_eintritt', 'vertrag', 'Vertragliche Regelung / AVV vorhanden?', 0, 2, 5, 3, NULL),
(4, 'vendor_eintritt', 'frueher', 'Früherer Sicherheitsvorfall beim Lieferanten?', 0, 2, 5, 4, NULL),
(5, 'vendor_schaden', 'pers', 'Verarbeitung personenbezogener Daten (DSGVO)?', 5, 2, 0, 1, NULL),
(6, 'vendor_schaden', 'schutz', 'Hoher Schutzbedarf der Systeme / Daten?', 5, 2, 0, 2, NULL),
(7, 'vendor_schaden', 'tier', 'Tier-Kritikalität (1=unkritisch, 3=kritisch)', 5, 4, 2, 3, NULL),
(8, 'vendor_schaden', 'recht', 'Rechtliche / Compliance-Anforderungen verletzt?', 5, 2, 0, 4, NULL);

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `vendor_historie`
--

CREATE TABLE `vendor_historie` (
  `id` int(10) UNSIGNED NOT NULL,
  `vendor_id` int(10) UNSIGNED NOT NULL,
  `eintritt` int(11) NOT NULL,
  `schaden` int(11) NOT NULL,
  `riskscore` int(11) NOT NULL,
  `datum` date NOT NULL DEFAULT current_timestamp(),
  `user` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `vendor_kurzbewertung`
--

CREATE TABLE `vendor_kurzbewertung` (
  `id` int(10) UNSIGNED NOT NULL,
  `kurzbewertung` varchar(64) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `vendor_kurzbewertung`
--

INSERT INTO `vendor_kurzbewertung` (`id`, `kurzbewertung`) VALUES
(1, 'Ja'),
(2, 'Nein'),
(3, 'Teilweise'),
(4, 'N/A');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `vendor_status`
--

CREATE TABLE `vendor_status` (
  `id` int(10) UNSIGNED NOT NULL,
  `status` varchar(64) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `vendor_status`
--

INSERT INTO `vendor_status` (`id`, `status`) VALUES
(1, 'Aktiv'),
(2, 'Onboarding'),
(3, 'Inaktiv'),
(4, 'Offboarding'),
(5, 'Evaluierung');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `vendor_tier`
--

CREATE TABLE `vendor_tier` (
  `id` int(10) UNSIGNED NOT NULL,
  `tier` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `vendor_tier`
--

INSERT INTO `vendor_tier` (`id`, `tier`) VALUES
(1, 'unwesentlich'),
(2, 'wesentlich'),
(3, 'geschäftskritisch'),
(4, 'missionskritisch');

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `vendor_typ`
--

CREATE TABLE `vendor_typ` (
  `id` int(10) UNSIGNED NOT NULL,
  `Typ` varchar(64) NOT NULL,
  `cloud` tinyint(1) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Daten für Tabelle `vendor_typ`
--

INSERT INTO `vendor_typ` (`id`, `Typ`, `cloud`) VALUES
(1, 'Dienstleister', 0),
(2, 'Softwareanbieter', 0),
(3, 'Cloud Anbieter', 1),
(4, 'Andere', 0),
(5, 'Hardwareanbieter', 0),
(6, 'Telekommunikation', 0);

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `ziele_kpi`
--

CREATE TABLE `ziele_kpi` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(200) NOT NULL,
  `beschreibung` text DEFAULT NULL,
  `einheit` varchar(50) DEFAULT NULL,
  `zielwert` decimal(14,2) DEFAULT NULL,
  `richtung` varchar(20) NOT NULL DEFAULT 'hoeher_besser',
  `sortierung` int(11) NOT NULL DEFAULT 0,
  `ersteller` int(10) UNSIGNED DEFAULT NULL,
  `erstellt_am` datetime NOT NULL DEFAULT current_timestamp(),
  `aenderer` int(10) UNSIGNED DEFAULT NULL,
  `geaendert_am` datetime DEFAULT NULL ON UPDATE current_timestamp(),
  `name_en` text DEFAULT NULL,
  `beschreibung_en` text DEFAULT NULL,
  `einheit_en` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `ziele_kpi_historie`
--

CREATE TABLE `ziele_kpi_historie` (
  `id` int(10) UNSIGNED NOT NULL,
  `kpi_id` int(10) UNSIGNED NOT NULL,
  `wert` decimal(14,2) NOT NULL,
  `datum` date NOT NULL,
  `kommentar` text DEFAULT NULL,
  `ersteller` int(10) UNSIGNED DEFAULT NULL,
  `erstellt_am` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `ziele_texte`
--

CREATE TABLE `ziele_texte` (
  `id` int(10) UNSIGNED NOT NULL,
  `unternehmensziele` text DEFAULT NULL,
  `is_ziele` text DEFAULT NULL,
  `geaendert_von` int(10) UNSIGNED DEFAULT NULL,
  `geaendert_am` datetime DEFAULT NULL,
  `unternehmensziele_en` text DEFAULT NULL,
  `is_ziele_en` text DEFAULT NULL,
  `scope` text DEFAULT NULL,
  `scope_en` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `zugriff_asset`
--

CREATE TABLE `zugriff_asset` (
  `asset_id` int(10) UNSIGNED NOT NULL,
  `genehmigende_instanz` varchar(255) DEFAULT NULL,
  `rezert_frequenz` varchar(40) DEFAULT NULL,
  `zugang` varchar(60) DEFAULT NULL,
  `auflagen` text DEFAULT NULL,
  `aenderer` int(10) UNSIGNED DEFAULT NULL,
  `geaendert_am` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `zugriff_matrix`
--

CREATE TABLE `zugriff_matrix` (
  `id` int(10) UNSIGNED NOT NULL,
  `asset_id` int(10) UNSIGNED NOT NULL,
  `rolle_id` int(10) UNSIGNED NOT NULL,
  `stufe` varchar(2) NOT NULL DEFAULT 'n',
  `zugang` varchar(60) DEFAULT NULL,
  `genehmiger` int(10) UNSIGNED DEFAULT NULL,
  `genehmigt_am` date DEFAULT NULL,
  `letzte_pruefung` date DEFAULT NULL,
  `naechste_pruefung` date DEFAULT NULL,
  `begruendung` text DEFAULT NULL,
  `ersteller` int(10) UNSIGNED DEFAULT NULL,
  `erstellt_am` datetime NOT NULL DEFAULT current_timestamp(),
  `aenderer` int(10) UNSIGNED DEFAULT NULL,
  `geaendert_am` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Tabellenstruktur für Tabelle `zugriff_rolle`
--

CREATE TABLE `zugriff_rolle` (
  `rolle_id` int(10) UNSIGNED NOT NULL,
  `kuerzel` varchar(10) DEFAULT NULL,
  `org_einheit` varchar(255) DEFAULT NULL,
  `genehmigende_instanz` varchar(255) DEFAULT NULL,
  `privilegiert` tinyint(1) NOT NULL DEFAULT 0,
  `beschreibung` text DEFAULT NULL,
  `sortierung` int(11) NOT NULL DEFAULT 0,
  `aktiv` tinyint(1) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Indizes der exportierten Tabellen
--

--
-- Indizes für die Tabelle `Abteilungen`
--
ALTER TABLE `Abteilungen`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `idx_abteilungen_name` (`name`),
  ADD KEY `idx_abteilungen_parent` (`parent_id`),
  ADD KEY `idx_abteilungen_leitung` (`leitung_id`);

--
-- Indizes für die Tabelle `activities`
--
ALTER TABLE `activities`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `api_keys`
--
ALTER TABLE `api_keys`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_key_hash` (`key_hash`);

--
-- Indizes für die Tabelle `Assets`
--
ALTER TABLE `Assets`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `asset_art_pbd`
--
ALTER TABLE `asset_art_pbd`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `art` (`art`);

--
-- Indizes für die Tabelle `asset_betroffene_personen`
--
ALTER TABLE `asset_betroffene_personen`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `bezeichnung` (`bezeichnung`);

--
-- Indizes für die Tabelle `asset_datenhaltung`
--
ALTER TABLE `asset_datenhaltung`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `datenhaltung` (`datenhaltung`);

--
-- Indizes für die Tabelle `asset_kategorie`
--
ALTER TABLE `asset_kategorie`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `asset_status`
--
ALTER TABLE `asset_status`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `asset_typ`
--
ALTER TABLE `asset_typ`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `typ` (`typ`);

--
-- Indizes für die Tabelle `Audit`
--
ALTER TABLE `Audit`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `AuditCE`
--
ALTER TABLE `AuditCE`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `AuditDSGVO`
--
ALTER TABLE `AuditDSGVO`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `AuditNIS2`
--
ALTER TABLE `AuditNIS2`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `AuditTISAX`
--
ALTER TABLE `AuditTISAX`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `AuditVdS`
--
ALTER TABLE `AuditVdS`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `aud_abweichungen`
--
ALTER TABLE `aud_abweichungen`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_audit` (`audit_id`),
  ADD KEY `idx_nummer` (`nummer`),
  ADD KEY `idx_status` (`status`);

--
-- Indizes für die Tabelle `aud_anhaenge`
--
ALTER TABLE `aud_anhaenge`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_audit` (`audit_id`);

--
-- Indizes für die Tabelle `aud_audits`
--
ALTER TABLE `aud_audits`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_nummer` (`nummer`),
  ADD KEY `idx_status` (`status`),
  ADD KEY `idx_von` (`datum_von`);

--
-- Indizes für die Tabelle `aud_gap_fortschritt`
--
ALTER TABLE `aud_gap_fortschritt`
  ADD PRIMARY KEY (`audit_id`,`kapitel`);

--
-- Indizes für die Tabelle `aud_pruefpunkte`
--
ALTER TABLE `aud_pruefpunkte`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_audit` (`audit_id`),
  ADD KEY `idx_bewertung` (`bewertung`),
  ADD KEY `idx_norm_id` (`norm_id`);

--
-- Indizes für die Tabelle `Auswirkung`
--
ALTER TABLE `Auswirkung`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `bcm_bia`
--
ALTER TABLE `bcm_bia`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uk_prozess` (`prozess_id`);

--
-- Indizes für die Tabelle `bcm_notfallplaene`
--
ALTER TABLE `bcm_notfallplaene`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `bcm_prozesse`
--
ALTER TABLE `bcm_prozesse`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `bcm_uebungen`
--
ALTER TABLE `bcm_uebungen`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `bcm_uebung_anhaenge`
--
ALTER TABLE `bcm_uebung_anhaenge`
  ADD PRIMARY KEY (`id`),
  ADD KEY `uebung_id` (`uebung_id`);

--
-- Indizes für die Tabelle `bedrohungen`
--
ALTER TABLE `bedrohungen`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `bedrohung_kategorie`
--
ALTER TABLE `bedrohung_kategorie`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `idx_bedrohung_kategorie_name` (`name`);

--
-- Indizes für die Tabelle `bericht_art`
--
ALTER TABLE `bericht_art`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `bpmn_dokumente`
--
ALTER TABLE `bpmn_dokumente`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `chm_changes`
--
ALTER TABLE `chm_changes`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_chg_nummer` (`nummer`),
  ADD KEY `idx_chg_status` (`status`),
  ADD KEY `idx_chg_fenster` (`geplant_von`);

--
-- Indizes für die Tabelle `chm_freigaben`
--
ALTER TABLE `chm_freigaben`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_chg_user` (`change_id`,`user_id`),
  ADD KEY `idx_chg_frg` (`change_id`,`stufe`);

--
-- Indizes für die Tabelle `chm_historie`
--
ALTER TABLE `chm_historie`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_hist_chg` (`change_id`,`id`);

--
-- Indizes für die Tabelle `cron_settings`
--
ALTER TABLE `cron_settings`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_job_key` (`job_key`);

--
-- Indizes für die Tabelle `Dokumente`
--
ALTER TABLE `Dokumente`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_dok_stamm` (`stamm_id`);
ALTER TABLE `Dokumente` ADD FULLTEXT KEY `ft_titel_text` (`Dokumentenname`,`Text`);

--
-- Indizes für die Tabelle `dok_anhaenge`
--
ALTER TABLE `dok_anhaenge`
  ADD PRIMARY KEY (`id`),
  ADD KEY `mass_id` (`dok_id`);

--
-- Indizes für die Tabelle `dok_historie`
--
ALTER TABLE `dok_historie`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `dok_lesebestaetigung`
--
ALTER TABLE `dok_lesebestaetigung`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_lesebest_user` (`user_id`),
  ADD KEY `idx_lesebest_dok` (`dok_id`);

--
-- Indizes für die Tabelle `dok_lesepflicht`
--
ALTER TABLE `dok_lesepflicht`
  ADD PRIMARY KEY (`dok_id`,`rolle_id`),
  ADD KEY `idx_dok_lesepflicht_rolle` (`rolle_id`);

--
-- Indizes für die Tabelle `dok_status`
--
ALTER TABLE `dok_status`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `dok_typ`
--
ALTER TABLE `dok_typ`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `dok_typ_en`
--
ALTER TABLE `dok_typ_en`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `Gefaehrdungen`
--
ALTER TABLE `Gefaehrdungen`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `Incidents`
--
ALTER TABLE `Incidents`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `inc_link`
--
ALTER TABLE `inc_link`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `inc_meldepflicht`
--
ALTER TABLE `inc_meldepflicht`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_inc_rw` (`incident_id`,`regelwerk`);

--
-- Indizes für die Tabelle `inc_meldungen`
--
ALTER TABLE `inc_meldungen`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_inc` (`incident_id`);

--
-- Indizes für die Tabelle `ismshilfe`
--
ALTER TABLE `ismshilfe`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `isms_kontext`
--
ALTER TABLE `isms_kontext`
  ADD PRIMARY KEY (`schluessel`);

--
-- Indizes für die Tabelle `isms_module`
--
ALTER TABLE `isms_module`
  ADD PRIMARY KEY (`modul`);

--
-- Indizes für die Tabelle `isms_settings`
--
ALTER TABLE `isms_settings`
  ADD PRIMARY KEY (`key`);

--
-- Indizes für die Tabelle `ki_dialog`
--
ALTER TABLE `ki_dialog`
  ADD PRIMARY KEY (`bereich`,`benutzer`);

--
-- Indizes für die Tabelle `ki_jobs`
--
ALTER TABLE `ki_jobs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `angelegt` (`angelegt`);

--
-- Indizes für die Tabelle `ki_prompts`
--
ALTER TABLE `ki_prompts`
  ADD PRIMARY KEY (`schluessel`);

--
-- Indizes für die Tabelle `ki_verbrauch`
--
ALTER TABLE `ki_verbrauch`
  ADD PRIMARY KEY (`id`),
  ADD KEY `zeitpunkt` (`zeitpunkt`),
  ADD KEY `bereich` (`bereich`);

--
-- Indizes für die Tabelle `klassifizierung`
--
ALTER TABLE `klassifizierung`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `klassifizierung_en`
--
ALTER TABLE `klassifizierung_en`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `kommentare`
--
ALTER TABLE `kommentare`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_komm_obj` (`bereich`,`objekt_id`);

--
-- Indizes für die Tabelle `kontakte_behoerden`
--
ALTER TABLE `kontakte_behoerden`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `kontakte_dienstleister`
--
ALTER TABLE `kontakte_dienstleister`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `kontakte_interessensgruppen`
--
ALTER TABLE `kontakte_interessensgruppen`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `kontakte_kunden`
--
ALTER TABLE `kontakte_kunden`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `kontakte_mitarbeiter`
--
ALTER TABLE `kontakte_mitarbeiter`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `kritikalität`
--
ALTER TABLE `kritikalität`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `Links`
--
ALTER TABLE `Links`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `Massnahmen`
--
ALTER TABLE `Massnahmen`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `mass_anhaenge`
--
ALTER TABLE `mass_anhaenge`
  ADD PRIMARY KEY (`id`),
  ADD KEY `mass_id` (`mass_id`);

--
-- Indizes für die Tabelle `mgmt_review`
--
ALTER TABLE `mgmt_review`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `netzwerkzonen`
--
ALTER TABLE `netzwerkzonen`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_nz_parent` (`parent_id`),
  ADD KEY `idx_nz_kategorie` (`kategorie`);

--
-- Indizes für die Tabelle `Normen`
--
ALTER TABLE `Normen`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_normen_geloescht` (`gelöscht`);

--
-- Indizes für die Tabelle `norm_status`
--
ALTER TABLE `norm_status`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `objekt_besitzer`
--
ALTER TABLE `objekt_besitzer`
  ADD PRIMARY KEY (`tabelle`,`objekt_id`,`user_id`),
  ADD KEY `idx_objekt_besitzer_user` (`user_id`);

--
-- Indizes für die Tabelle `op_plan`
--
ALTER TABLE `op_plan`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_kette` (`kette_id`),
  ADD KEY `idx_aktuell` (`ist_aktuell`);

--
-- Indizes für die Tabelle `Personal`
--
ALTER TABLE `Personal`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `pers_onboarding`
--
ALTER TABLE `pers_onboarding`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_art` (`art`),
  ADD KEY `idx_user` (`user_id`);

--
-- Indizes für die Tabelle `pers_onb_equipment`
--
ALTER TABLE `pers_onb_equipment`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_vorgang` (`vorgang_id`);

--
-- Indizes für die Tabelle `pers_onb_zugaenge`
--
ALTER TABLE `pers_onb_zugaenge`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_vorgang` (`vorgang_id`);

--
-- Indizes für die Tabelle `pers_schulungen`
--
ALTER TABLE `pers_schulungen`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_datum` (`datum`);

--
-- Indizes für die Tabelle `pers_schulung_teilnehmer`
--
ALTER TABLE `pers_schulung_teilnehmer`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_schulung_user` (`schulung_id`,`user_id`),
  ADD KEY `idx_user` (`user_id`);

--
-- Indizes für die Tabelle `plaene_dateien`
--
ALTER TABLE `plaene_dateien`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_art` (`art`);

--
-- Indizes für die Tabelle `playbooks`
--
ALTER TABLE `playbooks`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `Projekte`
--
ALTER TABLE `Projekte`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `prozesslandkarte`
--
ALTER TABLE `prozesslandkarte`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_pl_parent` (`parent_id`),
  ADD KEY `idx_pl_kategorie` (`kategorie`);

--
-- Indizes für die Tabelle `pw_reset_tokens`
--
ALTER TABLE `pw_reset_tokens`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `idx_pwrt_token` (`token`),
  ADD KEY `idx_pwrt_user` (`user_id`);

--
-- Indizes für die Tabelle `rechtsregister`
--
ALTER TABLE `rechtsregister`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_rr_status` (`status`),
  ADD KEY `idx_rr_kuerzel` (`kuerzel`),
  ADD KEY `idx_rr_kategorie` (`kategorie`);

--
-- Indizes für die Tabelle `rest_console_log`
--
ALTER TABLE `rest_console_log`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `Risiko`
--
ALTER TABLE `Risiko`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `Risiko_historie`
--
ALTER TABLE `Risiko_historie`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `risiko_kategorie`
--
ALTER TABLE `risiko_kategorie`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `risiko_score`
--
ALTER TABLE `risiko_score`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `risiko_score_historie`
--
ALTER TABLE `risiko_score_historie`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uniq_datum` (`datum`);

--
-- Indizes für die Tabelle `risiko_status`
--
ALTER TABLE `risiko_status`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `Rollen`
--
ALTER TABLE `Rollen`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `schwachstellen`
--
ALTER TABLE `schwachstellen`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `schwachstelle_kategorie`
--
ALTER TABLE `schwachstelle_kategorie`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `idx_schwachstelle_kategorie_name` (`name`);

--
-- Indizes für die Tabelle `setup_angelegt`
--
ALTER TABLE `setup_angelegt`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_setup_angelegt` (`teil`,`tabelle`);

--
-- Indizes für die Tabelle `setup_fortschritt`
--
ALTER TABLE `setup_fortschritt`
  ADD PRIMARY KEY (`schritt`);

--
-- Indizes für die Tabelle `setup_ki_dialog`
--
ALTER TABLE `setup_ki_dialog`
  ADD PRIMARY KEY (`schritt`);

--
-- Indizes für die Tabelle `smtp_settings`
--
ALTER TABLE `smtp_settings`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `sql_console_log`
--
ALTER TABLE `sql_console_log`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `sso_settings`
--
ALTER TABLE `sso_settings`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `Stammdaten`
--
ALTER TABLE `Stammdaten`
  ADD PRIMARY KEY (`Nummer`);

--
-- Indizes für die Tabelle `stamm_kategorie`
--
ALTER TABLE `stamm_kategorie`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_sk_name` (`bereich`,`name`),
  ADD KEY `idx_sk_bereich` (`bereich`,`sortierung`);

--
-- Indizes für die Tabelle `stamm_kategorie_bereich`
--
ALTER TABLE `stamm_kategorie_bereich`
  ADD PRIMARY KEY (`bereich`);

--
-- Indizes für die Tabelle `swm_schwachstellen`
--
ALTER TABLE `swm_schwachstellen`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_nummer` (`nummer`),
  ADD KEY `idx_status` (`status`);

--
-- Indizes für die Tabelle `tooltip_texte`
--
ALTER TABLE `tooltip_texte`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_tooltip` (`bereich`,`art`,`schluessel`);

--
-- Indizes für die Tabelle `unternehmen`
--
ALTER TABLE `unternehmen`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `email` (`email`);

--
-- Indizes für die Tabelle `user_rollen`
--
ALTER TABLE `user_rollen`
  ADD PRIMARY KEY (`user_id`,`rolle_id`),
  ADD KEY `idx_user_rollen_rolle` (`rolle_id`);

--
-- Indizes für die Tabelle `vendor`
--
ALTER TABLE `vendor`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `vendor_anhaenge`
--
ALTER TABLE `vendor_anhaenge`
  ADD PRIMARY KEY (`id`),
  ADD KEY `vendor_id` (`vendor_id`);

--
-- Indizes für die Tabelle `vendor_fragebogen`
--
ALTER TABLE `vendor_fragebogen`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `idx_vfb_token` (`token`),
  ADD KEY `idx_vfb_vendor` (`vendor_id`);

--
-- Indizes für die Tabelle `vendor_fragebogen_antwort`
--
ALTER TABLE `vendor_fragebogen_antwort`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_vfa_bogen` (`fragebogen_id`);

--
-- Indizes für die Tabelle `vendor_frage_katalog`
--
ALTER TABLE `vendor_frage_katalog`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_vfk_sort` (`reihenfolge`);

--
-- Indizes für die Tabelle `vendor_gewichte`
--
ALTER TABLE `vendor_gewichte`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_bereich_param` (`bereich`,`parameter`);

--
-- Indizes für die Tabelle `vendor_historie`
--
ALTER TABLE `vendor_historie`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `vendor_kurzbewertung`
--
ALTER TABLE `vendor_kurzbewertung`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `vendor_status`
--
ALTER TABLE `vendor_status`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `vendor_tier`
--
ALTER TABLE `vendor_tier`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `vendor_typ`
--
ALTER TABLE `vendor_typ`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `ziele_kpi`
--
ALTER TABLE `ziele_kpi`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `ziele_kpi_historie`
--
ALTER TABLE `ziele_kpi_historie`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_kpi` (`kpi_id`);

--
-- Indizes für die Tabelle `ziele_texte`
--
ALTER TABLE `ziele_texte`
  ADD PRIMARY KEY (`id`);

--
-- Indizes für die Tabelle `zugriff_asset`
--
ALTER TABLE `zugriff_asset`
  ADD PRIMARY KEY (`asset_id`);

--
-- Indizes für die Tabelle `zugriff_matrix`
--
ALTER TABLE `zugriff_matrix`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_asset_rolle` (`asset_id`,`rolle_id`),
  ADD KEY `idx_rolle` (`rolle_id`);

--
-- Indizes für die Tabelle `zugriff_rolle`
--
ALTER TABLE `zugriff_rolle`
  ADD PRIMARY KEY (`rolle_id`);

--
-- AUTO_INCREMENT für exportierte Tabellen
--

--
-- AUTO_INCREMENT für Tabelle `Abteilungen`
--
ALTER TABLE `Abteilungen`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=36;

--
-- AUTO_INCREMENT für Tabelle `activities`
--
ALTER TABLE `activities`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2814;

--
-- AUTO_INCREMENT für Tabelle `api_keys`
--
ALTER TABLE `api_keys`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT für Tabelle `Assets`
--
ALTER TABLE `Assets`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=178;

--
-- AUTO_INCREMENT für Tabelle `asset_art_pbd`
--
ALTER TABLE `asset_art_pbd`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT für Tabelle `asset_betroffene_personen`
--
ALTER TABLE `asset_betroffene_personen`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT für Tabelle `asset_datenhaltung`
--
ALTER TABLE `asset_datenhaltung`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT für Tabelle `asset_kategorie`
--
ALTER TABLE `asset_kategorie`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- AUTO_INCREMENT für Tabelle `asset_status`
--
ALTER TABLE `asset_status`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT für Tabelle `asset_typ`
--
ALTER TABLE `asset_typ`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT für Tabelle `Audit`
--
ALTER TABLE `Audit`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=86;

--
-- AUTO_INCREMENT für Tabelle `AuditCE`
--
ALTER TABLE `AuditCE`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;

--
-- AUTO_INCREMENT für Tabelle `AuditDSGVO`
--
ALTER TABLE `AuditDSGVO`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=40;

--
-- AUTO_INCREMENT für Tabelle `AuditNIS2`
--
ALTER TABLE `AuditNIS2`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=54;

--
-- AUTO_INCREMENT für Tabelle `AuditTISAX`
--
ALTER TABLE `AuditTISAX`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=51;

--
-- AUTO_INCREMENT für Tabelle `AuditVdS`
--
ALTER TABLE `AuditVdS`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=63;

--
-- AUTO_INCREMENT für Tabelle `aud_abweichungen`
--
ALTER TABLE `aud_abweichungen`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT für Tabelle `aud_anhaenge`
--
ALTER TABLE `aud_anhaenge`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT für Tabelle `aud_audits`
--
ALTER TABLE `aud_audits`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT für Tabelle `aud_pruefpunkte`
--
ALTER TABLE `aud_pruefpunkte`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=487;

--
-- AUTO_INCREMENT für Tabelle `Auswirkung`
--
ALTER TABLE `Auswirkung`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT für Tabelle `bcm_bia`
--
ALTER TABLE `bcm_bia`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT für Tabelle `bcm_notfallplaene`
--
ALTER TABLE `bcm_notfallplaene`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT für Tabelle `bcm_prozesse`
--
ALTER TABLE `bcm_prozesse`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT für Tabelle `bcm_uebungen`
--
ALTER TABLE `bcm_uebungen`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT für Tabelle `bcm_uebung_anhaenge`
--
ALTER TABLE `bcm_uebung_anhaenge`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT für Tabelle `bedrohungen`
--
ALTER TABLE `bedrohungen`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=45;

--
-- AUTO_INCREMENT für Tabelle `bedrohung_kategorie`
--
ALTER TABLE `bedrohung_kategorie`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT für Tabelle `bericht_art`
--
ALTER TABLE `bericht_art`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT für Tabelle `bpmn_dokumente`
--
ALTER TABLE `bpmn_dokumente`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT für Tabelle `chm_changes`
--
ALTER TABLE `chm_changes`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT für Tabelle `chm_freigaben`
--
ALTER TABLE `chm_freigaben`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT für Tabelle `chm_historie`
--
ALTER TABLE `chm_historie`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT für Tabelle `cron_settings`
--
ALTER TABLE `cron_settings`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT für Tabelle `Dokumente`
--
ALTER TABLE `Dokumente`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=198;

--
-- AUTO_INCREMENT für Tabelle `dok_anhaenge`
--
ALTER TABLE `dok_anhaenge`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT für Tabelle `dok_historie`
--
ALTER TABLE `dok_historie`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=43;

--
-- AUTO_INCREMENT für Tabelle `dok_lesebestaetigung`
--
ALTER TABLE `dok_lesebestaetigung`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT für Tabelle `dok_status`
--
ALTER TABLE `dok_status`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT für Tabelle `dok_typ`
--
ALTER TABLE `dok_typ`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT für Tabelle `dok_typ_en`
--
ALTER TABLE `dok_typ_en`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT für Tabelle `Gefaehrdungen`
--
ALTER TABLE `Gefaehrdungen`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=48;

--
-- AUTO_INCREMENT für Tabelle `Incidents`
--
ALTER TABLE `Incidents`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT für Tabelle `inc_link`
--
ALTER TABLE `inc_link`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT für Tabelle `inc_meldepflicht`
--
ALTER TABLE `inc_meldepflicht`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT für Tabelle `inc_meldungen`
--
ALTER TABLE `inc_meldungen`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT für Tabelle `ismshilfe`
--
ALTER TABLE `ismshilfe`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT für Tabelle `ki_verbrauch`
--
ALTER TABLE `ki_verbrauch`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=171;

--
-- AUTO_INCREMENT für Tabelle `klassifizierung`
--
ALTER TABLE `klassifizierung`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT für Tabelle `klassifizierung_en`
--
ALTER TABLE `klassifizierung_en`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT für Tabelle `kommentare`
--
ALTER TABLE `kommentare`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT für Tabelle `kontakte_behoerden`
--
ALTER TABLE `kontakte_behoerden`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT für Tabelle `kontakte_dienstleister`
--
ALTER TABLE `kontakte_dienstleister`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT für Tabelle `kontakte_interessensgruppen`
--
ALTER TABLE `kontakte_interessensgruppen`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT für Tabelle `kontakte_kunden`
--
ALTER TABLE `kontakte_kunden`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT für Tabelle `kontakte_mitarbeiter`
--
ALTER TABLE `kontakte_mitarbeiter`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT für Tabelle `kritikalität`
--
ALTER TABLE `kritikalität`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT für Tabelle `Links`
--
ALTER TABLE `Links`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=35;

--
-- AUTO_INCREMENT für Tabelle `Massnahmen`
--
ALTER TABLE `Massnahmen`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=205;

--
-- AUTO_INCREMENT für Tabelle `mass_anhaenge`
--
ALTER TABLE `mass_anhaenge`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT für Tabelle `mgmt_review`
--
ALTER TABLE `mgmt_review`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT für Tabelle `netzwerkzonen`
--
ALTER TABLE `netzwerkzonen`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT für Tabelle `Normen`
--
ALTER TABLE `Normen`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT für Tabelle `norm_status`
--
ALTER TABLE `norm_status`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT für Tabelle `op_plan`
--
ALTER TABLE `op_plan`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT für Tabelle `Personal`
--
ALTER TABLE `Personal`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT für Tabelle `pers_onboarding`
--
ALTER TABLE `pers_onboarding`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT für Tabelle `pers_onb_equipment`
--
ALTER TABLE `pers_onb_equipment`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT für Tabelle `pers_onb_zugaenge`
--
ALTER TABLE `pers_onb_zugaenge`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT für Tabelle `pers_schulungen`
--
ALTER TABLE `pers_schulungen`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT für Tabelle `pers_schulung_teilnehmer`
--
ALTER TABLE `pers_schulung_teilnehmer`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT für Tabelle `plaene_dateien`
--
ALTER TABLE `plaene_dateien`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT für Tabelle `playbooks`
--
ALTER TABLE `playbooks`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT für Tabelle `Projekte`
--
ALTER TABLE `Projekte`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT für Tabelle `prozesslandkarte`
--
ALTER TABLE `prozesslandkarte`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=46;

--
-- AUTO_INCREMENT für Tabelle `pw_reset_tokens`
--
ALTER TABLE `pw_reset_tokens`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT für Tabelle `rechtsregister`
--
ALTER TABLE `rechtsregister`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=51;

--
-- AUTO_INCREMENT für Tabelle `rest_console_log`
--
ALTER TABLE `rest_console_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT für Tabelle `Risiko`
--
ALTER TABLE `Risiko`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=120;

--
-- AUTO_INCREMENT für Tabelle `Risiko_historie`
--
ALTER TABLE `Risiko_historie`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=92;

--
-- AUTO_INCREMENT für Tabelle `risiko_kategorie`
--
ALTER TABLE `risiko_kategorie`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- AUTO_INCREMENT für Tabelle `risiko_score`
--
ALTER TABLE `risiko_score`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT für Tabelle `risiko_score_historie`
--
ALTER TABLE `risiko_score_historie`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT für Tabelle `risiko_status`
--
ALTER TABLE `risiko_status`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT für Tabelle `Rollen`
--
ALTER TABLE `Rollen`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=74;

--
-- AUTO_INCREMENT für Tabelle `schwachstellen`
--
ALTER TABLE `schwachstellen`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=43;

--
-- AUTO_INCREMENT für Tabelle `schwachstelle_kategorie`
--
ALTER TABLE `schwachstelle_kategorie`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT für Tabelle `setup_angelegt`
--
ALTER TABLE `setup_angelegt`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT für Tabelle `smtp_settings`
--
ALTER TABLE `smtp_settings`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT für Tabelle `sql_console_log`
--
ALTER TABLE `sql_console_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT für Tabelle `Stammdaten`
--
ALTER TABLE `Stammdaten`
  MODIFY `Nummer` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=29;

--
-- AUTO_INCREMENT für Tabelle `stamm_kategorie`
--
ALTER TABLE `stamm_kategorie`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=36;

--
-- AUTO_INCREMENT für Tabelle `swm_schwachstellen`
--
ALTER TABLE `swm_schwachstellen`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT für Tabelle `tooltip_texte`
--
ALTER TABLE `tooltip_texte`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT für Tabelle `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;

--
-- AUTO_INCREMENT für Tabelle `vendor`
--
ALTER TABLE `vendor`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=90;

--
-- AUTO_INCREMENT für Tabelle `vendor_anhaenge`
--
ALTER TABLE `vendor_anhaenge`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=33;

--
-- AUTO_INCREMENT für Tabelle `vendor_fragebogen`
--
ALTER TABLE `vendor_fragebogen`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT für Tabelle `vendor_fragebogen_antwort`
--
ALTER TABLE `vendor_fragebogen_antwort`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT für Tabelle `vendor_frage_katalog`
--
ALTER TABLE `vendor_frage_katalog`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=50;

--
-- AUTO_INCREMENT für Tabelle `vendor_gewichte`
--
ALTER TABLE `vendor_gewichte`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT für Tabelle `vendor_historie`
--
ALTER TABLE `vendor_historie`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT für Tabelle `vendor_kurzbewertung`
--
ALTER TABLE `vendor_kurzbewertung`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT für Tabelle `vendor_status`
--
ALTER TABLE `vendor_status`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT für Tabelle `vendor_tier`
--
ALTER TABLE `vendor_tier`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT für Tabelle `vendor_typ`
--
ALTER TABLE `vendor_typ`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT für Tabelle `ziele_kpi`
--
ALTER TABLE `ziele_kpi`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT für Tabelle `ziele_kpi_historie`
--
ALTER TABLE `ziele_kpi_historie`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT für Tabelle `ziele_texte`
--
ALTER TABLE `ziele_texte`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT für Tabelle `zugriff_matrix`
--
ALTER TABLE `zugriff_matrix`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
